export default {
  count: 100,
  start: 0,
  total: 2115,
  books: [
    {
      rating: {
        max: 10,
        numRaters: 747,
        average: "8.3",
        min: 0
      },
      subtitle: "",
      author: ["Luke Welling", "Laura Thomson"],
      pubdate: "2009-01-01",
      tags: [
        {
          count: 1036,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 505,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 459,
          name: "mysql",
          title: "mysql"
        },
        {
          count: 265,
          name: "编程",
          title: "编程"
        },
        {
          count: 169,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 160,
          name: "web",
          title: "web"
        },
        {
          count: 100,
          name: "LAMP",
          title: "LAMP"
        },
        {
          count: 78,
          name: "Programming",
          title: "Programming"
        }
      ],
      origin_title: "PHP and MySQL Web Development, Fourth Edition",
      image: "https://img3.doubanio.com/view/subject/m/public/s3773304.jpg",
      binding: "16开",
      translator: ["武欣"],
      catalog:
        "读者反馈\n译者序\n前言\n作者简介\n第一篇 使用PHP\n第1章 PHP快速入门教程\n1.1 开始之前：了解PHP\n1.2 创建一个示例应用：Bob汽车零部件商店\n1.2.1 创建订单表单\n1.2.2 表单处理\n1.3 在HTML中嵌入PHP\n1.3.1 使用PHP标记\n1.3.2 PHP语句\n1.3.3 空格\n1.3.4 注释\n1.4 添加动态内容\n1.4.1 调用函数\n1.4.2 使用date()函数\n1.5 访问表单变量\n1.5.1 简短、中等以及长风格的表单变量\n1.5.2 字符串的连接\n1.5.3 变量和文本\n1.6 理解标识符\n1.7 检查变量类型\n1.7.1 PHP的数据类型\n1.7.2 类型强度\n1.7.3 类型转换\n1.7.4 可变变量\n1.8 声明和使用常量\n1.9 理解变量的作用域\n1.10 使用操作符\n1.10.1 算术操作符\n1.10.2 字符串操作符\n1.10.3 赋值操作符\n1.10.4 比较操作符\n1.10.5 逻辑操作符\n1.10.6 位操作符\n1.10.7 其他操作符\n1.11  计算表单总金额\n1.12  理解操作符的优先级和结合性：\n1.13 使用可变函数\n1.13.1 测试和设置变量类型\n1.13.2 测试变量状态\n1.13.3 变量的重解释\n1.14 根据条件进行决策\n1.14.1 if语句\n1.14.2 代码块\n1.14.3 else语句\n1.14.4 elseif语句\n1.14.5 switch语句\n1.14.6 比较不同的条件\n1.15 通过迭代实现重复动作\n1.15.1 while循环\n1.15.2 for和foreach循环\n1.15.3 do...while循环\n1.16 从控制结构或脚本中跳出\n1.17 使用可替换的控制结构语法\n1.18 使用declare\n1.19 下一章\n第2章 数据的存储与检索\n2.1 保存数据以便后期使用\n2.2 存储和检索Bob的订单\n2.3 文件处理\n2.4 打开文件\n2.4.1 选择文件模式\n2.4.2 使用fopen()打开文件\n2.4.3 通过FTP或HTTP打开文件\n2.4.4 解决打开文件时可能遇到的问题\n2.5 写文件\n2.5.1 fwrite()的参数\n2.5.2 文件格式\n2.6 关闭文件\n2.7 读文件\n2.7.1 以只读模式打开文件：fopen()\n2.7.2 知道何时读完文件：feof()\n2.7.3 每次读取一行数据：fgets()、fgetss()和fgetcsv()\n2.7.4 读取整个文件：readfile()、fpassthru()和file()\n2.7.5 读取一个字符：fgetc()\n2.7.6 读取任意长度：fread()\n2.8 使用其他有用的文件函数\n2.8.1 查看文件是否存在：file_exists()\n2.8.2 确定文件大小：filesize()\n2.8.3 删除一个文件：unlink()\n2.8.4 在文件中定位：rewind()、fseek()和ftell()\n2.9 文件锁定\n2.10 更好的方式：数据库管理系统\n2.10.1 使用普通文件的几个问题\n2.10.2  RDBMS是如何解决这些问题的\n2.11 进一步学习\n2.12 下一章\n第3章 使用数组\n3.1 什么是数组\n3.2 数字索引数组\n3.2.1 数字索引数组的初始化\n3.2.2 访问数组的内容\n3.2.3 使用循环访问数组\n3.3 使用不同索引的数组\n3.3.1 初始化相关数组\n3.3.2 访问数组元素\n3.3.3 使用循环语句\n3.4 数组操作符\n3.5 多维数组\n3.6 数组排序\n3.6.1 使用sort()函数\n3.6.2 使用asort()函数和ksort()函数对相关数组排序\n3.6.3 反向排序\n3.7 多维数组的排序\n3.7.1 用户定义排序\n3.7.2 反向用户排序\n3.8 对数组进行重新排序\n3.8.1 使用shuffle()函数\n3.8.2 使用array_reverse()函数\n3.9 从文件载入数组\n3.10 执行其他的数组操作\n3.10.1 在数组中浏览：each()、current()、reset()、end()、next()、pos()和prev()\n3.10.2 对数组的每一个元素应用任何函数：array_walk()\n3.10.3 统计数组元素个数：count()、sizeof()和array_count_values()\n3.10.4 将数组转换成标量变量：extract()\n3.11 进一步学习\n3.12 下一章\n第4章 字符串操作与正则表达式\n4.1 创建一个示例应用程序：智能表单邮件\n4.2 字符串的格式化\n4.2.1 字符串的整理：chop()、ltrim()和trim()\n4.2.2 格式化字符串以便显示\n4.2.3 格式化字符串以便存储：addslashes()和stripslashes()\n4.3 用字符串函数连接和分割字符串\n4.3.1 使用函数explode()、implode()和join()\n4.3.2 使用strtok()函数\n4.3.3 使用substr()函数\n4.4 字符串的比较\n4.4.1 字符串的排序：strcmp()、strcasecmp()和strnatcmp()\n4.4.2 使用strlen()函数测试字符串的长度\n4.5 使用字符串函数匹配和替换子字符串\n4.5.1 在字符串中查找字符串：strstr()、strchr()、strrchr()和stristr()\n4.5.2 查找子字符串的位置：strpos()、strrpos()\n4.5.3 替换子字符串：str_replace()、substr_replace()\n4.6 正则表达式的介绍\n4.6.1 基础知识\n4.6.2 字符集和类\n4.6.3 重复\n4.6.4 子表达式\n4.6.5 子表达式计数\n4.6.6 定位到字符串的开始或末尾\n4.6.7 分支\n4.6.8 匹配特殊字符\n4.6.9 特殊字符一览\n4.6.10 在智能表单中应用\n4.7 用正则表达式查找子字符串\n4.8 使用正则表达式分割字符串\n4.9 比较字符串函数和正则表达式函数\n4.10 进一步学习\n4.11 下一章\n第5章 代码重用与函数编写\n5.1 代码重用的好处\n5.1.1 成本\n5.1.2 可靠性\n5.1.3 一致性\n5.2 使用require()和include()函数\n5.2.1 文件扩展名和require()语句\n5.2.2 使用require()制作Web站点的模版\n5.2.3 使用auto_prepend_file和auto_append_file\n5.3 在PHP中使用函数\n5.3.1 调用函数\n5.3.2 调用未定义的函数\n5.3.3 理解字母大小写和函数名称\n5.4 理解为什么要定义自己的函数\n5.5 了解基本的函数结构\n5.5.1 函数命名\n5.6 使用参数\n5.7 理解作用域\n5.8 参数的引用传递和值传递\n5.9  使用Return关键字\n5.9.1 从函数返回一个值\n5.10  实现递归\n5.10.1 名称空间\n5.11 进一步学习\n5.12 下一章\n第6章 面向对象的PHP\n6.1 理解面向对象的概念\n6.1.1 类和对象\n6.1.2 多态性\n6.1.3 继承\n6.2 在PHP中创建类、属性和操作\n6.2.1 类的结构\n6.2.2 构造函数\n6.2.3 析构函数\n6.3 类的实例化\n6.4 使用类的属性\n6.5 使用private和public关键字控制访问\n6.6 类操作的调用\n6.7 在PHP中实现继承\n6.7.1 通过继承使用private和protected访问修饰符控制可见性\n6.7.2 重载\n6.7.3 使用final关键字禁止继承和重载\n6.7.4 理解多重继承\n6.7.5 实现接口\n6.8 类的设计\n6.9 编写类代码\n6.10 理解PHP面向对象新的高级功能\n6.10.1 使用Per-Class常量\n6.10.2 实现静态方法\n6.10.3 检查类的类型和类型提示\n6.10.4 克隆对象\n6.10.5 使用抽象类\n6.10.6 使用__call()重载方法\n6.10.7 使用__autoload()方法\n6.10.8 实现迭代器和迭代\n6.10.9 将类转换成字符串\n6.10.10 使用Reflection（反射）API\n6.11 下一章\n第7章  错误和 异常处理\n7.1 异常处理的概念\n7.2 Exception类\n7.3 用户自定义异常\n7.4 Bob的汽车零部件商店应用程序的异常\n7.5 异常和PHP的其他错误处理机制\n7.6 进一步学习\n7.7 下一章\n第二篇 使用MySQL\n第8章 设计Web数据库\n8.1 关系数据库的概念\n8.1.1 表格\n8.1.2 列\n8.1.3 行\n8.1.4 值\n8.1.5 键\n8.1.6 模式\n8.1.7 关系\n8.2 如何设计Web数据库\n8.2.1 考虑要建模的实际对象\n8.2.2 避免保存冗余数据\n8.2.3 使用原子列值\n8.2.4 选择有意义的键\n8.2.5 考虑需要询问数据库的问题\n8.2.6 避免多个空属性的设计\n8.2.7 表格类型的总结\n8.3 Web数据库架构\n8.4 进一步学习\n8.5 下一章\n第9章 创建Web数据库\n9.1 使用MySQL监视程序\n9.2 登录到MySQL\n9.3 创建数据库和用户\n9.4 设置用户与权限\n9.5 MySQL权限系统的介绍\n9.5.1 最少权限原则\n9.5.2 创建用户：GRANT命令\n9.5.3 权限的类型和级别\n9.5.4 REVOKE命令\n9.5.5 使用GRANT和REVOKE的例子\n9.6 创建一个Web用户\n9.7 使用正确的数据库\n9.8 创建数据库表\n9.8.1 理解其他关键字的意思\n9.8.2 理解列的类型\n9.8.3 用SHOW和DESCRIBE来查看数据库\n9.8.4 创建索引\n9.9 理解MySQL的标识符\n9.10 选择列数据类型\n9.10.1 数字类型\n9.10.2 日期和时间类型\n9.10.3 字符串类型\n9.11 进一步学习\n9.12 下一章\n第10章 使用MySQL数据库\n10.1 SQL是什么\n10.2 在数据库中插入数据\n10.3 从数据库中获取数据\n10.3.1 获取满足特定条件的数据\n10.3.2 从多个表中获取数据\n10.3.3 以特定的顺序获取数据\n10.3.4 分组与合计数据\n10.3.5 选择要返回的行\n10.3.6 使用子查询\n10.4 更新数据库记录\n10.5 创建后修改表\n10.6 删除数据库中的记录\n10.7 表的删除\n10.8 删除整个数据库\n10.9 进一步学习\n10.10 下一章\n第11章 使用PHP从Web访问MySQL数据库\n11.1 Web数据库架构的工作原理\n11.2 从Web查询数据库的基本步骤\n11.2.1 检查与过滤用户输入数据\n11.2.2 建立一个连接\n11.2.3  选择使用的数据库\n11.2.4 查询数据库\n11.2.5 检索查询结果\n11.2.6 从数据库断开连接\n11.3 将新信息放入数据库\n11.4 使用Prepared语句\n11.5 使用PHP与数据库交互的其他接口\n11.5.1 使用常规的数据库接口：PEAR MDB2\n11.6 进一步学习\n11.7 下一章\n第12章 MySQL高级管理\n12.1 深入理解权限系统\n12.1.1 user表\n12.1.2 db表和host表\n12.1.3 tables_priv表，columns_priv表和procs_priv表\n12.1.4 访问控制：MySQL如何使用Grant表\n12.1.5 更新权限：修改什么时候生效\n12.2 提高MySQL数据库的安全性\n12.2.1 从操作系统角度来保护MySQL\n12.2.2 密码\n12.2.3 用户权限\n12.2.4 Web问题\n12.3 获取更多关于数据库的信息\n12.3.1 使用SHOW获取信息\n12.3.2 使用DESCRIBE获取关于列的信息\n12.3.3 用EXPLAIN理解查询操作的工作过程\n12.4 数据库的优化\n12.4.1 设计优化\n12.4.2 权限\n12.4.3 表的优化\n12.4.4 使用索引\n12.4.5 使用默认值\n12.4.6 其他技巧\n12.5 备份MySQL数据库\n12.6 恢复MySQL数据库\n12.7 实现复制\n12.7.1 设置主服务器\n12.7.2 执行初始的数据传输\n12.7.3 设置一个/多个从服务器\n12.8 进一步学习\n12.9 下一章\n第13章 MySQL高级编程\n13.1 LOAD DATA INFILE语句\n13.2 存储引擎\n13.3 事务\n13.3.1 理解事务的定义\n13.3.2 通过InnoDB使用事务\n13.4 外键\n13.5 存储过程\n13.5.1 基本示例\n13.5.2 局部变量\n13.5.3 游标和控制结构\n13.6 进一步学习\n13.7 下一章\n第三篇 电子商务与安全性\n第14章 运营一个电子商务网站\n14.1 我们要实现什么目标\n14.2 考虑电子商务网站的类型\n14.2.1 使用在线说明书公布信息\n14.2.2 接收产品或服务的订单\n14.2.3 提供服务和数字产品\n14.2.4 为产品或服务增值\n14.2.5 减少成本\n14.3 理解风险和威胁\n14.3.1 网络黑客\n14.3.2 不能招揽足够的生意\n14.3.3 计算机硬件故障\n14.3.4 电力、通信、网络或运输故障\n14.3.5 广泛的竞争\n14.3.6 软件错误\n14.3.7 不断变化的政府政策和税收\n14.3.8 系统容量限制\n14.4 选择一个策略\n14.5 下一章\n第15章 电子商务的安全问题\n15.1 信息的重要程度\n15.2 安全威胁\n15.2.1 机密数据的泄露\n15.2.2 数据丢失和数据破坏\n15.2.3 数据修改\n15.2.4 拒绝服务\n15.2.5 软件错误\n15.2.6 否认\n15.3 易用性，性能、成本和安全性\n15.4 建立一个安全政策\n15.5 身份验证原则\n15.6 加密技术基础\n15.6.1 私有密钥加密\n15.6.2  公有密钥加密\n15.6.3 数字签名\n15.7 数字证书\n15.8 安全的Web服务器\n15.9 审计与日志记录\n15.10 防火墙\n15.11 备份数据\n15.11.1 备份常规文件\n15.11.2 备份与恢复MySQL数据库\n15.12 自然环境安全\n15.13 下一章\n第16章  Web应用的安全\n16.1处理安全性问题的策略\n16.1.1 以正确心态为开始\n16.1.2 安全性和可用性之间的平衡\n16.1.3 安全监视\n16.1.4 基本方法\n16.2 识别所面临的威胁\n16.2.1 访问或修改敏感数据\n16.2.2 数据丢失或破坏\n16.2.3 拒绝服务\n16.2.4 恶意代码注入\n16.2.5 服务器被攻破\n16.3了解与我们“打交道”的用户\n16.3.1 破解人员\n16.3.2 受影响机器的未知情用户\n16.3.3 对公司不满的员工\n16.3.4 硬件被盗\n16.3.5 我们自身\n16.4 代码的安全性\n16.4.1 过滤用户输入\n16.4.2 转义输出\n16.4.3 代码组织\n16.4.4 代码自身的问题\n16.4.5 文件系统因素\n16.4.6 代码稳定性和缺陷\n16.4.7 执行引号和exec\n16.5 Web服务器和PHP的安全性\n16.5.1 保持软件的更新\n16.5.2 查看php.ini文件\n16.5.3  Web服务器配置\n16.5.4 Web应用的商业主机服务\n16.6 数据库服务器的安全性\n16.6.1 用户和权限系统\n16.6.2发送数据至服务器\n16.6.3 连接服务器\n16.6.4 运行服务器\n16.7 保护网络\n16.7.1 安装防火墙\n16.7.2使用隔离区域（DMZ）\n16.7.3应对DoS和DDoS攻击\n16.8 计算机和操作系统的安全性\n16.8.1 保持操作系统的更新\n16.8.2只运行必须的软件\n16.8.3 服务器的物理安全性\n16.9 灾难计划\n16.10 下一章\n第17章 使用PHP和MySQL实现身份验证\n17.1 识别访问者\n17.2 实现访问控制\n17.2.1 保存密码\n17.2.2 密码的加密\n17.2.3 保护多个网页\n17.3 使用基本身份验证\n17.4 在PHP中使用基本身份验证\n17.5 在Apache的.htaccess文件中使用基本身份验证\n17.6 使用mod_auth_mysql身份验证\n17.6.1 安装mod_auth_mysql\n17.6.2 使用mod_auth_mysql\n17.7 创建自定义身份验证\n17.8 进一步学习\n17.9 下一章\n第18章 使用PHP和MySQL实现安全事务\n18.1 提供安全的事务处理\n18.1.1 用户机器\n18.1.2 Internet\n18.1.3 我们的系统\n18.2 使用加密套接字层（SSL）\n18.3 屏蔽用户的输入\n18.4 提供安全存储\n18.5 存储信用卡号码\n18.6 在PHP中使用加密技术\n18.6.1 安装GPG\n18.6.2 测试GPG\n18.7 进一步学习\n18.8 下一章\n第四篇 PHP的高级技术\n第19章 与文件系统和服务器的交互\n19.1 文件上载\n19.1.1 文件上载的HTML代码\n19.1.2 编写处理文件的PHP\n19.1.3 避免常见上载问题\n19.2 使用目录函数\n19.2.1 从目录读取\n19.2.2 获得当前目录的信息\n19.2.3 创建和删除目录\n19.3 与文件系统的交互\n19.3.1 获取文件信息\n19.3.2 更改文件属性\n19.3.3 创建、删除和移动文件\n19.4 使用程序执行函数\n19.5 与环境变量交互：getenv()和putenv()\n19.6 进一步学习\n19.7 下一章\n第20章 使用网络函数和协议函数\n20.1 了解可供使用的协议\n20.2 发送和读取电子邮件\n20.3 使用其他Web站点的数据\n20.4 使用网络查找函数\n20.5 备份或镜像一个文件\n20.5.1 使用FTP备份或镜像一个文件\n20.5.2 上传文件\n20.5.3 避免超时\n20.5.4 使用其他的FTP函数\n20.6 进一步学习\n20.7 下一章\n第21章 日期和时间的管理\n21.1 在PHP中获取日期和时间\n21.1.1 使用date()函数\n21.1.2 使用UNIX时间戳\n21.1.3 使用getdate()函数\n21.1.4 使用checkdate()函数检验日期有效性\n21.1.5 格式化时间戳\n21.2 在PHP日期格式和MySQL日期格式之间进行转换\n21.3 在PHP中计算日期\n21.4 在MySQL中计算日期\n21.5 使用微秒\n21.6 使用日历函数\n21.7 进一步学习\n21.8 下一章\n第22章 创建图像\n22.1 在PHP中设置图像支持\n22.2 理解图像格式\n22.2.1 JPEG\n22.2.2 PNG\n22.2.3 WBMP\n22.2.4 GIF\n22.3 创建图像\n22.3.1 创建一个背景图像\n22.3.2 在图像上绘图或打印文本\n22.3.3 输出最终图形\n22.3.4 清理\n22.4 在其他页面中使用自动生成的图像\n22.5 使用文本和字体创建图像\n22.5.1 创建基本画布\n22.5.2 将文本调整到适合按钮\n22.5.3 放置文本\n22.5.4 将文本写到按钮上\n22.5.5 完成\n22.6 绘制图像与用图表描绘数据\n22.7 使用其他的图像函数\n22.8 进一步学习\n22.9 下一章\n第23章 在PHP中使用会话控制\n23.1 什么是会话控制\n23.2 理解基本的会话功能\n23.2.1 什么是cookie\n23.2.2 通过PHP设置cookie\n23.2.3 在会话中使用cookie\n23.2.4 存储会话 ID\n23.3 实现简单的会话\n23.3.1 开始一个会话\n23.3.2 注册一个会话变量\n23.3.3 使用会话变量\n23.3.4 注销变量与销毁会话\n23.4 创建一个简单的会话例子\n23.5 配置会话控制\n23.6 通过会话控制实现身份验证\n23.7 进一步学习\n23.8 下一章\n第24章 其他有用的特性\n24.1 使用eval()函数对字符串求值\n24.2 终止执行：die和exit\n24.3 序列化变量和对象\n24.4 获取PHP环境信息\n24.4.1 找到所加载的PHP扩展部件\n24.4.2 识别脚本所有者\n24.4.3 确定脚本最近修改时间\n24.5 暂时改变运行时环境\n24.6 源代码加亮\n24.7 在命令行中使用PHP\n24.8 下一章\n第五篇 创建实用的PHP和MySQL项目\n第25章 在大型项目中使用PHP和MySQL\n25.1 在Web开发中应用软件工程\n25.2 规划和运行Web应用程序项目\n25.3 重用代码\n25.4 编写可维护代码\n25.4.1 编码标准\n25.4.2 分解代码\n25.4.3 使用标准的目录结构\n25.4.4 文档化和共享内部函数\n25.5 实现版本控制\n25.6 选择一个开发环境\n25.7 项目的文档化\n25.8 建立原型\n25.9 将逻辑和内容分离\n25.10 优化代码\n25.10.1 使用简单优化\n25.10.2 使用Zend产品\n25.11 测试\n25.12 进一步学习\n25.13 下一章\n第26章 调试\n26.1 编程错误\n26.1.1 语法错误\n26.1.2 运行时错误\n26.1.3 逻辑错误\n26.2 使用变量帮助调试\n26.3 错误报告级别\n26.4 改变错误报告设置\n26.5 触发自定义错误\n26.6 巧妙地处理错误\n26.7 下一章\n第27章 建立用户身份验证机制和个性化设置\n27.1 解决方案的组成\n27.1.1 用户识别和个性化设置\n27.1.2 保存书签\n27.1.3 推荐书签\n27.2 解决方案概述\n27.3 实现数据库\n27.4 实现基本的网站\n27.5 实现用户身份验证\n27.5.1 注册\n27.5.2 登录\n27.5.3 登出\n27.5.4 修改密码\n27.5.5 重设遗忘的密码\n27.6 实现书签的存储和检索\n27.6.1 添加书签\n27.6.2 显示书签\n27.6.3 删除书签\n27.7 实现书签推荐\n27.8 考虑可能的扩展\n27.9 下一章\n第28章 创建一个购物车\n28.1 解决方案的组成\n28.1.1 创建一个在线目录\n28.1.2 在用户购买商品的时候记录购买行为\n28.1.3 实现一个付款系统\n28.1.4 创建一个管理界面\n28.2 解决方案概述\n28.3 实现数据库\n28.4 实现在线目录\n28.4.1 列出目录\n28.4.2 列出一个目录中的所有图书\n28.4.3 显示图书详细信息\n28.5 实现购物车\n28.5.1 使用show_cart.php脚本\n28.5.2 浏览购物车\n28.5.3 将物品添加到购物库\n28.5.4 保存更新后的购物车\n28.5.5 打印标题栏摘要\n28.5.6 结账\n28.6 实现付款\n28.7 实现一个管理界面\n28.8 扩展该项目\n28.9 使用一个已有系统\n28.10 下一章\n第29章 创建一个基于Web的电子邮件服务系统\n29.1 解决方案的组成\n29.1.1 电子邮件协议：POP3和IMAP\n29.1.2 PHP对POP3和IMAP的支持\n29.2 解决方案概述\n29.3 建立数据库\n29.4 了解脚本架构\n29.5 登录与登出\n29.6 建立账户\n29.6.1 创建一个新账户\n29.6.2 修改已有账户\n29.6.3 删除账户\n29.7 阅读邮件\n29.7.1 选择账户\n29.7.2 查看邮箱内容\n29.7.3 阅读邮件消息\n29.7.4 查看消息标题\n29.7.5 删除邮件\n29.8 发送邮件\n29.8.1 发送一则新消息\n29.8.2 回复或转发邮件\n29.9 扩展这个项目\n29.10 下一章\n第30章 创建一个邮件列表管理器\n30.1 解决方案的组成\n30.1.1 建立列表和订阅者数据库\n30.1.2 上载新闻信件\n30.1.3 发送带附件的邮件\n30.2 解决方案概述\n30.3 建立数据库\n30.4 定义脚本架构\n30.5 实现登录\n30.5.1 新账户的创建\n30.5.2 登录\n30.6 用户函数的实现\n30.6.1 查看列表\n30.6.2 查看邮件列表信息\n30.6.3 查看邮件列表存档\n30.6.4 订阅与取消订阅\n30.6.5 更改账户设置\n30.6.6 更改密码\n30.6.7 登出\n30.7 管理功能的实现\n30.7.1 创建新的邮件列表\n30.7.2 上载新的新闻信件\n30.7.3 多文件上载的处理\n30.7.4 预览新闻信件\n30.7.5 发送邮件\n30.8 扩展这个项目\n30.9 下一章\n第31章 创建一个Web论坛\n31.1 理解流程\n31.2 解决方案的组成\n31.3 解决方案概述\n31.4 数据库的设计\n31.5 查看文章的树型结构\n31.5.1 展开和折叠\n31.5.2 显示文章\n31.5.3 使用treenode类\n31.6 查看单个的文章\n31.7 添加新文章\n31.8 添加扩充\n31.9 使用一个已有的系统\n31.10 下一章\n第32章 生成PDF格式的个性化文档\n32.1 项目概述\n32.1.1 评估文档格式\n32.2 解决方案的组成\n32.2.1 问题与回答系统\n32.2.2 文档生成软件\n32.3 解决方案概述\n32.3.1 提问\n32.3.2 给答题评分\n32.3.3 生成RTF证书\n32.3.4 从模板生成PDF证书\n32.3.5 使用PDFlib生成PDF文档\n32.3.6 使用PDFlib的一个“Hello World”程序\n32.3.7 用PDFlib生成证书\n32.4 处理标题的问题\n32.5 扩展该项目\n32.6 下一章\n第33章 使用XML和SOAP来连接Web服务\n33.1 项目概述：使用XML和Web服务\n33.1.1 理解XML\n33.1.2 理解Web服务\n33.2 解决方案的组成\n33.2.1 使用Amazon的Web服务接口\n33.2.2  XML的解析：REST响应\n33.2.3 在PHP中使用SOAP\n33.2.4 缓存\n33.3 解决方案概述\n33.3.1 核心应用程序\n33.3.2 显示特定种类的图书\n33.3.3 获得一个AmazonResultSet类\n33.3.4 使用REST发送和接收请求\n33.3.5 使用SOAP发送和接收请求\n33.3.6 缓存请求返回的数据\n33.3.7 创建购物车\n33.3.8 到Amazon付账\n33.4 安装项目代码\n33.5 扩展这个项目\n33.6 进一步学习\n第34 章使用Ajax构建Web 2.0应用\n34.1 Ajax 是什么？\n34.1.1 HTTP请求和响应\n34.1. 2 DHTML和XHTML\n34.1.3 级联样式单（CSS）\n34.1.4 客户端编程\n34.1.5 服务器端编程\n34.1.6 XML和XSLT\n34.2 Ajax基础\n34.2.1 XMLHTTPRequest对象\n34.2.2 与服务器通信\n34.2.3 处理服务器响应\n34.2.4 整合应用\n34.3 在以前的项目添加Ajax元素\n34.3.1在PHPBookmark应用中添加Ajax元素\n34.4 进一步学习\n34.4.1 进一步了解文档对象模型（DOM）\n34.4.2 Ajax应用可用的JavaScript函数库\n34.4.3 Ajax开发人员网站\n第六篇 附录\n附录A 安装PHP及MySQL\n附录B Web资源\n第1章 PHP快速入门教程\n第2章 数据的存储与检索\n第3章 使用数组\n第4章 字符串操作与正则表达式\n第5章 代码重用与函数编写\n第6章 面向对象的PHP\n第7章 错误和异常处理",
      pages: "714",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s3773304.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s3773304.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s3773304.jpg"
      },
      alt: "https://book.douban.com/subject/3549421/",
      id: "3549421",
      publisher: "机械工业出版社",
      isbn10: "7111262816",
      isbn13: "9787111262817",
      title: "PHP和MySQL Web开发(原书第4版)",
      url: "https://api.douban.com/v2/book/3549421",
      alt_title: "PHP and MySQL Web Development, Fourth Edition",
      author_intro:
        "Laura Thomson是Mozilla公司的高级软件工程师。之前，她是OmniTI公司和Tangled Web Design公司的合伙人。此外，Laura曾经在RMIT大学和波士顿顾问集团工作过。她获得了应用科学（计算机科学）的学士学位和工程学（计算机系统工程）学士学位。在她的空闲时间，她非常喜欢骑马，讨论免费软件和开源软件以及睡觉。.\nLuke Welling是OmniTI公司的一位Web架构师，他经常在一些国际会议（例如，OSCON， ZendCon， MySQLUC，HPCon，OSDC以及LinuxTag）中就开源和Web开发的话题发表演讲。在加入OmniTI公司..",
      summary:
        "本书将PHP开发与MySQL应用相结合，分别对PHP和MySQL做了深入浅出的分析，不仅介绍PHP和MySQL的一般概念，而且对PHP和MySQL的Web应用做了较全面的阐述，并包括几个经典且实用的例子。.\n本书是第4版，经过了全面的更新、重写和扩展，包括PHP 5.3最新改进的特性（例如，更好的错误和异常处理），MySQL的存储过程和存储引擎，Ajax技术与Web 2.0以及Web应用需要注意的安全问题。...",
      series: {
        id: "28671",
        title: "开发人员专业技术丛书"
      },
      price: "95.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 52,
        average: "7.3",
        min: 0
      },
      subtitle: "Professional Search Engine Optimization With PHP",
      author: ["美国)(Sirovich.J)西若威齐 (美国)(Darie.C)达里"],
      pubdate: "2008-07-01",
      tags: [
        {
          count: 28,
          name: "搜索引擎",
          title: "搜索引擎"
        },
        {
          count: 26,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 22,
          name: "SEO",
          title: "SEO"
        },
        {
          count: 8,
          name: "@值得看-技术-SEO",
          title: "@值得看-技术-SEO"
        },
        {
          count: 6,
          name: "网站开发",
          title: "网站开发"
        },
        {
          count: 2,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 1,
          name: "软件",
          title: "软件"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s3218036.jpg",
      binding: "",
      translator: ["邓少鹍"],
      catalog: "",
      pages: "339",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s3218036.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s3218036.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s3218036.jpg"
      },
      alt: "https://book.douban.com/subject/3164126/",
      id: "3164126",
      publisher: "清华大学出版社",
      isbn10: "7302179514",
      isbn13: "9787302179511",
      title: "搜索引擎优化高级编程",
      url: "https://api.douban.com/v2/book/3164126",
      alt_title: "",
      author_intro:
        "Jaimie Sirovich是一位搜索引擎营销顾问，致力于与客户一起构建强大的在线展示平台。虽然Jaimie身为一个计算机程序员，但是他更乐于参与营销方面的工作。他毕业于Stevens Institute of Technology，获得计算机科学学士学位。2005年之前，他任职于RustyBrick, Inc.公司，并在Barry Schwartz的带领下展开工作，在电子商务项目中担任高级程序员。Jaimie目前担任几个公司的顾问，并且管理热门的搜索引擎营销博客SEOEgghead.com。\nCristian Darie是一位软件工程师，对各种现代技术具备丰厚的经验,撰写多本技术图书,涵盖AJAX.SQL及相关领域.Cristian目前居住在Bucharest,正在攻读分布式应用体系结构博士学位.他曾参与多个商业和研究项目,闲暇时也喜爱参与社交活动并获得乐趣.",
      summary:
        "搜索引擎优化在传统意义上是营销团队的工作。但在本书里，我们将从另外一个角度看待搜索引擎优化，让编程人员也参与到搜索引擎优化的队伍中来。\n这本手册专门为PHP开发人员或涉及技术的营销人员编写，涵盖了从Web站点的最初设想、技术规划、可视化设计到贯穿开发的整个过程。本书深入讨论了各种可用于提升站点知名度的技术和服务，并提供大量有用的信息以帮助您创建并维护搜索引擎友好的Web站点和避免一些常见的错误。\n搜索引擎优化(SEO)不只是营销部门的工作。它必须经过Web站点开发人员的深思熟虑，贯穿了从最初的Web站点设想开始的整个开发过程。通过改变Web站点的体系结构和修改其表现技术，能够极大地提升搜索引擎的排名和流量水平。\n这本独特的手册专门为PHP开发人员或涉足技术的营销人员编写，为创建和维护针对搜索引擎进行优化的Web站点提供了各种技术，包括如何通过简化站点的索引及如何通过协调专业技术和服务来提升自己的站点。本书将指导您理解Web站点体系结构在搜索引擎优化中的角色，并学习相关的各种主题，从而帮助您开发出搜索引擎排名靠前的站点。最后，本书通过创建一个简单的电子商务商店和优化的WordPress博客来教会您如何运用这些知识。\n本书主要内容\n影响搜索引擎排名的各种因素\n使用PHP、Apache和mod_rewrite创建富含关键词的URL\n使用HTTP报头来正确指示Web文档的状态\n创建优化的内容和有效地处理重复的内容\n避免成为黑帽(black hat)SEO技术的牺牲品\n地域定向(geo-targeting)和伪装(cloaking)技术\n使访问者和搜索引擎可以高效地使用站点地图\n创建搜索引擎友好的WordPress博客\n创建搜索引擎友好的电子商务商店\n本书读者对象\n本书针对需要将搜索引擎优化原理运用于Web应用开发的PHP开发人员，以及希望更好地理解营销中涉及的搜索引擎技术的市场营销员。",
      price: "48.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 468,
        average: "8.6",
        min: 0
      },
      subtitle: "",
      author: ["Luke Welling", "Laura Thomson"],
      pubdate: "2005-12-01",
      tags: [
        {
          count: 508,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 293,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 203,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 124,
          name: "PHP和MySQL",
          title: "PHP和MySQL"
        },
        {
          count: 103,
          name: "编程",
          title: "编程"
        },
        {
          count: 88,
          name: "Web",
          title: "Web"
        },
        {
          count: 59,
          name: "入门",
          title: "入门"
        },
        {
          count: 43,
          name: "技术",
          title: "技术"
        }
      ],
      origin_title: "PHP and MySQL Web Development, 3rd Ed",
      image: "https://img3.doubanio.com/view/subject/m/public/s1627655.jpg",
      binding: "平装",
      translator: ["武欣", "邵煜"],
      catalog:
        "第一篇 使用PHP\n第1章 PHP快速入门教程 1\n1.1 使用PHP 2\n1.2 创建一个示例应用：Bob's Auto Parts（Bob汽车零部件商店）2\n1.2.1 创建订单表单 2\n1.2.2 表单处理 4\n1.3 在HTML中嵌入PHP 4\n1.3.1 使用PHP标记 5\n1.3.2 PHP标记风格 5\n1.3.3 PHP语句 6\n1.3.4 空格 6\n1.3.5 注释 7\n1.4 添加动态内容 8\n1.4.1 调用函数 8\n1.4.2 使用date()函数 9\n1.5 访问表单变量 9\n1.5.1 表单变量 9\n1.5.2 字符串的连接 11\n1.5.3 变量和文本 12\n1.6 理解标识符 13\n1.7 创建用户声明的变量 13\n1.8 给变量赋值 13\n1.9 检查变量的类型 13\n1.9.1 PHP的数据类型 13\n1.9.2 类型强度 14\n1.9.3 类型转换 14\n1.9.4 可变变量 14\n1.10 声明和使用常量 15\n1.11 理解变量的作用域 16\n1.12 使用操作符 16\n1.12.1 算术操作符 17\n1.12.2 字符串操作符 17\n1.12.3 赋值操作符 17\n1.12.4 比较操作符 19\n1.12.5 逻辑操作符 20\n1.12.6 位操作符 21\n1.12.7 其他操作符 21\n1.13 使用操作符：计算表单总金额 23\n1.14 理解操作符的优先级和结合性：表达式求值 24\n1.15 使用可变函数 25\n1.15.1 测试和设置变量类型 26\n1.15.2 测试变量状态 26\n1.15.3 变量的重解释 27\n1.16 实现控制结构 27\n1.17 根据条件进行判断 27\n1.17.1 if语句 28\n1.17.2 代码块 28\n1.17.3 else语句 28\n1.17.4 elseif语句 29\n1.17.5 switch语句 30\n1.17.6 比较不同的条件 31\n1.18 通过迭代实现重复动作 32\n1.18.1 while循环 33\n1.18.2 for和foreach循环 34\n1.18.3 do...while循环 35\n1.19 从控制结构或脚本中跳出 35\n1.20 使用可替换的控制结构语法 36\n1.21 使用declare 36\n1.22 下一章：保存客户的订单 37\n第2章 数据的存储与检索 38\n2.1 保存数据以便后期使用 38\n2.2 存储和检索Bob的订单 38\n2.3 文件处理 39\n2.4 打开文件 40\n2.4.1 选择文件模式 40\n2.4.2 使用fopen()打开文件 40\n2.4.3 通过FTP或HTTP打开文件 42\n2.4.4 解决打开文件时可能遇到的问题 42\n2.5 写文件 44\n2.5.1 fwrite()的参数 44\n2.5.2 文件格式 45\n2.6 关闭文件 45\n2.7 读文件 47\n2.7.1 以只读模式打开文件：fopen() 48\n2.7.2 知道何时读完文件：feof() 48\n2.7.3 每次读取一行数据：fgets()、fgetss()和fgetcsv() 49\n2.7.4 读取整个文件：readfile()、fpassthru()和file() 49\n2.7.5 读取一个字符：fgetc() 50\n2.7.6 读取任意长度：fread() 51\n2.8 使用其他有用的文件函数 51\n2.8.1 查看文件是否存在：file_exists() 51\n2.8.2 确定文件大小：filesize() 51\n2.8.3 删除一个文件：unlink() 51\n2.8.4 在文件中定位：rewind()、fseek()和ftell() 52\n2.9 文件锁定 52\n2.10 更好的方式：数据库管理系统 53\n2.10.1 使用普通文件的几个问题 54\n2.10.2 RDBMS是如何解决这些问题的 54\n2.11 进一步学习 54\n2.12 下一章 55\n第3章 使用数组 56\n3.1 什么是数组 56\n3.2 数字索引数组 57\n3.2.1 数字索引数组的初始化 57\n3.2.2 访问数组的内容 57\n3.2.3 使用循环访问数组 58\n3.3 使用不同索引的数组 59\n3.3.1 初始化相关数组 59\n3.3.2 访问数组元素 59\n3.3.3 使用循环语句 59\n3.4 数组操作符 60\n3.5 多维数组 61\n3.6 数组排序 64\n3.6.1 使用sort()函数 64\n3.6.2 使用asort()函数和ksort()函数对相关数组排序 64\n3.6.3 反向排序 65\n3.7 多维数组的排序 65\n3.7.1 用户定义排序 65\n3.7.2 反向用户排序 66\n3.8 对数组进行重新排序 67\n3.8.1 使用shuffle()函数 67\n3.8.2 使用array-reverse()函数 68\n3.9 从文件载入数组 69\n3.10 执行其他的数组操作 71\n3.10.1 在数组中浏览：each()、current()、reset()、end()、next()、pos()和prev() 71\n3.10.2 对数组的每一个元素应用任何函数：array_walk() 72\n3.10.3 统计数组元素个数：count()、sizeof()和array_count_values(}73\n3.10.4 将数组转换成标量变量：extract() 73\n3.11 进一步学习 75\n3.12 下一章 75\n第4章 字符串操作与正则表达式 76\n4.1 创建一个示例应用程序：智能表单邮件 76\n4.2 字符串的格式化 78\n4.2.1 字符串的整理：chop()、ltrim()和trim() 78\n4.2.2 格式化字符串以便显示 78\n4.2.3 格式化字符串以便存储：addslashes()和stripslashes() 81\n4.3 用字符串函数连接和分割字符串 82\n4.3.1 使用函数explode()、implode()和join() 82\n4.3.2 使用strtok()函数 83\n4.3.3 使用substr()函数 83\n4.4 字符串的比较 84\n4.4.1 字符串的排序：strcmp()、strcasecmp()和strnatcmp() 84\n4.4.2 使用strlen()函数测试字符串的长度 85\n4.5 使用字符串函数匹配和替换子字符串 85\n4.5.1 在字符串中查找字符串：strstr()、strchr()、strrchr()stristr()85\n4.5.2 查找子字符串的位置：strpos()、strrpos() 86\n4.5.3 替换子字符串：str_replace()、substr_replace() 87\n4.6 正则表达式的介绍 88\n4.6.1 基础知识 88\n4.6.2 字符集和类 88\n4.6.3 重复 89\n4.6.4 子表达式 89\n4.6.5 子表达式计数 90\n4.6.6 定位到字符串的开始或末尾 90\n4.6.7 分支 90\n4.6.8 匹配特殊字符 90\n4.6.9 特殊字符一览 91\n4.6.10 在智能表单中应用 91\n4.7 用正则表达式查找子字符串 92\n4.8 用正则表达式替换子字符串 93\n4.9 使用正则表达式分割字符串 93\n4.10 比较字符串函数和正则表达式函数 93\n4.11 进一步学习 93\n4.12 下一章 93\n第5章 代码重用与函数编写 94\n5.1 代码重用 94\n5.1.1 成本 94\n5.1.2 可靠性 94\n5.1.3 一致性 95\n5.2 使用require()和include()函数 95\n5.2.1 require()函数 95\n5.2.2 文件扩展名和require()语句 96\n5.2.3 PHP标记和require()语句 96\n5.3 使用require()制作Web站点的模版 96\n5.3.1 使用include() 100\n5.3.2 使用require_once()和include_once() 100\n5.3.3 使用auto_prepend_file和auto_append_file 101\n5.4 在PHP中使用函数 101\n5.4.1 调用函数 101\n5.4.2 调用未定义的函数 103\n5.4.3 理解字母大小写和函数名称 103\n5.5 理解为什么要定义自己的函数 103\n5.6 了解基本的函数结构 104\n5.7 使用参数 105\n5.8 理解作用域 107\n5.9 参数的引用传递和值传递 109\n5.10 从函数中返回 110\n5.11 从函数返回一个值 111\n5.12 实现递归 113\n5.13 进一步学习 114\n5.14 下一章 114\n第6章 面向对象的PHP 115\n6.1 面向对象的概念 115\n6.1.1 类和对象 115\n6.1.2 多态性 116\n6.1.3 继承 117\n6.2 在PHP中创建类、属性和操作 117\n6.2.1 类的结构 117\n6.2.2 构造函数 118\n6.2.3 析构函数 118\n6.3 类的实例化 118\n6.4 使用类的属性 119\n6.5 使用private和public关键字控制访问 121\n6.6 类操作的调用 121\n6.7 在PHP中实现继承 122\n6.7.1 通过继承使用private和protected访问修饰符控制可见性 123\n6.7.2 重载 124\n6.7.3 使用final关键字禁止继承和重载 125\n6.7.4 理解多重继承 126\n6.7.5 实现接口 126\n6.8 类的设计 127\n6.9 编写类代码 128\n6.10 理解PHP面向对象新的高级功能 135\n6.10.1 提示：PHP4和PHP5的比较 135\n6.10.2 使用Per-Class常量 135\n6.10.3 实现静态方法 135\n6.10.4 检查类的类型和类型提示 136\n6.10.5 克隆对象 136\n6.10.6 使用抽象类 137\n6.10.7 使用__call()重载方法 137\n6.10.8 使用__autoload()方法 138\n6.10.9 实现迭代器和迭代 138\n6.10.10 将类转换成字符串 140\n6.10.11 使用Reflection（反射）API 140\n6.11 下一章 141\n第7章 异常处理 142\n7.1 异常处理的概念 142\n7.2 Exception类 144\n7.3 用户自定义异常 144\n7.4 Bob的汽车零部件商店应用程序的异常 146\n7.5 异常和PHP的其他错误处理机制 150\n7.6 进一步学习 150\n7.7 下一章 150\n第二篇 使用MySQL\n第8章 设计Web数据库 151\n8.1 关系数据库的概念 152\n8.1.1 表格 152\n8.1.2 列 152\n8.1.3 行 152\n8.1.4 值 152\n8.1.5 键 152\n8.1.6 模式 153\n8.1.7 关系 153\n8.2 如何设计Web数据库 154\n8.2.1 考虑要建模的实际对象 154\n8.2.2 避免保存冗余数据 154\n8.2.3 使用原子列值 155\n8.2.4 选择有意义的键 156\n8.2.5 考虑需要询问数据库的问题 156\n8.2.6 避免多个空属性的设计 156\n8.2.7 表格类型的总结 157\n8.3 Web数据库架构 157\n8.4 进一步学习 158\n8.5 下一章 158\n第9章 创建Web数据库 159\n9.1 使用MySQL监视程序 160\n9.2 登录到MySQL 160\n9.3 创建数据库和用户 161\n9.4 设置用户与权限 162\n9.5 MySQL权限系统的介绍 162\n9.5.1 最少权限原则 162\n9.5.2 创建用户：GRANT命令 162\n9.5.3 权限的类型和级别 163\n9.5.4 REVOKE命令 165\n9.5.5 使用GRANT和REVOKE的例子 165\n9.6 创建一个Web用户 166\n9.7 使用正确的数据库 166\n9.8 创建数据库表 167\n9.8.1 理解其他关键字的意思 168\n9.8.2 理解列的类型 169\n9.8.3 用SHOW和DESCRIBE来查看数据库 170\n9.8.4 创建索引 171\n9.8.5 表格类型的提示 171\n9.9 理解MySQL的标识符 171\n9.10 选择列数据类型 172\n9.10.1 数字类型 173\n9.10.2 日期和时间类型 174\n9.10.3 字符串类型 174\n9.11 进一步学习 176\n9.12 下一章 176\n第10章 使用MySQL数据库 177\n10.1 SQL是什么 177\n10.2 在数据库中插入数据 177\n10.3 从数据库中获取数据 179\n10.3.1 获取满足特定条件的数据 181\n10.3.2 从多个表中获取数据 182\n10.3.3 以特定的顺序获取数据 186\n10.3.4 分组与合计数据 186\n10.3.5 选择要返回的行 188\n10.3.6 使用子查询 188\n10.4 更新数据库记录 190\n10.5 创建后修改表 191\n10.6 删除数据库中的记录 193\n10.7 表的删除 193\n10.8 删除整个数据库 193\n10.9 进一步学习 194\n10.10 下一章 194\n第11章 使用PHP从Web访问MySQL数据库 195\n11.1 Web数据库架构的工作原理 195\n11.2 从Web查询数据库的基本步骤 198\n11.3 检查与过滤用户输入数据 198\n11.4 建立一个连接 199\n11.5 选择使用的数据库 200\n11.6 查询数据库 200\n11.7 检索查询结果 201\n11.8 从数据库断开连接 202\n11.9 将新信息放入数据库 202\n11.10 使用Prepared语句 205\n11.11 使用PHP与数据库交互的其他接口 206\n11.12 使用常规的数据库接口：PEAR DB 206\n11.13 进一步学习 209\n11.14 下一章 209\n第12章 MySQL高级管理 210\n12.1 深入理解权限系统 210\n12.1.1 user表 211\n12.1.2 db表和host表 212\n12.1.3 tables_priv表和columns_priv表 212\n12.1.4 访问控制：MySQL如何使用Grant表 213\n12.1.5 更新权限：修改什么时候生效 213\n12.2 提高MySQL数据库的安全性 214\n12.2.1 从操作系统角度来保护MySQL 214\n12.2.2 密码 214\n12.2.3 用户权限 215\n12.2.4 Web问题 215\n12.3 获取更多关于数据库的信息 216\n12.3.1 使用SHOW获取信息 216\n12.3.2 使用DESCRIBE获取关于列的信息 218\n12.3.3 用EXPLAIN理解查询操作的工作过程 218\n12.4 使用索引提高查询速度 221\n12.5 优化数据库 221\n12.5.1 设计优化 222\n12.5.2 权限 222\n12.5.3 表的优化 222\n12.5.4 使用索引 222\n12.5.5 使用默认值 222\n12.5.6 其他技巧 222\n12.6 备份MySQL数据库 222\n12.7 恢复MySQL数据库 223\n12.8 实现复制 223\n12.8.1 设置主服务器 224\n12.8.2 执行初始的数据传输 224\n12.8.3 设置一个/多个从服务器 225\n12.9 进一步学习 225\n12.10 下一章 225\n第13章 MySQL高级编程 226\n13.1 LOAD DATA INFILE语句 226\n13.2 存储引擎 226\n13.3 事务 227\n13.3.1 理解事务的定义 227\n13.3.2 通过InnoDB使用事务 228\n13.4 外键 229\n13.5 存储过程 230\n13.5.1 基本示例 230\n13.5.2 局部变量 232\n13.5.3 游标和控制结构 233\n13.6 进一步学习 236\n13.7 下一章 236\n第三篇 电子商务与安全性\n第14章 运营一个电子商务网站 237\n14.1 我们要实现什么目标 237\n14.2 考虑电子商务网站的类型 237\n14.2.1 使用在线说明书公布信息 238\n14.2.2 接收产品或服务的订单 240\n14.2.3 提供服务和数字产品 243\n14.2.4 为产品或服务增值 243\n14.2.5 减少成本 243\n14.3 理解风险和威胁 244\n14.3.1 网络黑客 244\n14.3.2 不能招揽足够的生意 245\n14.3.3 计算机硬件故障 245\n14.3.4 电力、通信、网络或运输故障 245\n14.3.5 广泛的竞争 245\n14.3.6 软件错误 245\n14.3.7 不断变化的政府政策和税收 246\n14.3.8 系统容量限制 246\n14.4 基于策略作决定 246\n14.5 下一章 246\n第15章 电子商务的安全问题 247\n15.1 信息的重要程度 247\n15.2 安全威胁 248\n15.2.1 机密数据的泄露 248\n15.2.2 数据丢失和数据破坏 249\n15.2.3 数据修改 250\n15.2.4 拒绝服务 251\n15.2.5 软件错误 251\n15.2.6 否认 252\n15.3 易用性，性能、成本和安全性 253\n15.4 建立一个安全政策 253\n15.5 身份验证原则 254\n15.6 使用身份验证 254\n15.7 加密技术基础 255\n15.8 私有密钥加密 256\n15.9 公有密钥加密 256\n15.10 数字签名 256\n15.11 数字证书 257\n15.12 安全的Web服务器 258\n15.13 审计与日志记录 259\n15.14 防火墙 259\n15.15 备份数据 259\n15.15.1 备份常规文件 260\n15.15.2 备份与恢复MySQL数据库 260\n15.16 自然环境安全 260\n15.17 下一章 261\n第16章 使用PHP和MySQL实现身份验证 262\n16.1 识别访问者 262\n16.2 实现访问控制 263\n16.2.1 保存密码 265\n16.2.2 密码的加密 267\n16.2.3 保护多个网页 268\n16.3 使用基本身份验证 269\n16.4 在PHP中使用基本身份验证 270\n16.5 在Apache的.htaccess文件中使用基本身份验证 271\n16.6 在IIS上使用基本身份验证 274\n16.7 使用mod_auth_mysql身份验证 276\n16.7.1 安装mod_auth_mysql 276\n16.7.2 检查是否正常工作 276\n16.7.3 使用mod_auth_mysql 277\n16.8 创建自定义身份验证 277\n16.9 进一步学习 278\n16.10 下一章 278\n第17章 使用PHP和MySQL实现安全事务 279\n17.1 提供安全的事务处理 279\n17.1.1 用户机器 280\n17.1.2 Internet 281\n17.1.3 我们的系统 281\n17.2 使用加密套接字层（SSL） 282\n17.3 屏蔽用户的输入 284\n17.4 提供安全存储 284\n17.5 确定是否需要存储信用卡号码 285\n17.6 在PHP中使用加密技术 286\n17.6.1 安装GPG 286\n17.6.2 测试GPG 288\n17.7 进一步学习 293\n17.8 下一章 293\n第四篇 PHP的高级技术\n第18章 与文件系统和服务器的交互 295\n18.1 文件上载 295\n18.1.1 文件上载的HTML 296\n18.1.2 关于安全性的提示 296\n18.1.3 编写处理文件的PHP 297\n18.1.4 常见问题 300\n18.2 使用目录函数 300\n18.2.1 从目录读取 300\n18.2.2 获得当前目录的信息 302\n18.2.3 创建和删除目录 302\n18.3 与文件系统的交互 302\n18.3.1 获取文件信息 302\n18.3.2 更改文件属性 304\n18.3.3 创建、删除和移动文件 305\n18.4 使用程序执行函数 305\n18.5 与环境变量交互：getenv()和putenv() 308\n18.6 进一步学习 308\n18.7 下一章 308\n第19章 使用网络函数和协议函数 309\n19.1 了解可供使用的协议 309\n19.2 发送和读取电子邮件 309\n19.3 使用其他Web站点 310\n19.4 使用网络查找函数 312\n19.5 使用FTP 316\n19.5.1 使用FTP备份或镜像一个文件 316\n19.5.2 上传文件 321\n19.5.3 避免超时 321\n19.5.4 使用其他的FTP函数 322\n19.6 进一步学习 322\n19.7 下一章 323\n第20章 日期和时间的管理 324\n20.1 在PHP中获取日期和时间 324\n20.1.1 使用date()函数 324\n20.1.2 使用UNIX时间戳 325\n20.1.3 使用getdate()函数 326\n20.1.4 检验日期有效性 327\n20.2 在PHP日期格式和MySQL日期格式之间进行转换 327\n20.3 在PHP中计算日期 329\n20.4 在MySQL中计算日期 329\n20.5 使用微秒 331\n20.6 使用日历函数 331\n20.7 进一步学习 332\n20.8 下一章 332\n第21章 创建图像 333\n21.1 在PHP中设定图像支持 333\n21.2 理解图像格式 334\n21.2.1 JPEG 334\n21.2.2 PNG 334\n21.2.3 WBMP 335\n21.2.4 GIF 335\n21.3 创建图像 335\n21.3.1 创建一个背景图像 336\n21.3.2 在图像上绘图或打印文本 337\n21.3.3 输出最终图形 338\n21.3.4 清理 339\n21.4 在其他页面中使用自动生成的图像 339\n21.5 使用文本和字体创建图像 339\n21.5.1 创建基本画布 342\n21.5.2 将文本调整到适合按钮 342\n21.5.3 放置文本 345\n21.5.4 将文本写到按钮上 345\n21.5.5 完成 345\n21.6 绘制图像与用图表描绘数据 346\n21.7 使用其他的图像函数 352\n21.8 进一步学习 352\n21.9 下一章 353\n第22章 在PHP中使用会话控制 354\n22.1 什么是会话控制 354\n22.2 理解基本的会话功能 354\n22.2.1 什么是cookie 354\n22.2.2 通过PHP设置cookie 355\n22.2.3 在会话中使用cookie 355\n22.2.4 存储会话 ID 356\n22.3 实现简单的会话 356\n22.3.1 开始一个会话 356\n22.3.2 注册一个会话变量 356\n22.3.3 使用会话变量 357\n22.3.4 注销变量与销毁会话 357\n22.4 创建一个简单的会话例子 357\n22.5 配置会话控制 359\n22.6 通过会话控制实现身份验证 360\n22.7 进一步学习 365\n22.8 下一章 365\n第23章 其他有用的特性 366\n23.1 使用魔术引用 366\n23.2 使用eval()函数对字符串求值 367\n23.3 中断执行：die和exit 367\n23.4 序列化变量和对象 368\n23.5 获取PHP环境信息 369\n23.5.1 找到所加载的PHP扩展部件 369\n23.5.2 识别脚本所有者 370\n23.5.3 确定脚本最近修改时间 370\n23.6 动态加载扩展部件 370\n23.7 暂时改变运行时环境 370\n23.8 源代码加亮 371\n23.9 在命令行中使用PHP 372\n23.10 下一章 372\n第五篇 创建实用的PHP和MySQL项目\n第24章 在大型项目中使用PHP和MySQL 373\n24.1 在Web开发中应用软件工程 374\n24.2 规划和运行Web应用程序项目 374\n24.3 重用代码 375\n24.4 编写可维护代码 375\n24.4.1 编码标准 375\n24.4.2 分解代码 378\n24.4.3 使用标准的目录结构 378\n24.4.4 文档化和共享内部函数 378\n24.5 实现版本控制 379\n24.6 选择一个开发环境 380\n24.7 项目的文档化 380\n24.8 建立原型 381\n24.9 将逻辑和内容分离 381\n24.10 优化代码 382\n24.10.1 使用简单优化 382\n24.10.2 使用Zend产品 382\n24.11 测试 383\n24.12 进一步学习 383\n24.13 下一章 384\n第25章 调试 385\n25.1 编程错误 385\n25.1.1 语法错误 385\n25.1.2 运行时错误 386\n25.1.3 逻辑错误 391\n25.2 使用变量帮助调试 392\n25.3 错误报告级别 393\n25.4 改变错误报告设置 394\n25.5 触发自定义错误 395\n25.6 巧妙地处理错误 396\n25.7 下一章 398\n第26章 建立用户身份验证机制和个性化设置 399\n26.1 问题所在 399\n26.2 解决方案的组成 399\n26.2.1 用户识别和个性化设置 399\n26.2.2 保存书签 400\n26.2.3 推荐书签 400\n26.3 解决方案概述 400\n26.4 实现数据库 402\n26.5 实现基本的网站 403\n26.6 实现用户身份验证 405\n26.6.1 注册 405\n26.6.2 登录 410\n26.6.3 登出 413\n26.6.4 修改密码 414\n26.6.5 重设遗忘的密码 416\n26.7 实现书签的存储和检索 420\n26.7.1 添加书签 420\n26.7.2 显示书签 422\n26.7.3 删除书签 422\n26.8 实现书签推荐 424\n26.9 封装和可能的扩展 427\n26.10 下一章 427\n第27章 创建一个购物车 428\n27.1 问题所在 428\n27.2 解决方案的组成 428\n27.2.1 创建一个在线目录 428\n27.2.2 在用户购买商品的时候记录购买行为 429\n27.2.3 实现一个付款系统 429\n27.2.4 创建一个管理界面 429\n27.3 解决方案概述 429\n27.4 实现数据库 432\n27.5 实现在线目录 434\n27.5.1 列出目录 434\n27.5.2 列出一个目录中的所有图书 437\n27.5.3 显示图书详细信息 438\n27.6 实现购物车 440\n27.6.1 使用show_cart.php脚本 440\n27.6.2 浏览购物车 442\n27.6.3 将物品添加到购物库 444\n27.6.4 保存更新后的购物车 446\n27.6.5 打印标题栏摘要 447\n27.6.6 结账 447\n27.7 实现付款 452\n27.8 实现一个管理界面 454\n27.9 扩展该项目 460\n27.10 使用一个已有系统 461\n27.11 下一章 461\n第28章 创建一个内容管理系统 462\n28.1 问题所在 462\n28.2 解决方案的需求 462\n28.3 已有系统 462\n28.4 编辑内容 463\n28.4.1 使内容进入系统 463\n28.4.2 数据库与文件存储的对比 463\n28.4.3 文档结构 464\n28.5 使用元数据 464\n28.6 格式化输出 465\n28.7 解决方案的设计/概述 465\n28.8 设计数据库 466\n28.9 实现CMS 467\n28.9.1 前台 467\n28.9.2 图像处理 471\n28.9.3 后台 473\n28.9.4 搜索 480\n28.9.5 编辑页面 483\n28.10 扩展该项目 485\n28.11 下一章 485\n第29章 创建一个基于Web的电子邮件服务系统 486\n29.1 问题所在 486\n29.2 解决方案的组成 486\n29.3 解决方案概述 488\n29.4 建立数据库 489\n29.5 了解脚本架构 490\n29.6 登录与登出 495\n29.7 建立账户 498\n29.7.1 创建一个新账户 499\n29.7.2 修改已有账户 501\n29.7.3 删除账户 501\n29.8 阅读邮件 502\n29.8.1 选择账户 502\n29.8.2 查看邮箱内容 504\n29.8.3 阅读邮件消息 507\n29.8.4 查看消息标题 509\n29.8.5 删除邮件 509\n29.9 发送邮件 510\n29.9.1 发送一则新消息 510\n29.9.2 回复或转发邮件 512\n29.10 扩展这个项目 514\n29.11 下一章 514\n第30章 创建一个邮件列表管理器 515\n30.1 问题所在 515\n30.2 解决方案的组成 515\n30.2.1 建立列表和订阅者数据库 516\n30.2.2 使用文件上载 516\n30.2.3 发送带附件的邮件 516\n30.3 解决方案概述 516\n30.4 建立数据库 518\n30.5 定义脚本架构 520\n30.6 实现登录 526\n30.6.1 新账户的创建 527\n30.6.2 登录 529\n30.7 用户函数的实现 531\n30.7.1 查看列表 531\n30.7.2 查看邮件列表信息 535\n30.7.3 查看邮件列表存档 536\n30.7.4 订阅与取消订阅 538\n30.7.5 更改账户设置 539\n30.7.6 更改密码 539\n30.7.7 登出 540\n30.8 管理功能的实现 541\n30.8.1 创建新的邮件列表 541\n30.8.2 上载新的新闻信件 543\n30.8.3 多文件上载的处理 545\n30.8.4 预览新闻信件 549\n30.8.5 发送邮件 550\n30.9 扩展这个项目 555\n30.10 下一章 555\n第31章 创建一个Web论坛 556\n31.1 问题所在 556\n31.2 解决方案的组成 556\n31.3 解决方案概述 557\n31.4 数据库的设计 558\n31.5 查看文章的树型结构 560\n31.5.1 展开和折叠 561\n31.5.2 显示文章 564\n31.5.3 使用treenode类 564\n31.6 查看单个的文章 570\n31.7 添加新文章 572\n31.8 添加扩充 578\n31.9 使用一个已有的系统 578\n31.10 下一章 578\n第32章 生成PDF格式的个性化文档 579\n32.1 问题所在 579\n32.2 评估文档格式 579\n32.2.1 纸张 580\n32.2.2 ASCII 580\n32.2.3 HTML 580\n32.2.4 字处理器格式 580\n32.2.5 RTF格式 581\n32.2.6 PostScript 581\n32.2.7 可移植文档格式（PDF） 582\n32.3 解决方案的组成 582\n32.3.1 问题与回答系统 583\n32.3.2 文档生成软件 583\n32.4 解决方案概述 585\n32.4.1 提问 585\n32.4.2 给答题评分 587\n32.4.3 生成RTF证书 589\n32.4.4 从模板生成PDF证书 591\n32.4.5 使用PDFlib生成PDF文档 595\n32.4.6 使用PDFlib的一个“Hello World”程序 595\n32.4.7 用PDFlib生成证书 598\n32.5 处理标题的问题 605\n32.6 扩展该项目 605\n32.7 进一步学习 606\n32.8 下一章 606\n第33章 使用XML和SOAP来连接Web服务 607\n33.1 问题所在 607\n33.2 理解XML 608\n33.3 理解Web服务 611\n33.3.1 SOAP 611\n33.3.2 WSDL 612\n33.4 解决方案的组成 612\n33.4.1 创建购物车 613\n33.4.2 使用Amazon的Web服务接口 613\n33.4.3 XML的解析 613\n33.4.4 在PHP中使用SOAP 614\n33.4.5 缓存 614\n33.5 解决方案概述 614\n33.5.1 核心应用程序 618\n33.5.2 显示特定种类的图书 623\n33.5.3 获得一个AmazonResultSet类 624\n33.5.4 使用基于HTTP的REST/XML 631\n33.5.5 使用SOAP 635\n33.5.6 缓存数据 636\n33.5.7 创建购物车 639\n33.5.8 到Amazon付账 642\n33.6 安装项目代码 642\n33.7 扩展这个项目 643\n33.8 进一步学习 643\n第六篇 附 录\n附录A 安装PHP及MySQL 645\n附录B Web资源 664",
      pages: "666",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s1627655.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s1627655.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s1627655.jpg"
      },
      alt: "https://book.douban.com/subject/1340507/",
      id: "1340507",
      publisher: "机械工业出版社",
      isbn10: "7111154703",
      isbn13: "9787111154709",
      title: "PHP和MySQL Web开发",
      url: "https://api.douban.com/v2/book/1340507",
      alt_title: "PHP and MySQL Web Development, 3rd Ed",
      author_intro:
        "Laura Thomson是澳大利亚墨尔本RMIT大学计算机科学信息技术学院的讲师。她也是Tangled Web Design公司的合伙人。Laura曾经在Telstra和波士顿顾问集团工作过。她获得了应用科学（计算机科学）的学士学位和工程学（计算机系统工程）学士学位，目前她正在攻读适应性Web站点的博士学位。",
      summary:
        "本书将PHP开发与MySQL应用相结合，分别对PHP和MySQL做了深入浅出的分析，不仅介绍PHP和MySQL的一般概念，而且对PHP和MySQL的Web应用做了较全面的阐述，并包括几个经典且实用的例子。",
      price: "78.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 25,
        average: "6.3",
        min: 0
      },
      subtitle: "编写高效PHP代码",
      author: ["Lorna Mitchell", "Davey Shafik", "Matthew Turland"],
      pubdate: "2012-11-1",
      tags: [
        {
          count: 50,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 21,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 9,
          name: "编程",
          title: "编程"
        },
        {
          count: 9,
          name: "PHP精粹",
          title: "PHP精粹"
        },
        {
          count: 5,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 5,
          name: "编程语言",
          title: "编程语言"
        },
        {
          count: 5,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 2,
          name: "软件开发",
          title: "软件开发"
        }
      ],
      origin_title: "PHP Master: Write Cutting-Edge Code",
      image: "https://img3.doubanio.com/view/subject/m/public/s25102894.jpg",
      binding: "",
      translator: ["彭冲", "胡琳"],
      catalog:
        "译者序\n前　言\n第1章　面向对象编程1\n1.1　为什么要使用面向对象编程1\n1.2　OOP简介1\n1.2.1　声明类1\n1.2.2　类的构造2\n1.2.3　对象实例化3\n1.2.4　自动加载3\n1.2.5　使用对象4\n1.2.6　使用静态属性和方法4\n1.2.7　对象和命名空间5\n1.3　对象的继承7\n1.4　对象和函数9\n1.4.1　类型提示9\n1.4.2　多态性9\n1.4.3　对象和引用10\n1.4.4　作为函数参数传递的对象11\n1.4.5　流畅的接口12\n1.5　public、private以及protected12\n1.5.1　public13\n1.5.2　private13\n1.5.3　protected13\n1.5.4　选择正确的可见性14\n1.5.5　使用getter和setter来控制可见性14\n1.5.6　使用神奇的_get和_set方法15\n1.6　接口16\n1.6.1　SPL Countable接口示例16\n1.6.2　计数对象16\n1.6.3　声明和使用接口17\n1.6.4　识别对象和接口17\n1.7　异常18\n1.7.1　处理异常18\n1.7.2　为什么要处理异常19\n1.7.3　抛出异常19\n1.7.4　扩展异常19\n1.7.5　捕捉特定类型的异常20\n1.7.6　设定一个全局异常处理程序21\n1.7.7　使用回调22\n1.8　更多神奇的方法22\n1.8.1　使用__call()和__callStatic()方法22\n1.8.2　使用__toString()方法输出对象23\n1.8.3　序列化对象24\n1.9　本章小结25\n第2章　数据库26\n2.1　数据持久化和Web应用程序26\n2.2　选择如何存储数据26\n2.3　用MySQL建立一个食谱网站27\n2.4　PHP数据库对象29\n2.4.1　使用PDO连接到MySQL29\n2.4.2　从表中选择数据30\n2.4.3　数据提取模式30\n2.4.4　参数和预处理语句31\n2.4.5　绑定值和预处理语句的变量32\n2.4.6　插入一行并获取ID34\n2.4.7　有多少行被插入、更新或删除34\n2.4.8　删除数据35\n2.5　处理PDO中的错误35\n2.5.1　处理预处理时的问题36\n2.5.2　处理执行时的问题36\n2.5.3　处理提取数据时的问题37\n2.6　高级PDO特征37\n2.6.1　事务和PDO38\n2.6.2　存储过程和PDO39\n2.7　设计数据库39\n2.7.1　主键与索引40\n2.7.2　MySQL解析40\n2.7.3　内部连接43\n2.7.4　外部连接43\n2.7.5　聚合函数和Group By44\n2.7.6　规格化数据46\n2.8　数据库—排序46\n第3章　API47\n3.1　开始之前47\n3.1.1　使用API工具47\n3.1.2　添加API到你的系统47\n3.2　面向服务的架构47\n3.3　数据格式48\n3.3.1　使用JSON49\n3.3.2　使用XML50\n3.4　HTTP：超文本传输协议53\n3.4.1　HTTP信封53\n3.4.2　发送HTTP请求54\n3.4.3　HTTP状态码57\n3.4.4　HTTP文件头58\n3.4.5　HTTP动词61\n3.5　理解并选择服务类型61\n3.5.1　PHP和SOAP62\n3.5.2　使用WSDL描述SOAP服务63\n3.6　调试HTTP65\n3.6.1　使用日志收集信息65\n3.6.2　检查HTTP流量65\n3.7　RPC服务66\n3.7.1　使用一个RPC服务：Flickr示例66\n3.7.2　建立一个RPC服务68\n3.8　Ajax和Web服务69\n3.9　开发和使用RESTful服务75\n3.9.1　超越Pretty URL75\n3.9.2　RESTful原则76\n3.9.3　建立一个RESTful服务76\n3.10　设计一个Web服务82\n3.11　提供的服务83\n第4章　设计模式84\n4.1　什么是设计模式84\n4.1.1　选择一个最合适的84\n4.1.2　单例模式84\n4.1.3　Traits86\n4.1.4　注册表模式87\n4.1.5　工厂模式90\n4.1.6　迭代模式91\n4.1.7　观察者模式98\n4.1.8　依赖注入101\n4.1.9　模型–视图–控制器104\n4.2　模式的形成114\n第5章　安全性115\n5.1　是否有些偏执115\n5.2　过滤输入、避免输出116\n5.3　跨站脚本117\n5.3.1　攻击117\n5.3.2　修复118\n5.3.3　在线资源119\n5.4　伪造跨站请求119\n5.4.1　攻击119\n5.4.2　修复120\n5.4.3　在线资源121\n5.5　会话固定122\n5.5.1　攻击122\n5.5.2　修复122\n5.5.3　在线资源123\n5.6　会话劫持123\n5.6.1　攻击123\n5.6.2　修复124\n5.6.3　在线资源125\n5.7　SQL注入125\n5.7.1　攻击125\n5.7.2　修复126\n5.7.3　在线资源127\n5.8　储存密码127\n5.8.1　攻击127\n5.8.2　修复127\n5.8.3　在线资源128\n5.9　暴力破解攻击129\n5.9.1　攻击129\n5.9.2　修复130\n5.9.3　在线资源131\n5.10　SSL131\n5.10.1　攻击131\n5.10.2　修复132\n5.10.3　在线资源132\n5.11　资源132\n第6章　性能134\n6.1　基准测试134\n6.2　系统测试139\n6.2.1　代码缓存139\n6.2.2　INI设置143\n6.3　数据库144\n6.4　文件系统144\n6.5　程序概要分析151\n6.5.1　安装XHProf152\n6.5.2　安装XHGui155\n6.6　本章小结161\n第7章　自动测试163\n7.1　单元测试163\n7.1.1　安装PHPUnit163\n7.1.2　编写测试用例163\n7.1.3　运行测试165\n7.1.4　测试替身167\n7.1.5　编写可测试的代码170\n7.1.6　测试视图和控制器173\n7.2　数据库测试177\n7.2.1　数据库测试用例177\n7.2.2　连接178\n7.2.3　数据集178\n7.2.4　断言180\n7.3　系统测试181\n7.3.1　初始设置181\n7.3.2　命令182\n7.3.3　定位器183\n7.3.4　断言184\n7.3.5　数据库集成184\n7.3.6　调试186\n7.3.7　自动编写测试187\n7.4　负载测试187\n7.4.1　ab187\n7.4.2　Siege188\n7.5　本章小结189\n第8章　质量保证190\n8.1　使用静态分析工具测量质量190\n8.1.1　phploc190\n8.1.2　phpcpd191\n8.1.3　phpmd192\n8.2　编码标准193\n8.2.1　使用PHP代码探测器检查编码标准193\n8.2.2　查看违反编码标准的地方195\n8.2.3　PHP代码探测器标准196\n8.3　文档和代码196\n8.3.1　使用phpDocumentor197\n8.3.2　其他文档工具199\n8.4　源代码管理199\n8.4.1　使用集中式版本控制200\n8.4.2　为了源代码管理使用版本控制201\n8.4.3　设计版本库的结构202\n8.4.4　分布式的版本控制204\n8.4.5　代码的社会性工具205\n8.4.6　使用Git进行源代码控制206\n8.4.7　将版本库作为构建过程的根207\n8.5　自动部署207\n8.5.1　立刻切换到一个新版本208\n8.5.2　管理数据库变更208\n8.5.3　自动部署和Phing209\n8.6　准备部署211\n附录A　PEAR和PECL212\n附录B　PHP标准库229\n附录C　进一步参考信息236",
      pages: "250",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s25102894.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s25102894.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s25102894.jpg"
      },
      alt: "https://book.douban.com/subject/19986990/",
      id: "19986990",
      publisher: "机械工业出版社",
      isbn10: "7111399072",
      isbn13: "9787111399070",
      title: "PHP精粹",
      url: "https://api.douban.com/v2/book/19986990",
      alt_title: "PHP Master: Write Cutting-Edge Code",
      author_intro:
        "Lorna Mitchell，资深PHP技术专家，常驻英国利兹的PHP顾问，从事软件开发相关工作多年，尤其擅长与数据和API相关的知识。活跃于PHP社区，是美国西北部PHP技术社群的组织者，曾组织过多次社团会议并发表演讲，是开源项目Joind.in的领导者。她还是一位技术作家，热衷于分享自己的经验，经常在多种流行杂志和网站上发表技术文章。\nDavey Shafik，资深LAMP技术专家，精通PHP，在HTML、CSS、JavaScript等Web相关技术领域也积累了十分丰富的经验。他还是一位经验丰富的技术作家，不仅发表了大量的技术文章，而且著有《The PHP Anthology: 101 Essential Tips, Tricks & Hacks》和《PHP Architect’s Zend PHP 5 Certification Study Guide》等著作。\nMatthew Turland，资深PHP技术专家，有近10年PHP开发经验，是PHP 5和Zend Framework的Zend认证工程师。他是Zend Framework、 PHPUnit和Phergie等PHP开源项目的参与者，为这些项目撰写了大量文章。他还是一位经验丰富的技术作家，不仅撰写了《PHP Architect’s Guide to Web Scraping with PHP》等著作，而且还在《PHP Architect》等杂志上发表了大量文章。",
      summary:
        "本书是资深PHP技术专家多年工作经验的结晶，从数据库、API、设计模式、安全性、应用程序性能、自动化测试、质量保证等核心方面总结了编写高效PHP代码的技巧和最佳实践，旨在让有一定基础的PHP开发者在进阶修炼的路上尽可能少走弯路！全书包含大量精心设计的示例，不仅能帮助读者理解具体的技术知识，而且能让读者学到作者解决各种问题的思路，授人以鱼同时授人以渔。\n本书共8章，每章一个主题：第1章重新阐述了面向对象编程中的核心概念和技术，目的是确保基础知识匮乏的开发者能正确理解它们；第2章总结了PHP开发中与数据库相关的各种最佳实践，如数据持久化、数据存储、MySQL使用方法、PDO，以及数据库的设计等；第3章详细讲解了API及其使用方式；第4章总结了PHP开发中常用的各种设计模式及其使用原则；第5章讲解了如何编写安全的PHP代码，对PHP开发中各种常见的安全问题进行了总结和分析；第6章从基准测试、系统测试、数据库、文件系统等方面探讨了PHP应用程序的性能问题；第7章讲解了PHP的自动化测试，包含单元测试、数据库测试、负载均衡测试等；第8章总结了PHP开发中与质量保证相关的最佳实践，包括质量测量、编码标准、源代码管理、自动部署等。除此之外，本书还对PEAR、PECL，以及PHP标准库进行了讲解。",
      series: {
        id: "12919",
        title: "华章程序员书库"
      },
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 326,
        average: "7.9",
        min: 0
      },
      subtitle: "",
      author: ["W.Jason Gilmore"],
      pubdate: "2007-01-01",
      tags: [
        {
          count: 439,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 260,
          name: "MYSQL",
          title: "MYSQL"
        },
        {
          count: 149,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 96,
          name: "编程",
          title: "编程"
        },
        {
          count: 75,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 59,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 54,
          name: "web",
          title: "web"
        },
        {
          count: 44,
          name: "LAMP",
          title: "LAMP"
        }
      ],
      origin_title: "Beginning PHP and MySQL 5, 2nd Ed.",
      image: "https://img3.doubanio.com/view/subject/m/public/s2160043.jpg",
      binding: "",
      translator: ["朱涛江"],
      catalog:
        "第1章 php概述\t1\n1.1 历史\t1\n1.1.1　php 4\t2\n1.1.2　php 5\t3\n1.2 php的一般特性\t3\n1.2.1　实用性\t3\n1.2.2　强大功能\t4\n1.2.3　可选择性\t4\n1.2.4　成本\t5\n1.3 小结\t5\n第2章 安装配置apache和php\t6\n2.1　安装\t6\n2.1.1　获得发行包\t6\n2.1.2　安装过程\t7\n2.1.3　测试安装\t11\n2.1.4　定制unix构建\t12\n2.1.5　定制windows构建\t12\n2.1.6　常见错误\t13\n2.1.7　查看并下载文档\t13\n2.2　配置\t13\n2.2.1　管理php的配置指令\t14\n2.2.2　php的配置指令\t15\n2.3　小结\t29\n第3章 php基础\t30\n3.1　界定php代码\t30\n3.1.1　默认语法\t30\n3.1.2　短标记\t31\n3.1.3　脚本\t31\n3.1.4　asp风格\t32\n3.1.5　嵌入多个代码块\t32\n3.2　注释\t32\n3.2.1　单行c++语法\t32\n3.2.2　shell语法\t32\n3.2.3　多行c语法\t33\n3.3　输出\t33\n3.3.1　print()\t33\n3.3.2　echo()\t34\n3.3.3　printf()\t34\n3.3.4　sprintf()\t35\n3.4　数据类型\t35\n3.4.1　标量数据类型\t35\n3.4.2　复合数据类型\t37\n3.4.3　特殊数据类型\t38\n3.4.4　类型强制转换\t38\n3.4.5　类型自动转换\t39\n3.4.6　与类型有关的函数\t40\n3.4.7　类型标识符函数\t40\n3.5　标识符\t41\n3.6　变量\t41\n3.6.1　变量声明\t42\n3.6.2　变量作用域\t43\n3.6.3　php的超级全局变量\t45\n3.6.4　变量的变量\t48\n3.7　常量\t49\n3.8　表达式\t49\n3.8.1　操作数\t50\n3.8.2　操作符\t50\n3.9　字符串插入\t54\n3.9.1　双引号\t55\n3.9.2　单引号\t55\n3.9.3　heredoc\t56\n3.10　控制结构\t56\n3.10.1　执行控制语句\t57\n3.10.2　条件语句\t57\n3.10.3　循环语句\t59\n3.10.4　文件包含语句\t63\n3.10.5　require_once()\t65\n3.11　小结\t65\n第4章 函数\t66\n4.1　调用函数\t66\n4.2　创建函数\t66\n4.2.1　按值传递参数\t67\n4.2.2 按引用传递参数\t68\n4.2.3　默认参数值\t68\n4.2.4　可选参数\t68\n4.2.5　从函数返回值\t69\n4.2.6　嵌套函数\t70\n4.2.7　递归函数\t70\n4.2.8　变量函数\t72\n4.3　函数库\t73\n4.4　小结\t74\n第5章 数组\t75\n5.1　什么是数组\t75\n5.2　输出数组\t76\n5.3　创建数组\t77\n5.4　测试数组\t79\n5.5　增加和删除数组元素\t79\n5.6　定位数组元素\t81\n5.7　遍历数组\t82\n5.8　确定数组大小和唯一性\t85\n5.9　数组排序\t86\n5.10　合并、拆分、接合和分解数组\t91\n5.11　其他有用的数组函数\t95\n5.12　小结\t96\n第6章 面向对象的php\t97\n6.1　oop的好处\t97\n6.1.1　封装\t97\n6.1.2　继承\t98\n6.1.3　多态\t98\n6.2　关键的oop概念\t99\n6.2.1　类\t99\n6.2.2　对象\t99\n6.2.3　字段\t100\n6.2.4　属性\t102\n6.2.5　常量\t104\n6.2.6　方法\t105\n6.3　类型提示\t108\n6.4　构造函数和析构函数\t108\n6.4.1　构造函数\t108\n6.4.2　析构函数\t110\n6.5　静态类成员\t111\n6.6　instanceof关键字\t112\n6.7　辅助函数\t112\n6.8　自动加载对象\t114\n6.9　小结\t114\n第7章 高级oop特性\t115\n7.1　php不支持的高级oop特性\t115\n7.2　对象克隆\t116\n7.2.1　克隆示例\t116\n7.2.2　__clone()方法\t117\n7.3　继承\t118\n7.3.1　类继承\t118\n7.3.2　继承和构造函数\t120\n7.4　接口\t121\n7.4.1　实现一个接口\t122\n7.4.2　实现多个接口\t123\n7.5　抽象类\t124\n7.6　反射\t124\n7.6.1　编写reflectionclass类\t125\n7.6.2　编写reflectionmethod类\t127\n7.6.3　编写reflectionparameter类\t128\n7.6.4　编写reflectionproperty类\t129\n7.6.5　反射的其他用途\t130\n7.7　小结\t130\n第8章 错误和异常处理\t131\n8.1　配置指令\t131\n8.2　错误日志\t134\n8.3　异常处理\t135\n8.3.1　为什么异常处理很方便\t136\n8.3.2　php的异常处理实现\t137\n8.4　小结\t140\n第9章 字符串和正则表达式\t141\n9.1　复杂（大括号）偏移语法\t141\n9.2　正则表达式\t142\n9.2.1　正则表达式语法（posix）\t142\n9.2.2　php的正则表达式函数\n（posix扩展）\t144\n9.2.3　正则表达式语法（perl风格）\t146\n9.3　其他字符串函数\t151\n9.3.1　确定字符串长度\t152\n9.3.2　比较两个字符串\t152\n9.3.3　处理字符串大小写\t154\n9.3.4　字符串与html相互转换\t155\n9.3.5　正则表达式函数的替代函数\t159\n9.3.6　填充和剔除字符串\t164\n9.3.7　字符和单词计数\t165\n9.4　使用pear：validate_us\t167\n9.4.1　安装validate_us\t167\n9.4.2　使用validate_us\t168\n9.5　小结\t168\n第10章 处理文件和操作系统\t169\n10.1　了解文件和目录\t169\n10.1.1　解析目录路径\t169\n10.1.2　文件类型和链接\t171\n10.1.3　计算文件、目录和磁盘大小\t173\n10.1.4　访问和修改时间\t175\n10.2　文件所有权和权限\t176\n10.3　文件i/o\t178\n10.3.1　资源的概念\t178\n10.3.2　换行\t178\n10.3.3　文件末尾\t178\n10.3.4　打开和关闭文件\t179\n10.3.5　读取文件\t180\n10.3.6　移动文件指针\t184\n10.3.7　写入文件\t184\n10.3.8　读取目录内容\t185\n10.4　执行shell命令\t186\n10.5　系统级程序执行\t187\n10.5.1　清理输入\t187\n10.5.2　php的程序执行函数\t188\n10.6　小结\t190\n第11章 pear\t191\n11.1　流行的pear包\t191\n11.2　安装和更新pear\t193\n11.2.1　安装pear\t193\n11.2.2　pear和isp公司\t194\n11.2.3　更新pear\t194\n11.3　使用pear包管理器\t194\n11.3.1　查看安装的包\t195\n11.3.2　了解安装包的更多信息\t195\n11.3.3　安装pear包\t196\n11.3.4　使用pear包\t197\n11.3.5　升级pear包\t198\n11.3.6　卸载pear包\t198\n11.3.7　降级pear包\t199\n11.4　小结\t199\n第12章 日期和时间\t200\n12.1　unix时间戳\t200\n12.2　php的日期和时间库\t200\n12.3　日期函数\t206\n12.3.1　显示本地化的日期和时间\t206\n12.3.2　显示网页的最新修改日期\t209\n12.3.3　确定当前月份中的天数\t209\n12.3.4　计算当前日期后x天的日期\t209\n12.3.5　创建日历\t210\n12.4　php 5.1\t213\n12.4.1　date基础\t213\n12.4.2　date构造函数\t213\n12.4.3　访问方法和修改方法\t214\n12.4.4　验证函数\t216\n12.4.5　处理方法\t216\n12.5　小结\t222\n第13章 表单和导航提示\t223\n13.1 php和web表单\t223\n13.1.1 简单示例\t224\n13.1.2 向函数传递表单数据\t225\n13.1.3 处理多值表单组件\t226\n13.1.4 用php生成表单\t227\n13.1.5 自动选择表单数据\t228\n13.1.6 php、web表单和\njavascript\t229\n13.2 导航提示\t231\n13.2.1 用户友好的url\t231\n13.2.2 “面包屑型”轨迹\t233\n13.2.3 创建定制错误处理函数\t237\n13.3 小结\t238\n第14章 身份认证\t239\n14.1 http认证概念\t239\n14.2 php认证\t240\n14.2.1 认证变量\t240\n14.2.2 认证方法\t241\n14.3 用户登录管理\t248\n14.3.1 密码指派\t248\n14.3.2 使用cracklib库测试密码\n易猜性\t250\n14.3.3 一次性url和密码恢复\t251\n第15章 处理文件上传\t254\n15.1 通过http协议上传文件\t254\n15.2 通过php处理上传\t255\n15.2.1 php的文件上传/资源指令\t255\n15.2.2 $_files数组\t256\n15.2.3 php的文件上传函数\t256\n15.2.4 上传错误消息\t258\n15.2.5 文件上传示例\t258\n15.3 利用pear：http_upload\t261\n15.3.1 安装http_upload\t261\n15.3.2 了解关于上传文件的更多\n信息\t262\n15.3.3 将上传的文件移动到最终\n目标\t263\n15.3.4 上传多个文件\t263\n15.4 小结\t264\n第16章 网络\t265\n16.1 dns、服务器和服务\t265\n16.1.1 dns\t265\n16.1.2 服务\t268\n16.1.3\t建立套接字连接\t269\n16.2 邮件\t271\n16.2.1 配置指令\t271\n16.2.2 发送纯文本电子邮件\t272\n16.2.3 使用额外的信息首部发送\n电子邮件\t272\n16.2.4 将电子邮件发送给多个\n接收者\t273\n16.2.5 发送html格式的电子邮件\t273\n16.2.6 发送附件\t274\n16.3 imap、pop3和nntp\t275\n16.3.1 需求\t276\n16.3.2 建立和关闭连接\t276\n16.3.3 了解更多关于邮箱和邮件\n的信息\t277\n16.3.4 获取邮件\t280\n16.3.5 写邮件\t286\n16.3.6 发送邮件\t286\n16.3.7 邮箱管理\t287\n16.3.8 邮件管理\t288\n16.4 流\t288\n16.4.1 流包装器和上下文\t289\n16.4.2 流过滤器\t290\n16.5 常见网络任务\t291\n16.5.1 连接一台服务器\t291\n16.5.2 端口扫描器\t292\n16.5.3 子网转换器\t293\n16.5.4 测试用户带宽\t294\n16.6 小结\t295\n第17章 php和ldap\t296\n17.1 ldap介绍\t297\n17.2 在php中使用ldap\t297\n17.2.1 连接到ldap服务器\t297\n17.2.2 绑定到ldap服务器\t298\n17.2.3 关闭ldap服务器连接\t299\n17.2.4 获取ldap数据\t299\n17.2.5 处理项值\t301\n17.2.6 统计所获取的项\t302\n17.2.7 获取属性\t302\n17.2.8 排序和比较ldap项\t305\n17.2.9 处理项\t306\n17.2.10 回收内存\t308\n17.2.11 插入ldap数据\t309\n17.2.12 更新ldap数据\t309\n17.2.13 删除ldap数据\t310\n17.2.14 配置函数\t311\n17.2.15 字符编码\t312\n17.2.16 处理区分名\t312\n17.2.17 错误处理\t313\n17.3 小结\t314\n第18章 会话处理器\t315\n18.1 什么是会话处理\t315\n18.1.1 cookie\t315\n18.1.2 url重写\t316\n18.1.3 会话处理过程\t316\n18.2 配置指令\t317\n18.3 关键概念\t320\n18.3.1 开始会话\t320\n18.3.2 销毁会话\t321\n18.3.3 获取和设置会话id\t321\n18.3.4 创建和删除会话变量\t321\n18.3.5 编码和解码会话数据\t322\n18.4 实际的会话处理示例\t324\n18.4.1 自动登录\t324\n18.4.2 最近浏览的文档索引\t325\n18.5 创建定制会话处理器\t327\n18.5.1 将定制会话函数加入到php\n逻辑\t327\n18.5.2 基于mysql的定制会话\n处理器\t328\n18.6 小结\t330\n第19章 用smarty模板化\t331\n19.1 什么是模板化引擎\t331\n19.2 smarty介绍\t333\n19.3 安装smarty\t333\n19.4 使用smarty\t334\n19.5 smarty的表现逻辑\t336\n19.5.1 注释\t336\n19.5.2 变量修饰符\t336\n19.5.3 控制结构\t339\n19.5.4 语句\t342\n19.6 创建配置文件\t344\n19.6.1 config_load\t345\n19.6.2 引用配置变量\t345\n19.7 结合smarty使用css\t346\n19.8 缓存\t347\n19.8.1 处理缓存生命期\t347\n19.8.2 通过is_cached()消除处理\n开销\t348\n19.8.3 为每个模板创建多个缓存\t348\n19.8.4 关于缓存的结束语\t349\n19.9 小结\t350\n第20章 web服务\t351\n20.1 为什么使用web服务\t352\n20.2 真正简单聚合\t353\n20.2.1 rss语法\t355\n20.2.2 magpierss\t356\n20.3 simplexml\t361\n20.3.1 simplexml函数\t362\n20.3.2 simplexml方法\t363\n20.4 soap\t365\n20.4.1 nusoap\t366\n20.4.2 php 5的soap扩展\t374\n20.5 使用php web服务和c#客户\t381\n20.6 小结\t383\n第21章 安全php编程\t384\n21.1 安全地配置php\t384\n21.1.1 安全模式\t385\n21.1.2 其他与安全有关的配置参数\t386\n21.2 隐藏配置细节\t388\n21.3 隐藏敏感数据\t389\n21.3.1 注意文档根目录\t390\n21.3.2 拒绝访问某些文件扩展名\t390\n21.4 清理用户数据\t390\n21.4.1 文件删除\t390\n21.4.2 跨网站脚本\t391\n21.4.3 清理用户输入：解决方案\t392\n21.5 数据加密\t394\n21.5.1 php的加密函数\t394\n21.5.2 mhash\t395\n21.5.3 mcrypt\t396\n21.6 小结\t397\n第22章 sqlite\t398\n22.1 sqlite介绍\t398\n22.1.1 安装sqlite\t398\n22.1.2 使用sqlite命令行界面\t399\n22.2 php的sqlite库\t400\n22.2.1 sqlite指令\t400\n22.2.2 打开连接\t400\n22.2.3 在内存中创建表\t401\n22.2.4 关闭连接\t401\n22.2.5 查询数据库\t402\n22.2.6 解析结果集\t403\n22.2.7 获取结果集细节\t405\n22.2.8 操作结果集指针\t406\n22.2.9 了解表模式的更多信息\t408\n22.2.10 操作二进制数据\t408\n22.2.11 创建和覆盖sqlite函数\t409\n22.2.12 创建聚集函数\t410\n22.3 小结\t411\n第23章 pdo介绍\t412\n23.1 为什么还要另一种数据库抽象层\t413\n23.2 使用pdo\t413\n23.2.1 安装pdo\t414\n23.2.2 pdo的数据库支持\t414\n23.2.3 连接到数据库服务器并选择\n数据库\t415\n23.2.4 存取属性\t416\n23.2.5 错误处理\t417\n23.2.6 查询执行\t417\n23.2.7 准备语句\t418\n23.2.8 获取数据\t421\n23.2.9 设置绑定列\t423\n23.2.10 事务\t424\n23.3 小结\t425\n第24章 mysql介绍\t426\n24.1 mysql为什么如此流行\t426\n24.1.1 灵活性\t426\n24.1.2 强大功能\t427\n24.1.3 灵活的许可选择\t428\n24.1.4 超级活跃的用户群体\t429\n24.2 mysql 4\t429\n24.3 mysql 5\t430\n24.4 著名的mysql用户\t430\n24.4.1 craigslist\t430\n24.4.2 雅虎财经\t431\n24.4.3 维基百科\t431\n24.5 小结\t431\n第25章 安装和配置mysql\t432\n25.1 php和mysql许可问题\t432\n25.1.1 linux\t433\n25.1.2 windows\t433\n25.2 下载mysql\t433\n25.3 安装mysql\t434\n25.3.1 linux\t434\n25.3.2 windows\t437\n25.4 设置mysql管理员密码\t439\n25.5 启动和停止mysql\t439\n25.5.1 手工控制守护进程\t439\n25.5.2 自动启动和停止mysql\t441\n25.6 配置和优化mysql\t442\n25.6.1 mysqld_safe\t443\n25.6.2 配置和优化参数\t443\n25.6.3 my.cnf文件\t446\n25.7 小结\t448\n第26章 众多mysql客户端\t449\n26.1 标准客户端选项\t449\n26.2 连接选项\t450\n26.3 一般选项\t450\n26.4 mysql\t451\n26.4.1 关键mysql选项\t451\n26.4.2 以交互模式使用mysql\t452\n26.4.3 查看配置变量和系统状态\t454\n26.4.4 以批处理模式使用mysql\t455\n26.4.5 有用的mysql提示\t456\n26.5 mysqladmin\t458\n26.6 其他实用工具\t459\n26.6.1 mysqldump\t459\n26.6.2 mysqlshow\t459\n26.6.3 mysqlhotcopy\t460\n26.6.4 mysqlimport\t460\n26.6.5 myisamchk\t461\n26.6.6 mysqlcheck\t461\n26.7 第三方客户端程序\t462\n26.7.1 mysql管理器\t462\n26.7.2 phpmyadmin\t463\n26.7.3 mysql查询浏览器\t464\n26.7.4 navicat\t465\n26.8 小结\t466\n第27章 mysql存储引擎和数据类型\t467\n27.1 存储引擎\t467\n27.1.1 innodb\t468\n27.1.2 myisam\t468\n27.1.3 memory\t470\n27.1.4 merge\t471\n27.1.5 bdb\t471\n27.1.6 federated\t471\n27.1.7 archive\t472\n27.1.8 csv\t473\n27.1.9 example\t473\n27.1.10 blackhole\t473\n27.1.11 存储引擎faq\t473\n27.2 数据类型和属性\t475\n27.2.1 数据类型\t475\n27.2.2 数据类型属性\t479\n27.3 操作数据库和表\t481\n27.3.1 操作数据库\t481\n27.3.2 操作表\t483\n27.3.3 修改表结构\t485\n27.3.4 information_schema\t485\n27.4 小结\t487\n第28章 保护mysql的安全\t488\n28.1 首先应当做什么\t488\n28.2 保护mysqld守护进程\t489\n28.3 mysql访问权限系统\t489\n28.3.1 权限系统的工作方式\t490\n28.3.2 访问信息存储在哪里\t491\n28.4 用户和权限管理\t498\n28.4.1 create user\t498\n28.4.2 drop user\t499\n28.4.3 rename user\t499\n28.4.4 grant和revoke命令\t499\n28.4.5 查看权限\t503\n28.5 限制用户资源\t503\n28.6 保护mysql连接\t504\n28.6.1 授权选项\t504\n28.6.2 ssl选项\t505\n28.6.3 启动启用ssl的mysql\n服务器\t506\n28.6.4 使用启用ssl的客户端进行\n连接\t506\n28.6.5 在my.cnf文件中存储ssl\n选项\t506\n28.7 小结\t507\n第29章 php的mysql扩展\t508\n29.1 预备工作\t508\n29.1.1 在linux中启用mysql扩展\t508\n29.1.2 在windows中启用mysql\n扩展\t508\n29.1.3 用户权限\t509\n29.1.4 示例数据\t509\n29.2 php的mysql命令\t509\n29.2.1 建立和关闭连接\t509\n29.2.2 在单独的文件中存储连接\n信息\t511\n29.2.3 保护连接信息\t511\n29.3 选择数据库\t512\n29.4 查询mysql\t512\n29.5 获取和显示数据\t513\n29.6 插入数据\t516\n29.7 修改数据\t517\n29.8 删除数据\t519\n29.9 所选择的记录和受影响的记录\t520\n29.10 获取数据库和表的信息\t521\n29.11 获取字段信息\t523\n29.11.1 查看表属性\t526\n29.11.2 获取错误信息\t527\n29.12 辅助函数\t528\n29.13 小结\t530\n第30章 php的mysqli扩展\t531\n30.1 预备工作\t532\n30.1.1 在unix中启用mysqli\n扩展\t532\n30.1.2 在windows中启用mysqli\n扩展\t532\n30.1.3 示例数据\t532\n30.2 使用mysqli扩展\t532\n30.2.1 连接mysql服务器\t532\n30.2.2 连接错误报告\t533\n30.2.3 选择一个mysql数据库\t535\n30.2.4 关闭mysql连接\t536\n30.3 查询\t536\n30.3.1 查询执行\t536\n30.3.2 回收查询内存\t537\n30.3.3 准备结果集\t538\n30.3.4 解析结果\t539\n30.3.5 多个查询\t542\n30.3.6 准备语句\t543\n30.4 数据库事务\t548\n30.5 小结\t549\n第31章 存储例程\t550\n31.1 应当使用存储例程吗\t550\n31.1.1 存储例程的优点\t550\n31.1.2 存储例程的缺点\t551\n31.2 mysql如何实现存储例程\t551\n31.2.1 存储例程权限表\t551\n31.2.2 创建存储例程\t553\n31.2.3 声明和设置变量\t554\n31.2.4 执行存储例程\t555\n31.2.5 多语句存储例程\t556\n31.2.6 从另一个例程中调用例程\t562\n31.2.7 修改存储例程\t563\n31.2.8 删除存储例程\t563\n31.2.9 查看例程状态\t563\n31.2.10 查看例程的创建语法\t564\n31.2.11 条件和处理器\t564\n31.3 将例程集成到web应用程序\t565\n31.3.1 创建员工奖金界面\t565\n31.3.2 获取多条记录\t566\n31.4 小结\t566\n第32章 mysql触发器\t567\n32.1 介绍触发器\t567\n32.1.1 为什么使用触发器\t567\n32.1.2 在事件前采取行动\t568\n32.1.3 在事件后采取行动\t568\n32.1.4 前触发器和后触发器\t569\n32.2 mysql对触发器的支持\t569\n32.2.1 创建触发器\t570\n32.2.2 查看现有的触发器\t571\n32.2.3 修改触发器\t572\n32.2.4 删除触发器\t572\n32.2.5 级联触发器\t573\n32.3 将触发器集成到web应用程序\t574\n32.4 小结\t575\n第33章 视图\t576\n33.1 视图概述\t576\n33.2 mysql对视图的支持\t577\n33.2.1 创建和执行视图\t577\n33.2.2 查看视图信息\t581\n33.2.3 修改视图\t582\n33.2.4 删除视图\t583\n33.2.5 更新视图\t583\n33.3 将视图结合到web应用程序中\t583\n33.4 小结\t585\n第34章 实用数据库查询\t586\n34.1 示例数据\t586\n34.2 用pear创建表格输出\t587\n34.2.1 安装html_table\t587\n34.2.2 创建一个简单表\t587\n34.2.3 创建更可读的行输出\t589\n34.2.4 根据数据库数据创建表格\t589\n34.2.5 一般化输出过程\t591\n34.3 排序输出\t593\n34.4 创建分页输出\t594\n34.5 列出页码\t597\n34.6 子查询\t598\n34.6.1 用子查询完成比较\t599\n34.6.2 用子查询确定存在性\t599\n34.6.3 用子查询维护数据库\t600\n34.6.4 在php中使用子查询\t601\n34.7 游标\t601\n34.7.1 游标基础\t601\n34.7.2 创建游标\t602\n34.7.3 打开游标\t602\n34.7.4 使用游标\t602\n34.7.5 关闭游标\t603\n34.7.6 在php中使用游标\t604\n34.8 小结\t604\n第35章 索引和搜索\t605\n35.1 数据库索引\t605\n35.1.1 主键索引\t605\n35.1.2 唯一索引\t606\n35.1.3 常规索引\t607\n35.1.4 全文索引\t608\n35.1.5 索引最佳实践\t611\n35.2 基于表单的搜索\t611\n35.2.1 执行简单搜索\t612\n35.2.2 扩展搜索功能\t613\n35.2.3 执行全文搜索\t614\n35.3 小结\t615\n第36章 事务\t616\n36.1 什么是事务\t616\n36.2 mysql的事务功能\t616\n36.2.1 系统需求\t617\n36.2.2 表创建\t617\n36.2.3 innodb配置参数\t618\n36.3 示例项目\t619\n36.3.1 示例数据\t620\n36.3.2 执行示例事务\t620\n36.3.3 备份和恢复innodb表\t622\n36.3.4 用法提示\t622\n36.4 用php构建事务应用程序\t622\n36.5 小结\t624\n第37章 导入和导出数据\t625\n37.1 示例表\t625\n37.2 获得合适的媒介\t625\n37.3 导出数据\t626\n37.4 导入数据\t628\n37.4.1 利用load data infile导入\n数据\t628\n37.4.2 用mysqlimport导入\t631\n37.4.3 用php加载表数据\t633\n37.5 小结\t634\n索引",
      pages: "634",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s2160043.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s2160043.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s2160043.jpg"
      },
      alt: "https://book.douban.com/subject/1958938/",
      id: "1958938",
      publisher: "人民邮电出版社",
      isbn10: "7115155097",
      isbn13: "9787115155092",
      title: "PHP与MySQL 5程序设计",
      url: "https://api.douban.com/v2/book/1958938",
      alt_title: "Beginning PHP and MySQL 5, 2nd Ed.",
      author_intro:
        "W. Jason Gilmore，世界知名的PHP开发人员，曾开发了大量PHP和MySQL应用程序，并在各大专业媒体发表了众多脍炙人口的文章。目前，Jason在开发之余，还负责着Apress出版公司的开源图书出版项目。",
      summary:
        "本书是久负盛名的经典著作，以涵盖全面详实而著称，对主题的选取和组织从实用出\n发，在讲述知识之外还加入了作者自己的应用经验，并提供了密集的实战代码示例，充\n分体现了作者深厚的开发功力。书中对PHP的介绍是迄今为止最为全面的",
      series: {
        id: "660",
        title: "图灵程序设计丛书"
      },
      price: "79.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 23,
        average: "8.0",
        min: 0
      },
      subtitle:
        "官方论坛：http://219.232.118.52/wikilv/wikibbs/forumdisplay.php?f=7",
      author: ["谢弥青"],
      pubdate: "2006-10-01",
      tags: [
        {
          count: 15,
          name: "登山",
          title: "登山"
        },
        {
          count: 10,
          name: "旅行",
          title: "旅行"
        },
        {
          count: 5,
          name: "行走",
          title: "行走"
        },
        {
          count: 3,
          name: "西藏",
          title: "西藏"
        },
        {
          count: 2,
          name: "珠穆朗玛峰",
          title: "珠穆朗玛峰"
        },
        {
          count: 1,
          name: "雅鲁藏布江",
          title: "雅鲁藏布江"
        },
        {
          count: 1,
          name: "读书",
          title: "读书"
        },
        {
          count: 1,
          name: "自然",
          title: "自然"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s5792639.jpg",
      binding: "简裝本",
      translator: [],
      catalog: "",
      pages: "180",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s5792639.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s5792639.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s5792639.jpg"
      },
      alt: "https://book.douban.com/subject/1937497/",
      id: "1937497",
      publisher: "上海大学出版社",
      isbn10: "7810589954",
      isbn13: "9787810589956",
      title: "如果山知道",
      url: "https://api.douban.com/v2/book/1937497",
      alt_title: "",
      author_intro:
        "谢弥青，出生在上海，生长于武汉。骨子里天生浸染了海派文化情结，又难免携带着知名“火炉”热辣辣的梦想。1986年随家人迁往北京．很快就爱上了这个城市的率真、乐观和果敢，以至于现在身上仅存的南派特征就剩下口味上的倾斜了。\n1990年毕业于北京师范大学，阴差阳错地到了中国登山协会麾下正在筹备创刊的中国第一本《探险&户外》杂志，成为创始“小编”。后因为执着地坚持和投入，历任副主编、主编。\n笔耕不勤，但因岗位和经历的关系，曾为《北京晚报》、《辽宁青年》开辟专栏。作品曾被《读者》转载，收进北京广播学院播音教材。\n在从来没有想过这会是自己的终身职业的时候，不自觉地爱上了这个边缘的世界：当再没想过自己会选择离开这个职业的时候，命运的乐章里却标注了重重的休止符。\n2005年，告别曾经挚爱着的山和人，选择了另外一个全新的领域。因为相信，该留存的从来就不曾失去．该放弃的就勇敢地放弃。\n现任中国网球协会新闻发言人\n与作者沟通请登录本书官方论坛：http://219.232.118.52/wikilv/wikibbs/forumdisplay.php?f=7",
      summary:
        "山是一个传奇，因此人与山相逢更容易缔造奇迹。本书作者作为一名对登山运动怀着极大的热情的人，以她自己的视角和感悟记录了登山途中的一些人生感悟。这其中有她对山的感悟、对人性的剖析、对人与山相逢的诠释以及在完成上述过程的同时对生命的再认识，对人生的再塑造。 \n　　这是一个女孩“读”着山成长为一个女人的过程，这其中有她对山的感悟、对人性的剖析、对人与山相逢的诠释以及在完成上述过程的同时对生命的再认识，对人生的再塑造。尽管书中没有回避高山探险这项运动因为与死亡相邻而蕴含的悲壮和英雄主义色彩，但更揭示了这项运动最本质的内涵— —它能带给你最纯粹的快乐。因为许多登山者都相信，这个距离天堂很近的地方也最接近生命的本质，能与充满灵性的山峰交流，是一次心灵的洗礼，人就是在体验死亡的同时体验着生命，在与山、与自然的较量中享受到生命与生命的相融后的和谐与快乐。",
      price: "48.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 186,
        average: "8.6",
        min: 0
      },
      subtitle: "面向对象、模式与实践（第2版）",
      author: ["Matt Zandstra"],
      pubdate: "2010-05-01",
      tags: [
        {
          count: 287,
          name: "php",
          title: "php"
        },
        {
          count: 131,
          name: "面向对象",
          title: "面向对象"
        },
        {
          count: 101,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 99,
          name: "设计模式",
          title: "设计模式"
        },
        {
          count: 94,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 60,
          name: "编程",
          title: "编程"
        },
        {
          count: 47,
          name: "模式",
          title: "模式"
        },
        {
          count: 38,
          name: "计算机",
          title: "计算机"
        }
      ],
      origin_title: "PHP Objects, Patterns and Practice",
      image: "https://img3.doubanio.com/view/subject/m/public/s4261122.jpg",
      binding: "平装",
      translator: ["陈浩", "吴孙滨", "胡丹"],
      catalog:
        "第一部分 介绍\n第1章 PHP：设计与管理 2\n1.1 问题 2\n1.2 PHP和其他语言 3\n1.3 关于本书 5\n1.3.1 对象 5\n1.3.2 模式 5\n1.3.3 实践 6\n1.3.4 本书第2版中的新内容 7\n1.4 小结 7\n第二部分 对象\n第2章 PHP与对象 10\n2.1 PHP对象的偶然成功 10\n2.1.1 最初：PHP/FI 10\n2.1.2 语法糖：PHP 3 10\n2.1.3 一场静悄悄的革命：PHP 4 11\n2.1.4 拥抱改变：PHP 5 12\n2.2 走向未来：PHP 6 12\n2.3 拥护和疑虑：关于对象的争辩 13\n2.4 小结 13\n第3章 对象基础 14\n3.1 类和对象 14\n3.1.1 编写第一个类 14\n3.1.2 第一个对象（或两个） 15\n3.2 设置类中的属性 15\n3.3 使用方法 18\n3.4 参数和类型 20\n3.4.1 基本类型 20\n3.4.2 获得提示：对象类型 23\n3.5 继承 24\n3.5.1 继承问题 24\n3.5.2 使用继承 28\n3.5.3 public、private、protected：管理类的访问 32\n3.6 小结 35\n第4章 高级特性 36\n4.1 静态方法和属性 36\n4.2 常量属性 39\n4.3 抽象类 39\n4.4 接口 41\n4.5 错误处理 43\n4.6 Final类和方法 48\n4.7 使用拦截器 49\n4.8 析构方法 53\n4.9 使用__clone()复制对象 54\n4.10 定义对象的字符串值 56\n4.11 小结 57\n第5章 对象工具 58\n5.1 PHP和包 58\n5.1.1 PHP和命名空间 60\n5.1.2 包含路径 62\n5.1.3 自动加载 63\n5.2 类函数和对象函数 64\n5.2.1 查找类 64\n5.2.2 了解对象或类 65\n5.2.3 了解类中的方法 66\n5.2.4 了解类属性 67\n5.2.5 了解继承 67\n5.2.6 方法调用 68\n5.3 反射API 69\n5.3.1 入门 69\n5.3.2 开始行动 69\n5.3.3 检查类 71\n5.3.4 检查方法 72\n5.3.5 检查方法参数 74\n5.3.6 使用反射API 75\n5.4 小结 78\n第6章 对象与设计 79\n6.1 代码设计的定义 79\n6.2 面向对象设计和过程式编程 80\n6.2.1 职责 83\n6.2.2 内聚 83\n6.2.3 耦合 83\n6.2.4 正交 84\n6.3 选择类 84\n6.4 多态 85\n6.5 封装 86\n6.6 忘记细节 87\n6.7 四个方向标 88\n6.7.1 代码重复 88\n6.7.2 类知道的太多 88\n6.7.3 万能的类 88\n6.7.4 条件语句 89\n6.8 UML 89\n6.8.1 类图 89\n6.8.2 时序图 94\n6.9 小结 95\n第三部分 模式\n第7章 什么是设计模式？为何使用它们 98\n7.1 什么是设计模式 98\n7.2 设计模式概览 100\n7.2.1 命名 100\n7.2.2 问题 100\n7.2.3 解决方案 101\n7.2.4 效果 101\n7.3 《设计模式》格式 101\n7.4 为什么使用设计模式 102\n7.4.1 一个设计模式定义了一个问题 102\n7.4.2 一个设计模式定义了一个解决方案 102\n7.4.3 设计模式是语言无关的 102\n7.4.4 模式定义了一组词汇 102\n7.4.5 模式是经过测试的 103\n7.4.6 模式是为协作而设计的 103\n7.4.7 设计模式促进良好设计 103\n7.5 PHP与设计模式 103\n7.6 小结 104\n第8章 模式原则 105\n8.1 模式的启示 105\n8.2 组合与继承 106\n8.2.1 问题 106\n8.2.2 使用组合 108\n8.3 解耦 110\n8.3.1 问题 110\n8.3.2 降低耦合 111\n8.4 针对接口编程，而不是针对实现编程 112\n8.5 变化的概念 113\n8.6 父子关系 113\n8.7 模式 114\n8.7.1 用于生成对象的模式 114\n8.7.2 用于组织对象和类的模式 114\n8.7.3 面向任务的模式 114\n8.7.4 企业模式 114\n8.7.5 数据库模式 114\n8.8 小结 115\n第9章 生成对象 116\n9.1 生成对象的问题和解决方法 116\n9.2 单例模式 119\n9.2.1 问题 120\n9.2.2 实现 120\n9.2.3 结果 122\n9.3 工厂方法模式 122\n9.3.1 问题 122\n9.3.2 实现 125\n9.3.3 结果 126\n9.4 抽象工厂模式 127\n9.4.1 问题 127\n9.4.2 实现 128\n9.4.3 结果 129\n9.4.4 原型模式 131\n9.4.5 问题 132\n9.4.6 实现 133\n9.5 某些模式的骗术 134\n9.6 小结 136\n第10章 让面向对象编程更加灵活的模式 137\n10.1 构造可灵活创建对象的类 137\n10.2 组合模式 137\n10.2.1 问题 138\n10.2.2 实现 139\n10.2.3 效果 143\n10.2.4 组合模式小结 146\n10.3 装饰模式 146\n10.3.1 问题 146\n10.3.2 实现 148\n10.3.3 效果 151\n10.4 外观模式 151\n10.4.1 问题 152\n10.4.2 实现 153\n10.4.3 效果 153\n10.5 小结 154\n第11章 执行及描述任务 155\n11.1 解释器模式 155\n11.1.1 问题 155\n11.1.2 实现 156\n11.1.3 解释器的问题 162\n11.2 策略模式 163\n11.2.1 问题 163\n11.2.2 实现 164\n11.3 观察者模式 167\n11.4 访问者模式 173\n11.4.1 问题 174\n11.4.2 实现 175\n11.4.3 访问者模式的问题 178\n11.5 命令模式 179\n11.5.1 问题 179\n11.5.2 实现 179\n11.6 小结 183\n第12章 企业模式 184\n12.1 架构概述 184\n12.1.1 模式 184\n12.1.2 应用程序和层 185\n12.2 企业架构之外的基础模式 187\n12.2.1 注册表 187\n12.2.2 实现 188\n12.3 表现层 196\n12.3.1 前端控制器 196\n12.3.2 应用控制器 205\n12.3.3 页面控制器 214\n12.3.4 模板视图和视图助手 218\n12.4 业务逻辑层 220\n12.4.1 事务脚本 221\n12.4.2 领域模型 225\n12.5 小结 227\n第13章 数据库模式 228\n13.1 数据层 228\n13.2 数据映射器 228\n13.2.1 问题 229\n13.2.2 实现 229\n13.2.3 效果 239\n13.3 标识映射 239\n13.3.1 问题 240\n13.3.2 实现 240\n13.3.3 效果 242\n13.4 工作单元 243\n13.4.1 问题 243\n13.4.2 实现 243\n13.4.3 效果 246\n13.4.4 延迟加载 247\n13.4.5 问题 247\n13.4.6 实现 247\n13.4.7 效果 249\n13.5 领域对象工厂 249\n13.5.1 问题 249\n13.5.2 实现 249\n13.5.3 效果 250\n13.6 标识对象 252\n13.6.1 问题 252\n13.6.2 实现 252\n13.6.3 效果 256\n13.7 选择工厂和更新工厂模式 257\n13.7.1 问题 257\n13.7.2 实现 257\n13.7.3 效果 259\n13.8 数据映射器中剩下些什么 260\n13.9 小结 262\n第四部分 实践\n第14章 良好和糟糕的实践 264\n14.1 超越代码 264\n14.2 借一个轮子 264\n14.3 合作愉快 266\n14.4 为你的代码插上双翼 267\n14.5 文档 267\n14.6 测试 268\n14.7 小结 269\n第15章 PEAR 270\n15.1 什么是PEAR 270\n15.2 安装PEAR包 271\n15.3 使用PEAR包 273\n15.4 创建自己的PEAR包 278\n15.4.1 package.xml 278\n15.4.2 package.xml的组成元素 278\n15.4.3 contents元素 279\n15.4.4 依赖 282\n15.4.5 使用phprelease进行灵活的自定义安装 283\n15.4.6 发布包 284\n15.4.7 创建自己的PEAR频道 284\n15.5 小结 288\n第16章 用phpDocumentor生成文档 289\n16.1 为什么要使用文档 289\n16.2 安装 290\n16.3 生成文档 290\n16.4 DocBlock注释 292\n16.5 类的文档 293\n16.6 文件的文档 294\n16.7 属性的文档 295\n16.8 方法的文档 296\n16.9 在文档中创建链接 297\n16.10 小结 300\n第17章 使用CVS进行版本控制 301\n17.1 为什么要使用版本控制 301\n17.2 获得CVS 302\n17.3 配置CVS代码库 303\n17.3.1 创建代码库 303\n17.3.2 配置客户端 304\n17.3.3 在多台机器上运行CVS 304\n17.4 开始项目 305\n17.5 更新和提交 307\n17.6 增加和删除文件及目录 309\n17.6.1 添加文件 309\n17.6.2 删除文件 310\n17.6.3 添加目录 310\n17.6.4 添加二进制文件 311\n17.6.5 删除目录 311\n17.7 标记和导出项目 312\n17.7.1 标记项目 313\n17.7.2 通过标签获取项目代码 313\n17.7.3 导出项目 314\n17.8 创建项目分支 314\n17.9 小结 317\n第18章 使用PHPUnit进行测试 318\n18.1 功能测试与单元测试 318\n18.2 手工测试 319\n18.3 引入PHPUnit 321\n18.3.1 创建测试用例 321\n18.3.2 断言方法 322\n18.3.3 测试异常 323\n18.3.4 运行测试套件 324\n18.3.5 约束 326\n18.3.6 模拟与桩 328\n18.3.7 失败是成功之母 331\n18.4 警告 333\n18.5 小结 335\n第19章 用Phing实现项目的自动 构建 336\n19.1 什么是Phing 336\n19.2 获取和安装Phing 337\n19.3 编写build文档 337\n19.3.1 目标 339\n19.3.2 属性 340\n19.3.3 类型 345\n19.3.4 任务 348\n19.4 小结 352\n第五部分 结论\n第20章 对象、模式与实践 354\n20.1 对象 354\n20.1.1 选择 355\n20.1.2 封装和委托 355\n20.1.3 解耦 355\n20.1.4 复用性 356\n20.1.5 美学 356\n20.2 模式 356\n20.2.1 模式给我们带来了什么 357\n20.2.2 模式和设计原则 357\n20.3 实践 359\n20.3.1 测试 359\n20.3.2 文档 359\n20.3.3 版本控制 360\n20.3.4 自动构建 360\n20.3.5 我们还遗漏了什么 360\n20.4 小结 361\n第六部分 附录\n附录A 参考文献 364\n附录B 简单的解析器 366",
      pages: "383 页",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4261122.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4261122.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4261122.jpg"
      },
      alt: "https://book.douban.com/subject/4746407/",
      id: "4746407",
      publisher: "人民邮电出版社",
      isbn10: "7115225788",
      isbn13: "9787115225788",
      title: "深入PHP",
      url: "https://api.douban.com/v2/book/4746407",
      alt_title: "PHP Objects, Patterns and Practice",
      author_intro:
        "Matt Zandstra  Yahoo公司的高级程序员，曾从事过教师等工作，著有Sams Teach Yourself PHP in 24 Hours等书，还为Linux Magazine、IBM DeveloperWorks、Zend.com和bdz-consult.com写过PHP方面的文章。",
      summary:
        "本书全面深入地剖析了面向对象的PHP编程与设计。首先介绍了PHP的OO特性，包括类声明、对象实例化、继承、方法与属性封装以及静态方法与属性、抽象类、接口、异常处理、对象克隆等高级主题。然后介绍了设计模式，阐述了模式的概念，展示了如何在PHP中实现几个关键的模式，用专门的章节介绍了企业模式和数据库模式。本书最后一部分围绕PHP应用程序开发，详细介绍了一批极为实用的辅助开发工具，讨论了具有普遍意义的最佳开发实践。\n本书适合每位PHP程序员进阶参考，帮助他们掌握PHP面向对象设计和开发的精髓，跻身高端PHP程序员之列。",
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 166,
        average: "8.5",
        min: 0
      },
      subtitle: "",
      author: ["Lynn Beighley", "Michael Morrison"],
      pubdate: "2010-06-01",
      tags: [
        {
          count: 245,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 134,
          name: "Mysql",
          title: "Mysql"
        },
        {
          count: 108,
          name: "HeadFirst",
          title: "HeadFirst"
        },
        {
          count: 60,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 49,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 47,
          name: "编程",
          title: "编程"
        },
        {
          count: 33,
          name: "O'REILLY",
          title: "O'REILLY"
        },
        {
          count: 21,
          name: "互联网",
          title: "互联网"
        }
      ],
      origin_title: "Head First PHP & MySQL",
      image: "https://img3.doubanio.com/view/subject/m/public/s6301934.jpg",
      binding: "",
      translator: ["苏金国", "徐阳"],
      catalog:
        "引子\n1 充满生机：静态页面赋予生命\n2 如何连接在一起：连接 mysql\n3 创建你自己的数据：创建与填充数据库\n4 你的web应用：现实的实际应用\n5 如果数据库还不够：使用存储在文件中的数据\n6 假想他们都在搜寻你：保证应用安全\n7 还记得我吗？构建个性化web应用\n7 分享就是关爱：消除重复代码\n8 收获数据：控制你的数据，世界在你手中\n9 通过函数改善生活：串与定制函数\n10 替换规则：正则表达式\n11 绘制动态图像：数据可视化……以及更多!\n12 与世界连接：合成与web服务\ni （我们没有谈到的）十大主题：其他\nii 搭建舞台：建立开发环境\niii 还可以更多：扩展php",
      pages: "774",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6301934.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6301934.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6301934.jpg"
      },
      alt: "https://book.douban.com/subject/6011680/",
      id: "6011680",
      publisher: "中国电力",
      isbn10: "7512305133",
      isbn13: "9787512305137",
      title: "Head First PHP & MySQL（中文版）",
      url: "https://api.douban.com/v2/book/6011680",
      alt_title: "Head First PHP & MySQL",
      author_intro:
        "Michael Morrison与电脑世界结下不解之缘的开端，就是他的第一台个人电脑TI-99/4A，配件包括至高无上的人体工程学键盘、黑白TV“显示器”，还有那甜美的卡式带存储系统。往后的岁月里，他又曾拥有过其他电脑“玩具”，不过仍然时时怀念着当年在TI上把玩Parsec、在后院玩Nerf足球的日子。\n\n    现在的Michael已经长大成人，兴趣也变得比较成熟一点，例如建立交互网络应用程序……还有滑板。割伤、擦伤，大伤小伤不断，他面对技术挑战的方式其实与挑战极限运动时一样有勇无谋。在开发过几款电视游戏、发明过几种玩具、写了快50本书、建立许多在线课程后，Michael终于觉得可以面对《深入浅出Javascript》的挑战……他以后再也不相信自己的感觉了。\n\n    事实上，面对“深入浅出”系列的写作时，不可能有准备好的那一天。选择墨菲斯手中的红色药丸，进入Head First黑客帝国(Matrix)的世界，已经是最佳准备途径了。当Michael从另一个世界中醒来后，身上也还残留着智力较量下的淤青，他看待学习(与教学)的眼光完全不一样了。这是多么令人兴奋的一件事啊！现在这个时候，他大概正与老婆一起在鲤鱼池边，反思着交互性万维网的神妙之处。\n    Lynn Beighley is a fiction writer stuck in a technical book writer's body. Upon discovering that technical book writing actually paid real money, she learned to accept and enjoy it. After going back to school to get a Masters in Computer Science, she worked for the acronyms NRL and LANL. Then she discovered Flash, and wrote her first bestseller. A victim of bad timing, she moved to Silicon Valley just before the great crash. She spent several years working for Yahoo! and writing other books and training courses. Finally giving in to her creative writing bent, she moved to the New York area to get an MFA in Creative Writing. Her Head First-style thesis was delivered to a packed room of professors and fellow students. It was extremely well received, and she finished her degree, finished Head First SQL, and just finished Head First PHP & MySQL. Whew!\n\n    Lynn loves traveling, writing, and making up elaborate background stories about complete strangers. She's a little scared of UFOs.",
      summary:
        "通过《深入浅出PHP&MySQL(影印版)》，你将学习：准备好把你的静态HTML网页提升到下一个层次并使用PHP和MySQL建立数据库驱动的网站了吗？《深入浅出PHP& MysQL》是一本快捷实用的指南，让你的动态网站快速运行。自己动手建立实际应用程序，从视频游戏高分留言板到在线交友网站。当你完成后，你将可以进行验证表单、使用会话ID和cookies工作、执行数据库查询和联接、处理文件I／0操作等等。\n《深入浅出PHP&MySQL(影印版)》的特别之处在于：我们认为你的时间如此宝贵以至于不应该花费在为新概念伤脑筋上面。《深入浅出PHP ＆ MySQL》用最新的认知科学和学习理论打造多感官的学习体验，运用适合大脑工作方式的直观的格式编排，而不是令人昏昏欲睡的密密麻麻的文字。",
      series: {
        id: "10044",
        title: "O'Reilly深入浅出系列"
      },
      price: "98.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 167,
        average: "7.7",
        min: 0
      },
      subtitle: "",
      author: ["勒道夫"],
      pubdate: "2009-03-01",
      tags: [
        {
          count: 234,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 53,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 50,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 40,
          name: "编程",
          title: "编程"
        },
        {
          count: 23,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 22,
          name: "web",
          title: "web"
        },
        {
          count: 18,
          name: "IT",
          title: "IT"
        },
        {
          count: 17,
          name: "programming",
          title: "programming"
        }
      ],
      origin_title: "Programming PHP, 2nd Ed",
      image: "https://img1.doubanio.com/view/subject/m/public/s2393468.jpg",
      binding: "平装",
      translator: ["陈浩", "胡丹", "徐景"],
      catalog:
        "序言 I\n前言 III\n第1章 PHP简介 1\nPHP能做什么 1\nPHP发展简史 2\n安装PHP 7\nPHP纵览 9\n第2章 语言基础 18\n词法结构 18\n数据类型 25\n变量 32\n表达式和操作符 36\n流控制语句 49\n包含代码 57\n在Web页面中嵌入PHP 59\n第3章 函数 63\n函数调用 63\n定义函数 64\n变量作用域 66\n函数参数 68\n返回值 71\n可变函数 72\n匿名函数 73\n第4章 字符串 74\n引用字符串常量 74\n输出字符串 78\n访问单个字符 82\n整理字符串 82\n编码和转义 83\n比较字符串 89\n处理和查找字符串 91\n正则表达式 97\n风格正则表达式 101\nPerl兼容正则表达式 106\n第5章 数组 119\n索引数组和关联数组 119\n识别数组元素 120\n在数组中存储数据 120\n多维数组 123\n析取多个值 123\n在数组和变量间转换 127\n遍历数组 128\n排序 133\n作用于整个数组 138\n使用数组 140\n第6章 对象 143\n术语 144\n创建一个对象 144\n访问对象属性和方法 145\n声明一个类 146\n自省 153\n串行化 159\n第7章 Web技术 164\nHTTP基础 164\n变量 165\n服务器信息 166\n表单处理 168\n设置响应头 182\n维持状态 185\nSSL 195\n第8章 数据库 196\n使用PHP访问数据库 196\n关系型数据库和SQL 198\nPEAR DB基础 199\n高级数据库技术 205\n示例程序 211\n第9章 图形 225\n在页面中嵌入图像 225\nGD扩展 226\n图像基本概念 227\n创建和绘制图像 228\n带文字的图像 232\n动态创建按钮 236\n缩放图像 239\n颜色处理 240\n第10章 PDF 246\nPDF扩展 246\n文档和页面 246\n文字 248\n第11章 XML 261\n入门指南 261\n生成XML 263\n解析XML 264\n用DOM解析XML 277\n使用SimpleXML解析XML 277\n使用XSLT转换XML 278\nWeb Services 280\n第12章 安全 285\n输入过滤 285\n转义输出 290\n跨站脚本攻击 293\nSession仿造 294\n文件上传 295\n文件访问权限 296\nPHP代码 299\nShell命令 300\n更多信息 301\n安全要点总结 301\n第13章 应用技术 302\n代码库 302\n模板系统 303\n输出处理 306\n错误处理 308\n性能调节 313\n第14章 扩展PHP 321\n架构概览 321\n编写扩展需要些什么 322\n创建你的第一个扩展 323\nconfig.m4文件 333\n内存管理 336\npval/zval数据类型 338\n参数处理 342\n返回值 345\n引用 349\n全局变量 350\n创建变量 353\n扩展的INI项 354\n资源 356\n下一步/后述 358\n第15章 Windows上的PHP 359\n在Windows下安装和配置PHP 359\n编写Windows和UNIX平台上可移植代码 363\n与COM交互 366\n数据源交互 372\n附录A 函数参考 377\n附录B PHP扩展概览 491\n索引 503",
      pages: "521",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s2393468.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s2393468.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s2393468.jpg"
      },
      alt: "https://book.douban.com/subject/2071057/",
      id: "2071057",
      publisher: "电子工业出版社",
      isbn10: "7121038706",
      isbn13: "9787121038709",
      title: "PHP程序设计",
      url: "https://api.douban.com/v2/book/2071057",
      alt_title: "Programming PHP, 2nd Ed",
      author_intro:
        "Rasmus Lerdorf\nRasmus Lerdorf于1995年启动了PHP项目，并从那以后一直为PHP的发展而努力。Rasmus是Apache的长期贡献者，也是Apache基金会的成员，他曾参与了PHP之外的很多其他的开源项目。Rasmus是PHP Pocket Reference第一版的作者和Programming PHP第一版的作者之一，这两本书都由O'Reilly公司出版。\nRasmus Lerdorf于1968年生于格陵兰岛西部迪科斯岛上的Godhavn/Qeqertarsuaq。他从1985年开始涉足Unix解决方案。Rasmus主要以其1995年开始负责的PHP项目而闻名，另外他还由于在mSQL 1.x中使用ANSI-92 SQL不接受的LIMIT子句而备受指责，而现在该子句至少在概念上已经被MySQL和PostgreSQL所接受。\nRasmus试图拒绝程序员的称呼，而宁愿被视为一位擅长解决问题的技术专家。如果解决问题需要一点编码，他绝不会让其他人代劳，而喜欢自行解决。Rasmus目前和他的妻子Christine居住在旧金山附近。\nKevin Tatroe\nKevin Tatroe已经做了十年Macintosh和Unix程序员，他也是一个经验丰富的PHP程序员，对于PHP5中的新变化非常熟悉。他也是Programming PHP第一版的作者之一。\nKevin Tatroe曾经做了十年的Macintosh和Unix程序员。也许是由于懒散的缘故吧，他被可自动完成很多工作的语言和框架吸引了，如AppleScript、Perl和PHP语言，还有WebObjects和Cocoa编程环境。\n目前，Kevin和他的妻子Jenn、儿子Hadden，还有他们的两只猫住在科罗拉多州的乡村大平原边缘，那里离大山很远，不必担心糟糕的降雪，也不用担心龙卷风。他们的房子里到处都是LEGO拼装玩具、运动图片和众多其他玩具。\nPeter MacIntyre\nPeter MacIntyre生活和工作在夏洛特顿(加拿大爱德华王子岛的首府)，他有十六年的IT业工作经验，主要领域为软件开发。Peter拥有的技术技能包括多种客户端/服务端工具和关系型数据库，如PHP、PowerBuilder、Visual Basic、Active Server Pages和CA-Visual Objects。他获得了Zend公司的PHP4认证，并参与了多本书籍的写作：Using Visual Objects(Que公司出版)、Using PowerBuilder 5（Que公司出版）、ASP.NET Bible（Wiley出版）和Web Warrior Survey on Web Development Languages（Course Technology公司出版）。Peter同时也是PHP杂志php|architect (http://www.phparch.com)的编辑和作者（包括在线版和纸版杂志）。他也常在各种计算机会议上作报告，包括在新奥尔良召开的CA-World、德国科隆召开的CA-TechniCon和澳大利亚墨尔本召开的CA-Expo。",
      summary:
        "《PHP程序设计(第2版)》是最新版本PHP 5的权威指南，其中包含创建者PHP的创建者 Rasmus Lerdorf的独到的见解。《PHP程序设计(第2版)》以一种清晰而简练的风格介绍了PHP语言的语法和程序设计技术，并通过大量的示例演示了它们的正确使用方法和习惯用法。《PHP程序设计(第2版)》还给出了设计风格提示和实际的程序设计建议，这些将帮助你不仅成为一个PHP程序员，而且将是出色的PHP程序员。",
      series: {
        id: "697",
        title: "O'reilly系列"
      },
      price: "80.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 135,
        average: "7.4",
        min: 0
      },
      subtitle: "模式、框架与测试",
      author: ["Kevin McArthur"],
      pubdate: "2009.7",
      tags: [
        {
          count: 143,
          name: "php",
          title: "php"
        },
        {
          count: 61,
          name: "设计模式",
          title: "设计模式"
        },
        {
          count: 45,
          name: "框架",
          title: "框架"
        },
        {
          count: 41,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 39,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 37,
          name: "编程",
          title: "编程"
        },
        {
          count: 18,
          name: "web",
          title: "web"
        },
        {
          count: 12,
          name: "模式",
          title: "模式"
        }
      ],
      origin_title: "Pro PHP: Patterns, Frameworks, Testing and More",
      image: "https://img1.doubanio.com/view/subject/m/public/s3811388.jpg",
      binding: "",
      translator: ["汪泳　等"],
      catalog: "",
      pages: "300",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s3811388.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s3811388.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s3811388.jpg"
      },
      alt: "https://book.douban.com/subject/3765462/",
      id: "3765462",
      publisher: "人民邮电出版社出版",
      isbn10: "7115193177",
      isbn13: "9787115193179",
      title: "PHP高级程序设计",
      url: "https://api.douban.com/v2/book/3765462",
      alt_title: "Pro PHP: Patterns, Frameworks, Testing and More",
      author_intro:
        "Kevin McArthur 世界知名的PHP专家。他是基于Zend Framework的开源项目的核心开发人员，并因此获得了世界性的声誉。此外，他还是规模最大的PHP支持组织之一PHP EFnet的管理员。",
      summary:
        "今天，PHP已经是无可争议的Web开发主流语言。PHP 5以后，它的面向对象特性也足以与Java和C#相抗衡。然而，讲述PHP高级特性的资料一直缺乏，大大影响了PHP语言的深入应用。\n本书填补了这一空白。它专门针对有一定经验的PHP程序员，详细讲解了对他们最为重要的主题：高级面向对象、设计模式、文档、测试和标准PHP库等内容。同时，为适应目前Web开发的新趋势，作者还全面探讨了MVC架构和Zend Framework，以及Ajax、JSON、SOAP等Web 2.0技术。书中穿插的大量软件开发实战经验和对PHP编程思想的感悟，将大大提升你的内在功力。",
      series: {
        id: "28503",
        title: "图灵程序设计丛书·Web开发系列"
      },
      price: "45.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 21,
        average: "7.7",
        min: 0
      },
      subtitle:
        "Improve your PHP coding productivity with the free compact open-source MVC CodeIgniter framework!",
      author: ["David Upton"],
      pubdate: "2007-7-23",
      tags: [
        {
          count: 18,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 11,
          name: "CodeIgniter",
          title: "CodeIgniter"
        },
        {
          count: 4,
          name: "技术",
          title: "技术"
        },
        {
          count: 3,
          name: "编程",
          title: "编程"
        },
        {
          count: 2,
          name: "入门",
          title: "入门"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "英文版",
          title: "英文版"
        },
        {
          count: 1,
          name: "for",
          title: "for"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s9105154.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "220",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s9105154.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s9105154.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s9105154.jpg"
      },
      alt: "https://book.douban.com/subject/3065901/",
      id: "3065901",
      publisher: "Packt Publishing",
      isbn10: "1847191746",
      isbn13: "9781847191748",
      title: "CodeIgniter for Rapid PHP Application Development",
      url: "https://api.douban.com/v2/book/3065901",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 34.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 21,
        average: "8.0",
        min: 0
      },
      subtitle: "Solutions and Examples for PHP Programmers",
      author: ["Adam Trachtenberg", "David Sklar"],
      pubdate: "2006-08-01",
      tags: [
        {
          count: 25,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 11,
          name: "Cookbook",
          title: "Cookbook"
        },
        {
          count: 7,
          name: "web",
          title: "web"
        },
        {
          count: 5,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 3,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 3,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 2,
          name: "计算机科学",
          title: "计算机科学"
        },
        {
          count: 2,
          name: "mysql",
          title: "mysql"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4264873.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "812",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4264873.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4264873.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4264873.jpg"
      },
      alt: "https://book.douban.com/subject/1865376/",
      id: "1865376",
      publisher: "O'Reilly Media",
      isbn10: "0596101015",
      isbn13: "9780596101015",
      title: "PHP Cookbook",
      url: "https://api.douban.com/v2/book/1865376",
      alt_title: "",
      author_intro: "",
      summary:
        "When it comes to creating dynamic web sites, the open source PHP language is red-hot property: used on more than 20 million web sites today, PHP is now more popular than Microsoft's ASP.NET technology. With our Cookbook's unique format, you can learn how to build dynamic web applications that work on any web browser. This revised new edition makes it easy to find specific solutions for programming challenges. PHP Cookbook has a wealth of solutions for problems that you'll face regularly. With topics that range from beginner questions to advanced web programming techniques, this guide contains practical examples -- or \"recipes\" -- for anyone who uses this scripting language to generate dynamic web content. Updated for PHP 5, this book provides solutions that explain how to use the new language features in detail, including the vastly improved object-oriented capabilities and the new PDO data access extension. New sections on classes and objects are included, along with new material on processing XML, building web services with PHP, and working with SOAP/REST architectures. With each recipe, the authors include a discussion that explains the logic and concepts underlying the solution.",
      price: "USD 44.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 11,
        average: "7.6",
        min: 0
      },
      subtitle:
        "Regular Expressions for Perl, Ruby, PHP, Python, C, Java and .NET",
      author: ["Tony Stubblebine"],
      pubdate: "2007-7-25",
      tags: [
        {
          count: 5,
          name: "Regex",
          title: "Regex"
        },
        {
          count: 5,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 4,
          name: "正则表达式",
          title: "正则表达式"
        },
        {
          count: 2,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "programming",
          title: "programming"
        },
        {
          count: 1,
          name: "Linux",
          title: "Linux"
        },
        {
          count: 1,
          name: "CS",
          title: "CS"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s10271421.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "128",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s10271421.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s10271421.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s10271421.jpg"
      },
      alt: "https://book.douban.com/subject/2363803/",
      id: "2363803",
      publisher: "O'Reilly Media",
      isbn10: "0596514271",
      isbn13: "9780596514273",
      title: "Regular Expression Pocket Reference",
      url: "https://api.douban.com/v2/book/2363803",
      alt_title: "",
      author_intro: "",
      summary:
        'This handy little book offers programmers a complete overview of the syntax and semantics of regular expressions that are at the heart of every text-processing application. Ideal as a quick reference, "Regular Expression Pocket Reference" covers the regular expression APIs for Perl 5.8, Ruby (including some upcoming 1.9 features), Java, PHP, .NET and C#, Python, vi, JavaScript, and the PCRE regular expression libraries. \n This concise and easy-to-use reference puts a very powerful tool for manipulating text and data right at your fingertips. Composed of a mixture of symbols and text, regular expressions can be an outlet for creativity, for brilliant programming, and for the elegant solution. "Regular Expression Pocket Reference" offers an introduction to regular expressions, pattern matching, metacharacters, modes and constructs, and then provides separate sections for each of the language APIs, with complete regex listings including: Supported metacharacters for each language APIRegular expression classes and interfaces for Ruby, Java, .NET, and C#Regular expression operators for Perl 5.8Regular expression module objects and functions for PythonPattern-matching functions for PHP and the vi editorPattern-matching methods and objects for JavaScriptUnicode Support for each of the languages With plenty of examples and other resources, "Regular Expression Pocket Reference" summarizes the complex rules for performing this critical text-processing function, and presents this often-confusing topic in a friendly and well-organized format. This guide makes an ideal on-the-job companion.',
      price: "USD 14.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 126,
        average: "8.1",
        min: 0
      },
      subtitle: "",
      author: ["[美] Matt Zandstra"],
      pubdate: "2011-07-01",
      tags: [
        {
          count: 208,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 101,
          name: "面向对象",
          title: "面向对象"
        },
        {
          count: 70,
          name: "设计模式",
          title: "设计模式"
        },
        {
          count: 41,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 36,
          name: "编程",
          title: "编程"
        },
        {
          count: 36,
          name: "模式",
          title: "模式"
        },
        {
          count: 28,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 27,
          name: "php",
          title: "php"
        }
      ],
      origin_title: "PHP Objects, Patterns and Practice",
      image: "https://img1.doubanio.com/view/subject/m/public/s6850848.jpg",
      binding: "平装",
      translator: ["陈浩", "吴孙滨", "胡丹", "李静"],
      catalog:
        "第一部分 介 绍\n第1 章  PHP：设计与管理　　2\n1.1  问题　　2\n1.2  PHP 和其他语言　　3\n1.3  关于本书　　5\n1.3.1  对象　　　5\n1.3.2   模式　　　5\n1.3.3  实践　　　6\n1.3.4  第3 版新增内容　　7\n1.4  小结　　　7\n第二部分  对 象\n第2 章  PHP 与对象　　10\n2.1  PHP 对象的偶然成功　　　10\n2.1.1  最初：PHP/FI 　　10\n2.1.2  语法糖：PHP 3　　10\n2.1.3  一场静悄悄的革命：PHP 4　　11\n2.1.4  拥抱改变：PHP 5　　 12\n2.2  走向未来：PHP 6　　　13\n2.3  拥护和疑虑：关于对象的争辩　　 13\n2.4  小结　　　14\n第3 章  对象基础　　　15\n3.1  类和对象　　　15\n3.1.1  编写第一个类　　15\n3.1.2  第一个对象（或两个） 　　 16\n3.2  设置类中的属性　　17\n3.3  使用方法　　19\n3.4  参数和类型　　21\n3.4.1  基本类型　　22\n3.4.2  获得提示：对象类型　　 24\n3.5  继承　　26\n3.5.1  继承问题　　26\n3.5.2  使用继承　　30\n3.5.3  public、private、protected：管理类的访问　　35\n3.6  小结　　　 39\n第4 章  高级特性　　 40\n4.1  静态方法和属性　　40\n4.2  常量属性　　43\n4.3  抽象类　　44\n4.4  接口　　46\n4.5  延迟静态绑定：static 关键字　　 47\n4.6  错误处理　　50\n4.7  Final 类和方法　　56\n4.8  使用拦截器　　57\n4.9  析构方法　　 61\n4.10  使用__clone()复制对象　　62\n4.11  定义对象的字符串值　　64\n4.12  回调、匿名函数和闭包　　 65\n4.13  小结　　　69\n第5 章  对象工具　　70\n5.1  PHP 和包　　70\n5.1.1  PHP 包和命名空间　　 70\n5.1.2  自动加载　　78\n5.2  类函数和对象函数　　79\n5.2.1  查找类　　80\n5.2.2  了解对象或类　　81\n5.2.3  了解类中的方法　　 82\n5.2.4  了解类属性　　 83\n5.2.5  了解继承　　83\n5.2.6  方法调用　　84\n5.3  反射API　　85\n5.3.1  入门　　85\n5.3.2  开始行动　　86\n5.3.3  检查类　　88\n5.3.4  检查方法　　 89\n5.3.5  检查方法参数　　 91\n5.3.6  使用反射API　　　92\n5.4  小结　　95\n第6 章  对象与设计　　 96\n6.1  代码设计的定义　　96\n6.2  面向对象设计和过程式编程　　 97\n6.2.1  职责　　100\n6.2.2  内聚　　100\n6.2.3  耦合　　101\n6.2.4  正交　　101\n6.3  选择类　　　101\n6.4  多态　　　102\n6.5  封装　　　 104\n6.6  忘记细节　　105\n6.7 4  个方向标　　105\n6.7.1  代码重复　　106\n6.7.2  类知道的太多　　106\n6.7.3  万能的类　　 106\n6.7.4  条件语句　　　106\n6.8  UML　　106\n6.8.1  类图　　 107\n6.8.2  时序图　　111\n6.9  小结　　　112\n第三部分  模 式\n第7 章  什么是设计模式？为何使用它们　　　114\n7.1  什么是设计模式　　114\n7.2  设计模式概览　　116\n7.2.1  命名　　116\n7.2.2  问题　　116\n7.2.3  解决方案　　117\n7.2.4  效果　　 117\n7.3  《设计模式》格式　　117\n7.4  为什么使用设计模式　　118\n7.4.1  一个设计模式定义了一个问题 　　118\n7.4.2  一个设计模式定义了一个解决方案　　118\n7.4.3  设计模式是语言无关的 　　118\n7.4.4  模式定义了一组词汇　　 118\n7.4.5  模式是经过测试的　　 119\n7.4.6  模式是为协作而设计的　　 119\n7.4.7  设计模式促进良好设计　　 119\n7.5  PHP 与设计模式　　120\n7.6  小结　　120\n第8 章  模式原则　　121\n8.1  模式的启示　　121\n8.2  组合与继承　　122\n8.2.1  问题　　122\n8.2.2  使用组合　　124\n8.3  解耦　　127\n8.3.1  问题　　127\n8.3.2  降低耦合　　128\n8.4  针对接口编程，而不是针对实现编程　　130\n8.5  变化的概念　　131\n8.6  父子关系　　132\n8.7  模式　　132\n8.7.1  用于生成对象的模式　　 133\n8.7.2  用于组织对象和类的模式　　 133\n8.7.3  面向任务的模式　　 133\n8.7.4  企业模式　　133\n8.7.5  数据库模式　　133\n8.8  小结　　　 133\n第9 章  生成对象　　134\n9.1  生成对象的问题和解决方法　　 134\n9.2  单例模式　　　138\n9.2.1  问题　　　 138\n9.2.2  实现　　 139\n9.2.3  结果　　 141\n9.3  工厂方法模式　　141\n9.3.1  问题　　141\n9.3.2  实现　　143\n9.3.3  结果　　145\n9.4  抽象工厂模式　　146\n9.4.1  问题　　146\n9.4.2  实现　　 147\n9.4.3  结果　　148\n9.4.4  原型模式　　150\n9.4.5  问题　　150\n9.4.6  实现　　151\n9.5  某些模式的骗术　　153\n9.6  小结　　154\n第10 章  让面向对象编程更加灵活的模式　　155\n10.1   构造可灵活创建对象的类　　 155\n10.2  组合模式　　155\n10.2.1  问题　　 156\n10.2.2  实现　　158\n10.2.3  效果　　161\n10.2.4  组合模式小结　　164\n10.3  装饰模式　　165\n10.3.1  问题　　165\n10.3.2  实现　　 167\n10.3.3  效果　　170\n10.4  外观模式　　 170\n10.4.1  问题　　170\n10.4.2  实现　　172\n10.4.3  效果　　172\n10.5  小结　　 173\n第11 章  执行及描述任务　　174\n11.1  解释器模式　　174\n11.1.1  问题　　174\n11.1.2  实现　　175\n11.1.3  解释器的问题　　 182\n11.2  策略模式　　183\n11.2.1  问题　　 183\n11.2.2  实现　　184\n11.3  观察者模式　　187\n11.4  访问者模式　　194\n11.4.1  问题　　194\n11.4.2  实现　　195\n11.4.3  访问者模式的问题　　 199\n11.5  命令模式　　200\n11.5.1  问题　　200\n11.5.2  实现　　 200\n11.6  小结　　 204\n第12 章  企业模式　　 205\n12.1  架构概述　　205\n12.1.1  模式　　 205\n12.1.2  应用程序和层　　 206\n12.2  企业架构之外的基础模式　　 208\n12.2.1  注册表　　 208\n12.2.2  实现　　209\n12.3  表现层　　217\n12.3.1  前端控制器　　 217\n12.3.2  应用控制器　　227\n12.3.3  页面控制器　　237\n12.3.4  模板视图和视图助手　　 242\n12.4  业务逻辑层　　 245\n12.4.1  事务脚本　　245\n12.4.2  领域模型　　249\n12.5  小结　　252\n第13 章  数据库模式　　253\n13.1  数据层　　 253\n13.2  数据映射器　　253\n13.2.1  问题　　254\n13.2.2  实现　　254\n13.2.3  效果　　 265\n13.3  标识映射　　266\n13.3.1  问题　　266\n13.3.2  实现　　266\n13.3.3  效果　　269\n13.4  工作单元　　 269\n13.4.1  问题　　 269\n13.4.2  实现　　270\n13.4.3  效果　　274\n13.4.4  延迟加载　　 274\n13.4.5  问题　　274\n13.4.6  实现　　 274\n13.4.7  效果　　276\n13.5  领域对象工厂　　276\n13.5.1  问题　　276\n13.5.2  实现　　277\n13.5.3  效果　　278\n13.6  标识对象　　279\n13.6.1  问题　　279\n13.6.2  实现　　 280\n13.6.3  效果　　285\n13.7  选择工厂和更新工厂模式　　 285\n13.7.1  问题　　 285\n13.7.2  实现　　285\n13.7.3  效果　　288\n13.8  数据映射器中剩下些什么　　 289\n13.9  小结　　291\n第四部分  实 践\n第14 章  良好和糟糕的实践　　 294\n14.1  超越代码　　294\n14.2  借一个轮子　　295\n14.3  合作愉快　　296\n14.4  为你的代码插上双翼　　 297\n14.5  文档　　　297\n14.6  测试　　　 298\n14.7  持续集成　　　299\n14.8  小结　　　 300\n第15 章  PEAR 和Pyrus　　　301\n15.1  什么是PEAR　　　 301\n15.2  了解Pyrus　　　302\n15.3  安装PEAR 包　　　303\n15.4  使用PEAR 包　　　306\n15.5  创建自己的PEAR 包　　 311\n15.5.1  package.xml　　　 311\n15.5.2  package.xml 的组成　　 312\n15.5.3  contents 元素　　 313\n15.5.4  依赖　　　316\n15.5.5  使用phprelease 进行灵活的自定义安装　　317\n15.5.6  准备发布包　　　 318\n15.5.7  创建自己的PEAR 频道　　 318\n15.6  小结　　323\n第16 章 用phpDocumentor 生成文档　　 324\n16.1  为什么要使用文档　　　 324\n16.2  安装　　325\n16.3  生成文档　　　325\n16.4  DocBlock 注释　　　 327\n16.5  类的文档　　　 328\n16.6  文件的文档　　　 330\n16.7  属性的文档　　　 330\n16.8  方法的文档　　　331\n16.9  在文档中创建链接　　333\n16.10  小结　　335\n第17 章  使用Subversion 进行版本控制　　336\n17.1  为什么要使用版本控制　　 336\n17.2  获得Subversion 　　337\n17.3  配置Subversion 代码库　　 338\n17.4  开始项目　　　339\n17.5  更新和提交　　 341\n17.6  增加和删除文件及目录　　 344\n17.6.1  添加文件　　344\n17.6.2  删除文件　　345\n17.6.3  添加目录　　345\n17.6.4  删除目录　　345\n17.7  标记和导出项目　　 345\n17.7.1  标记项目　　 345\n17.7.2  导出项目　　346\n17.8  创建项目分支　　347\n17.9  小结　　350\n第18 章  使用PHPUnit 进行测试　　 351\n18.1  功能测试与单元测试　　 351\n18.2  手工测试　　352\n18.3  引入PHPUnit　　 354\n18.3.1  创建测试用例　　354\n18.3.2  断言方法　　 355\n18.3.3   测试异常　　356\n18.3.4  运行测试套件　　357\n18.3.5  约束　　358\n18.3.6  模拟与桩　　360\n18.3.7  失败是成功之母　　 362\n18.4  编写Web 测试　　365\n18.4.1  为测试重构Web 应用 　　366\n18.4.2  简单的Web 测试　　 368\n18.4.3  Selenium 　　370\n18.5  警告　　　 374\n18.6  小结　　　376\n第19 章  用Phing 实现项目的自动构建　　 377\n19.1  什么是Phing　　 377\n19.2  获取和安装Phing　　　 378\n19.3  编写build 文档　　　378\n19.3.1  目标　　　380\n19.3.2  属性　　　382\n19.3.3  类型　　　387\n19.3.4  任务　　　391\n19.4  小结　　 394\n第五部分  结 论\n第20 章  持续集成　　 396\n20.1  什么是持续集成　　396\n20.2  CruiseControl 和phpUnderControl   　404\n20.2.1  安装CruiseControl　　 404\n20.2.2  安装phpUnderControl  　　406\n20.2.3  安装项目　　 408\n20.3  小结　　418\n第21 章  对象、模式与实践　　 419\n21.1  对象　　419\n21.1.1  选择　　420\n21.1.2  封装和委托　　420\n21.1.3  解耦　　 420\n21.1.4  复用性　　 421\n21.1.5   美学　　421\n21.2  模式　　421\n21.2.1  模式给我们带来了什么 　　422\n21.2.2  模式和设计原则　　 422\n21.3  实践　　 424\n21.3.1  测试　　424\n21.3.2  文档　　 424\n21.3.3  版本控制　　425\n21.3.4  自动构建　　 425\n21.3.5  持续集成　　425\n21.3.6  我们还遗漏了什么　　 425\n21.4  小结　　 426\n第六部分  附 录\n附录A  参考文献　　428\n附录B  简单的解析器　　431",
      pages: "450",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s6850848.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s6850848.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s6850848.jpg"
      },
      alt: "https://book.douban.com/subject/6559267/",
      id: "6559267",
      publisher: "人民邮电出版社",
      isbn10: "7115256241",
      isbn13: "9787115256249",
      title: "深入PHP：面向对象、模式与实践（第3版）",
      url: "https://api.douban.com/v2/book/6559267",
      alt_title: "PHP Objects, Patterns and Practice",
      author_intro:
        "Matt Zandstra  从事互联网应用开发十余年，目前是雅虎公司工程师，从事核心模板管理系统的开发。他是一位多产的技术作家，除本书外另著有Sams Teach Yourself PHP in 24 Hours等，他还为Linux Magazine、php|architect杂志、IBM DeveloperWorks、Zend.com和bdz-consult.com写过许多PHP方面的文章。",
      summary:
        "本书是PHP 专家经典力作的最新版本。书中主要介绍了如何使用面向对象技术和设计模式编写稳定的、可维护的代码，如何使用Subversion 管理多个开发人员，如何使用Phing 和PEAR 进行构建和安装，以及将构建和测试过程自动化的策略，包括持续集成。\n本书适合中高级PHP 程序员阅读。",
      price: "69.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 17,
        average: "7.4",
        min: 0
      },
      subtitle: "PHP Template Programming And Applications",
      author: ["Hasin Hayder", "J. P. Maia", "Lucian Gheorghe"],
      pubdate: "2006-4-30",
      tags: [
        {
          count: 18,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 10,
          name: "Smarty",
          title: "Smarty"
        },
        {
          count: 4,
          name: "Template",
          title: "Template"
        },
        {
          count: 3,
          name: "programming",
          title: "programming"
        },
        {
          count: 2,
          name: "PHP&MySQL",
          title: "PHP&MySQL"
        },
        {
          count: 2,
          name: "Design",
          title: "Design"
        },
        {
          count: 2,
          name: "Application",
          title: "Application"
        },
        {
          count: 1,
          name: "webdev",
          title: "webdev"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s11163295.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "256",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s11163295.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s11163295.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s11163295.jpg"
      },
      alt: "https://book.douban.com/subject/1822489/",
      id: "1822489",
      publisher: "Packt Publishing",
      isbn10: "190481140X",
      isbn13: "9781904811404",
      title: "Smarty",
      url: "https://api.douban.com/v2/book/1822489",
      alt_title: "",
      author_intro: "",
      summary:
        "A step-by-step guide to building PHP web sites and applications using the Smarty templating engine\n- Bring the benefits of Smarty to your PHP programming\n-Give your designers the power to modify content and layout without PHP programming\n-Produce code that is easier to debug, maintain, and modify\n-Useful for both Smarty developers and users\nSmarty is a templating engine for PHP. Designers who are used to working with HTML files can work with Smarty templates, which are HTML files with simple tags while programmers work with the underlying PHP code. The Smarty engine brings the code and templates together. The result of all this is that designers can concentrate on designing, programmers can concentrate on programming, and they don't need to get in each others way so much. Even if you are developing a site on your own, Smarty is a powerful way to make your code clearer to you and others, as well as easier to debug and modify later.\nThis book is a comprehensive guide to all aspects of using Smarty. It will help you to:\n-Install and configure Smarty on your Web server\n- Understand how Smarty affects your web site architecture, and build site foundations that make the most of what Smarty offers\n- Designers will learn to work with templates that contain variables and logic, to modify layouts or content of Smarty web sites\n- See how Smarty caching can improve the performance of your sites\n- Develop custom Smarty functions and plug-ins to incorporate into your templates\nUsing a step-by-step approach based on realistic examples, the expert authors show you how to use Smarty in your own PHP development. The book is ideal for PHP developers who are new to Smarty, and for web designers who are working with PHP developers who are using Smarty.",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 5,
        average: "0.0",
        min: 0
      },
      subtitle: "(国内首部全面介绍PHP MVC开发模式实战大全，一本书PHP建站全掌握",
      author: ["李开涌"],
      pubdate: "2013-7-1",
      tags: [
        {
          count: 10,
          name: "php",
          title: "php"
        },
        {
          count: 5,
          name: "mvc",
          title: "mvc"
        },
        {
          count: 4,
          name: "thinkphp",
          title: "thinkphp"
        },
        {
          count: 3,
          name: "mvc实战",
          title: "mvc实战"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "thinphp",
          title: "thinphp"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s26835790.jpg",
      binding: "平装",
      translator: [],
      catalog:
        '"目    录\n前言\n基  础  篇\n第1章  开发前准备2\n1.1  PHP与MVC概述3\n1.2  开发环境搭建7\n1.2.1  在Windows下使用一键安装包8\n1.2.2  在Linux平台安装LNMP11\n1.3  开发工具介绍20\n1.3.1  PHP Coder20\n1.3.2  PHP Editor21\n1.3.3  NetBeans IDE21\n1.3.4  Eclipse PDT22\n1.3.5  Zend Studio24\n1.3.6  Adobe Dreamweaver25\n1.3.7  VS.PHP27\n1.4  SVN版本控制28\n1.4.1  SVN介绍28\n1.4.2  SVN的安装29\n1.4.3  TortoiseSVN的简单使用32\n1.4.4  TortoiseSVN文件管理35\n1.4.5  SVN版本库权限配置38\n1.5  小结40\n第2章  面向对象基础41\n2.1  面向对象介绍42\n2.2  PHP面向对象基础43\n2.2.1  class关键字43\n2.2.2  类中的成员44\n2.2.3  实例化类46\n2.3  类中的方法47\n2.3.1  方法的参数47\n2.3.2  方法的返回值48\n2.3.3  访问修饰符49\n2.3.4  $this关键字50\n2.4  类的继承50\n2.4.1  子类继承父类51\n2.4.2  重写父类中的成员属性52\n2.4.3  final关键字53\n2.5  静态类成员54\n2.5.1  static关键字54\n2.5.2  访问静态类成员（self::parent::）55\n2.5.3  类常量57\n2.6  小结58\n第3章  类的高级特性59\n3.1  类对象的克隆（clone）60\n3.2  类接口（interface）60\n3.2.1  接口的意义60\n3.2.2  定义接口61\n3.2.3  实现接口（implements）62\n3.3  抽象类与抽象方法64\n3.3.1  理解抽象概念65\n3.3.2  定义抽象类和方法（abstract）65\n3.3.3  使用抽象类66\n3.3.4  接口与抽象类的区别67\n3.4  类的异常68\n3.4.1  Exception类68\n3.4.2  使用try、catch、throw语句69\n3.5  小结70\n实  战  篇\n第4章  PHP MVC发展状况72\n4.1  出身豪门的Zend Framework73\n4.1.1  Zend Framework简介73\n4.1.2  安装Zend Framework73\n4.1.3  使用Zend Framework实现MVC75\n4.1.4  Zend Framework核心组件76\n4.2  功能强大的Symfony80\n4.2.1  Symfony简介80\n4.2.2  获得Symfony81\n4.2.3  实现一个简单的MVC82\n4.2.4  Symfony的配置文件85\n4.3  灵活完善的CakePHP85\n4.3.1  CakePHP简介85\n4.3.2  下载安装CakePHP86\n4.3.3  使用CakePHP构建MVC编程86\n4.3.4  好用的CakePHP视图助手89\n4.4  使用广泛的CodeIgniter89\n4.4.1  CodeIgniter简介89\n4.4.2  安装CodeIgniter90\n4.4.3  使用CodeIgniter实现MVC91\n4.5  高效便捷的ThinkPHP94\n4.5.1  ThinkPHP介绍94\n4.5.2  下载安装ThinkPHP95\n4.5.3  使用ThinkPHP实现MVC96\n4.5.4  高效的ThinkPHP视图引擎98\n4.6  小结100\n第5章  ThinkPHP开发入门101\n5.1  大道至简、开发由我102\n5.1.1  入口文件102\n5.1.2  两种创建项目的方式103\n5.1.3  模块分组104\n5.2  ThinkPHP目录106\n5.2.1  系统目录106\n5.2.2  项目目录110\n5.3  配置文件111\n5.3.1  选项配置111\n5.3.2  静态缓存配置113\n5.3.3  路由配置115\n5.4  小结115\n第6章  ThinkPHP开发MVC应用116\n6.1  ThinkPHP中的URL117\n6.1.1  URL模式117\n6.1.2  URL路由119\n6.1.3  自动生成匹配的URL121\n6.1.4  实现文件伪静态122\n6.2  模型（Model）123\n6.2.1  创建模型123\n6.2.2  实例化模型124\n6.2.3  模型初始化（_initialize()）125\n6.3  控制器（Controller）126\n6.3.1  创建控制器126\n6.3.2  控制器中的动作（Action）126\n6.3.3  控制器的调用128\n6.3.4  项目空控制器与控制器空动作129\n6.3.5  动作的前后操作131\n6.4  视图（View）132\n6.4.1  创建和使用视图132\n6.4.2  系统变量与常量133\n6.4.3  在视图中使用函数134\n6.4.4  数据循环135\n6.4.5  条件判断138\n6.4.6  使用外部文件141\n6.4.7  导入标签库142\n6.4.8  使用布局145\n6.5  小结147\n第7章  ThinkPHP的数据库操作148\n7.1  定义数据表模型149\n7.1.1  模型映射149\n7.1.2  自定义模型149\n7.1.3  create方法151\n7.1.4  模型属性154\n7.2  基础模型（Model）158\n7.2.1  连贯操作159\n7.2.2  CURD159\n7.2.3  查询语言163\n7.2.4  使用原生的SQL语言166\n7.3  关联模型（RelationModel）167\n7.3.1  关联关系167\n7.3.2  关联定义168\n7.3.3  关联模型的CURD169\n7.4  高级模型（AdvModel）174\n7.4.1  定位查询174\n7.4.2  动态查询175\n7.4.3  内容存文本176\n7.5  大数据支持176\n7.5.1  分布式数据库177\n7.5.2  读写分离179\n7.5.3  数据表分区183\n7.6  小结187\n第8章  安全与调试188\n8.1  构建稳健及安全的MVC189\n8.2  ThinkPHP内置的安全机制189\n8.2.1  表单令牌189\n8.2.2  字段检测190\n8.2.3  数据验证193\n8.2.4  数据验证码197\n8.3  ThinkPHP安全日志机制201\n8.3.1  记录方式201\n8.3.2  系统日志202\n8.3.3  应用日志202\n8.4  使用消息队列机制204\n8.4.1  HTTPSQS基础204\n8.4.2  安装HTTPSQS205\n8.4.3  测试HTTPSQS207\n8.4.4  在MVC中使用HTTPSQS209\n8.5  ThinkPHP程序调试机制212\n8.5.1  开启调试功能212\n8.5.2  代码编译概念214\n8.5.3  异常定制215\n8.5.4  性能调试216\n8.6  小结218\n第9章  ThinkPHP功能库220\n9.1  数据处理221\n9.1.1  XML引擎221\n9.1.2  返回XML228\n9.1.3  返回Json232\n9.1.4  使用Json及Jsonp235\n9.2  ThinkPHP函数库241\n9.2.1  快捷方法241\n9.2.2  基础函数库242\n9.2.3  扩展函数库245\n9.3  ThinkPHP多语言支持248\n9.3.1  部署多语言248\n9.3.2  实现多语言249\n9.3.3  多语言与客户端250\n9.4  客户端252\n9.4.1  封装的Session252\n9.4.2  封装的Cookie256\n9.5  小结257\n第10章  网站静态化259\n10.1  Cache类260\n10.1.1  缓存的方式260\n10.1.2  开启缓存260\n10.1.3  安装Memcached261\n10.1.4  使用Memcached265\n10.2  Memcached实战应用267\n10.2.1  页面局部缓存267\n10.2.2  缓存数据集267\n10.2.3  使用Memcache存放Session270\n10.3  使用Redis缓存274\n10.3.1  Redis的安装274\n10.3.2  安装Redis扩展277\n10.3.3  测试Redis279\n10.3.4  Redis缓存279\n10.4  静态缓存282\n10.4.1  静态缓存配置282\n10.4.2  静态缓存规则283\n10.5  小结286\n第11章  ThinkPHP扩展287\n11.1  使用扩展288\n11.1.1  扩展的分类288\n11.1.2  模板引擎扩展291\n11.2  网络操作293\n11.2.1  文件上传293\n11.2.2  Nginx文件上传进度295\n11.2.3  FTP文件上传304\n11.2.4  下载文件305\n11.2.5  Socket套接字编程306\n11.2.6  定位当前位置308\n11.2.7  发送电子邮件309\n11.3  数据处理311\n11.3.1  数据加密311\n11.3.2  数据编码转换313\n11.3.3  数据分页314\n11.3.4  日期数据315\n11.3.5  Input类317\n11.3.6  GD库绘制图形318\n11.4  行为扩展320\n11.4.1  行为概述320\n11.4.2  内置行为扩展322\n11.4.3  自定义行为扩展323\n11.5  小结325\n第12章  SOAP分布式开发326\n12.1  分布式开发概念327\n12.1.1  SOA与SOAP327\n12.1.2  PHP 5分布式开发329\n12.2  SOAP消息体331\n12.2.1  WSDL文件331\n12.2.2  定义根消息体definitions335\n12.2.3  type类型335\n12.2.4  portType端口类型336\n12.2.5  message消息列表337\n12.2.6  binding服务绑定描述337\n12.2.7  service服务描述338\n12.2.8  可视化创建WSDL338\n12.2.9  使用nusoap创建WSDL341\n12.2.10  ThinkPHP生成SOAP服务343\n12.3  使用soapUI测试WSDL347\n12.3.1  soapUI简介347\n12.3.2  安装soapUI348\n12.3.3  创建项目349\n12.3.4  测试项目350\n12.3.5  负载测试351\n12.4  小结353\n第13章  整合Smarty模板引擎354\n13.1  Smarty模板引擎介绍355\n13.2  使用Smarty356\n13.2.1  在PHP中使用Smarty356\n13.2.2  开启ThinkPHP模板扩展358\n13.2.3  以扩展的方式使用全功能Smarty358\n13.3  Smarty模板函数和标签360\n13.3.1  include（包含文件）361\n13.3.2  capture（暂存数据）361\n13.3.3  include_php（包含PHP文件）362\n13.3.4  insert（插入函数）362\n13.3.5  literal（原文本输出）363\n13.3.6  php（执行PHP语句块）363\n13.3.7  strip（保留空格和回车符）364\n13.4  Smarty模板控制语句364\n13.4.1  if、elseif（判断语句）364\n13.4.2  foreach（循环数据）365\n13.4.3  section（遍历数组）366\n13.5  变量调节器367\n13.5.1  capitalize（首字母大写）367\n13.5.2  count_characters（统计字符）367\n13.5.3  count_paragraphs（统计段落）367\n13.5.4  count_sentences（统计句数）368\n13.5.5  count_words（统计单词）368\n13.5.6  date_format（格式化日期）368\n13.5.7  escape（字符转码）369\n13.5.8  replace（字符替换）369\n13.5.9  regex_replace（正则替换）370\n13.5.10  truncate（字符截取）370\n13.6  视图助手370\n13.6.1  html_image（生成图像）370\n13.6.2  html_options（生成表单选择组件）371\n13.6.3  html_radios（生成表单单选组件）372\n13.6.4  html_checkboxes（生成表单复选组件）373\n13.6.5  html_select_date（生成表单日期选择组件）374\n13.6.6  html_select_time（生成表单时间选择组件）376\n13.6.7  html_table（生成表格）377\n13.7  Smarty对象方法378\n13.7.1  display（显示模板）378\n13.7.2  fetch（获取输出内容）379\n13.7.3  configLoad（加载配置信息）379\n13.7.4  registerPlugin（注册插件）380\n13.8  Smarty缓存383\n13.8.1  开启缓存383\n13.8.2  局部缓存384\n13.9  小结386\n第14章  整合Coreseek全文搜索服务387\n14.1  全文索引概述388\n14.2  Coreseek基础389\n14.2.1  Coreseek概述389\n14.2.2  在Windows下安装Coreseek390\n14.2.3  在Linux下安装Coreseek394\n14.3  Coreseek管理工具397\n14.3.1  indexer397\n14.3.2  searchd400\n14.3.3  search402\n14.4  创建索引403\n14.4.1  索引源分类403\n14.4.2  增量索引407\n14.4.3  实时索引409\n14.5  在MVC中搜索数据412\n14.5.1  安装Sphinx扩展模块412\n14.5.2  使用PHP接口413\n14.5.3  在MVC中搜索数据414\n14.5.4  实现关键词高亮显示418\n14.6  小结420\n第15章  使用MongoDB421\n15.1  MongoDB介绍422\n15.2  MongoDB的安装424\n15.2.1  在Windows下安装MongoDB424\n15.2.2  在Linux下安装MongoDB426\n15.3  MongoDB的使用428\n15.3.1  理解MongoDB的数据结构428\n15.3.2  数据库管理429\n15.3.3  文档数据类型430\n15.3.4  插入数据432\n15.3.5  查询数据433\n15.3.6  更新数据436\n15.3.7  删除数据436\n15.4  条件操作437\n15.4.1  条件判断语句437\n15.4.2  $all匹配全部438\n15.4.3  $exists 检查字段438\n15.4.4  null 空值处理439\n15.4.5  $ne比较439\n15.4.6  $mod 取模运算440\n15.4.7  $in、nin枚举查询440\n15.4.8  $or、$nor判断查询441\n15.4.9  $type映射查询442\n15.4.10  使用正则表达式匹配442\n15.4.11  limit、skip 限制查询443\n15.4.12  count 查询记录条数444\n15.4.13  sort 查询结果排序444\n15.5  性能优化445\n15.5.1  使用索引445\n15.5.2  固定集合448\n15.5.3  GridFS450\n15.5.4  Profile优化器450\n15.6  在MVC中使用MongoDB451\n15.6.1  安装PHP扩展451\n15.6.2  开启MongoDB用户验证453\n15.6.3  ThinkPHP操作MongoDB455\n15.7  小结459\n第16章  Redis实战460\n16.1  Redis的使用461\n16.1.1  Redis概述461\n16.1.2  常用管理命令462\n16.1.3  Redis用户验证464\n16.2  Redis数据类型465\n16.2.1  String类型465\n16.2.2  Hash类型467\n16.2.3  List类型469\n16.2.4  Sets类型473\n16.2.5  Zset类型477\n16.2.6  使用phpRedisAdmin480\n16.3  Redis高级使用483\n16.3.1  数据持久化483\n16.3.2  虚拟内存484\n16.3.3  事务处理484\n16.3.4  主从同步486\n16.4  在MVC中使用Redis487\n16.4.1  在PHP中使用Redis487\n16.4.2  在MVC中进行CURD操作491\n16.4.3  数据分页496\n16.5  小结498\n项  目  篇\n第17章  开发论坛系统500\n17.1  开发前准备501\n17.1.1  系统介绍501\n17.1.2  系统预览501\n17.1.3  架构设计505\n17.1.4  系统部署511\n17.2  系统整体界面设计513\n17.2.1  布局方案514\n17.2.2  论坛首页516\n17.2.3  论坛版块519\n17.3  用户模块524\n17.3.1  用户登录524\n17.3.2  用户注册528\n17.3.3  使用微博账号登录532\n17.3.4  将现有账号绑定到微博535\n17.4  发表帖子模块537\n17.4.1  整合百度编辑器537\n17.4.2  上传图片540\n17.4.3  管理图片542\n17.4.4  上传附件543\n17.4.5   数据提交处理544\n17.5   帖子内容模块545\n17.5.1  帖子正文545\n17.5.2  回复列表547\n17.5.3  回复帖子550\n17.6   帖子管理模块551\n17.6.1  删除帖子551\n17.6.2  锁定帖子553\n17.6.3  置顶帖子554\n17.6.4  推荐帖子554\n17.7  行为拦截器555\n17.7.1  统计浏览量555\n17.7.2  登记浏览位置556\n17.8   帖子搜索模块557\n17.8.1  标题搜索557\n17.8.2  使用全文搜索558\n17.9  小结562\n第18章  开发自己的MVC框架563\n18.1  开发前准备564\n18.1.1  开发MVC框架的思路564\n18.1.2  文件结构564\n18.2  核心类库565\n18.2.1  初始化565\n18.2.2  URL处理566\n18.3  控制器的开发567\n18.3.1  类自动载入568\n18.3.2  加载模板引擎（View）569\n18.3.3  处理消息（message）569\n18.4  模型的开发572\n18.4.1  使用PDO572\n18.4.2  模型实例化573\n18.4.3  实现连贯操作573\n18.4.4  读取数据574\n18.4.5  插入数据576\n18.4.6  更新数据577\n18.4.7  删除数据578\n18.5  扩展类库582\n18.5.1  Session驱动扩展583\n18.5.2  缓存驱动扩展586\n18.6  测试MVC框架588\n18.6.1  创建项目589\n18.6.2  测试CURD590\n18.6.3  测试驱动594\n18.7  小结595\n附录596\n附录A  让Nginx支持Pathinfo模式596\n附录B  配置团队开发环境597\n"',
      pages: "600",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s26835790.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s26835790.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s26835790.jpg"
      },
      alt: "https://book.douban.com/subject/24858320/",
      id: "24858320",
      publisher: "机械工业出版社",
      isbn10: "7111428528",
      isbn13: "9787111428527",
      title: "PHP MVC开发实战",
      url: "https://api.douban.com/v2/book/24858320",
      alt_title: "",
      author_intro:
        "李开涌，IT作家，技术顾问。曾供职于电信盈科，主要从事分布式集成系统的开发。拥有超过8年的开源技术编程经验，对Linux、FreeBSD以及Hadoop集群等均有丰富的使用及开发经验。同时，还是微软Silverlight MVP，精通微软的.NET平台技术，是国内最早从事Windows Phone技术普及的IT作者，曾著有《Windows Phone 7应用开发入门与实践》一书。目前从事分布式开发及云技术研究。",
      summary:
        '"MVC是一种先进的开发模式，能够解决团队开发之间协同配合的问题，使得网站各部件以更高的效率运行。MVC模式将网站分为3大部件，分别为模型、视图、控制器。这3大部件各自分离，但又相互依存，最终形成了一个容易维护、容易扩展、高效运行的网站平台。对于后台程序员，借助于MVC模式就可以更加专注于功能的实现，而不需要太多地涉及页面与前端。这种分工协作的最终目的是提高开发效率及项目质量。对于个人项目，也许在其他编程技术（例如Java、Python）中，MVC模式并没有优势，但在PHP中，由于支持混合编程，所以使用MVC模式进行编程，能显著提高工作效率。\n本书是国内第一本专门介绍PHP MVC开发模式的图书，全书围绕MVC实现思路进行细致的讲解。通过MVC编程模式，以点带面，全面深入探讨PHP核心技术。同时，本书也是一本深入介绍利用PHP构建高性能网站的图书，通过MVC的数据库中间件，可以轻松实现网站群体、读写分离等高级应用，本书在此基础上还会进一步介绍当前流行的NoSQL应用、全文搜索应用等。最后，作者通过一个自行编写的MVC框架，引导读者开发属于自己的PHP MVC框架。\n本书内容通俗易懂、示例形象，适合广大的Web从业人员阅读。由于PHP非常简单、易用，所以就算是未接触过PHP的读者或者初学者，只要掌握了基础的面向对象编程思想就可以轻松上手。\n"',
      price: "CNY 98.80"
    },
    {
      rating: {
        max: 10,
        numRaters: 134,
        average: "8.0",
        min: 0
      },
      subtitle: "",
      author: ["Kevin Tatroe", "Rasmus Lerdorf"],
      pubdate: "2003-7-1",
      tags: [
        {
          count: 155,
          name: "php",
          title: "php"
        },
        {
          count: 50,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 41,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 29,
          name: "web",
          title: "web"
        },
        {
          count: 20,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 17,
          name: "程序",
          title: "程序"
        },
        {
          count: 17,
          name: "web技术",
          title: "web技术"
        },
        {
          count: 16,
          name: "开发",
          title: "开发"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s1395222.jpg",
      binding: "平装(无盘)",
      translator: ["邓云佳"],
      catalog: "",
      pages: "560",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s1395222.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s1395222.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s1395222.jpg"
      },
      alt: "https://book.douban.com/subject/1230448/",
      id: "1230448",
      publisher: "中国电力出版社",
      isbn10: "7508314182",
      isbn13: "9787508314181",
      title: "PHP程序设计",
      url: "https://api.douban.com/v2/book/1230448",
      alt_title: "",
      author_intro: "",
      summary:
        "本书涵盖了创建一个高效PHP Web应用程序所需要的所有技术，其内容包括：PHP语言基础的详细信息，包括数据类型、变量、操作符和流控制语句。用专门章节讨论关于函数、字符串、数组和对象的基本内容。涵盖通用的PHP Web应用程序设计技术，如表单处理和验证、会话跟踪以及cookie。用和数据库无关的PEAR DB库与关系数据库（如MySQL和Oracle）进行交互的内容。介绍用PHP生成动态图像、创建",
      price: "68.00"
    },
    {
      rating: {
        max: 10,
        numRaters: 7,
        average: "0.0",
        min: 0
      },
      subtitle: "A Guide to Developing Internet Agents with PHP/CURL",
      author: ["Michael Schrenk"],
      pubdate: "2007-03-30",
      tags: [
        {
          count: 11,
          name: "网络爬虫",
          title: "网络爬虫"
        },
        {
          count: 6,
          name: "互联网",
          title: "互联网"
        },
        {
          count: 5,
          name: "编程",
          title: "编程"
        },
        {
          count: 5,
          name: "programming",
          title: "programming"
        },
        {
          count: 4,
          name: "Spider",
          title: "Spider"
        },
        {
          count: 2,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 2,
          name: "爬虫",
          title: "爬虫"
        },
        {
          count: 2,
          name: "数据挖掘",
          title: "数据挖掘"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s2791847.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "306",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s2791847.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s2791847.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s2791847.jpg"
      },
      alt: "https://book.douban.com/subject/2335163/",
      id: "2335163",
      publisher: "No Starch Press",
      isbn10: "1593271204",
      isbn13: "9781593271206",
      title: "Webbots, Spiders, and Screen Scrapers",
      url: "https://api.douban.com/v2/book/2335163",
      alt_title: "",
      author_intro: "",
      summary:
        "The Internet is bigger and better than what a mere browser allows. Webbots, Spiders, and Screen Scrapers is for programmers and businesspeople who want to take full advantage of the vast resources available on the Web. There's no reason to let browsers limit your online experience-especially when you can easily automate online tasks to suit your individual needs. \n\n Learn how to write webbots and spiders that do all this and more:<br />  \nProgrammatically download entire websites \nEffectively parse data from web pages \nManage cookies \nDecode encrypted files \nAutomate form submissions \nSend and receive email \nSend SMS alerts to your cell phone \nUnlock password-protected websites \nAutomatically bid in online auctions \nExchange data with FTP and NNTP servers \n\n Sample projects using standard code libraries reinforce these new skills. You'll learn how to create your own webbots and spiders that track online prices, aggregate different data sources into a single web page, and archive the online data you just can't live without. You'll learn inside information from an experienced webbot developer on how and when to write stealthy webbots that mimic human behavior, tips for developing fault-tolerant designs, and various methods for launching and scheduling webbots. You'll also get advice on how to write webbots and spiders that respect website owner property rights, plus techniques for shielding websites from unwanted robots. \n\n As a bonus, visit the author's website to test your webbots on sample target pages, and to download the scripts and code libraries used in the book. \n\n Some tasks are just too tedious-or too important!- to leave to humans. Once you've automated your online life, you'll never let a browser limit the way you use the Internet again.",
      price: "USD 39.95"
    },
    {
      rating: {
        max: 10,
        numRaters: 15,
        average: "7.3",
        min: 0
      },
      subtitle: "PHP顶级框架Zend Framework开发实战",
      author: ["欧雪冰"],
      pubdate: "2012-06-01",
      tags: [
        {
          count: 19,
          name: "Zend",
          title: "Zend"
        },
        {
          count: 16,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 9,
          name: "框架",
          title: "框架"
        },
        {
          count: 6,
          name: "Framework",
          title: "Framework"
        },
        {
          count: 4,
          name: "编程",
          title: "编程"
        },
        {
          count: 3,
          name: "计算机科学",
          title: "计算机科学"
        },
        {
          count: 3,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 2,
          name: "面向对象",
          title: "面向对象"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s11095751.jpg",
      binding: "平装",
      translator: [],
      catalog:
        "第1部分  开发前的准备工作\n第1章  创建开发环境\t2\n1.1  配置开发环境\t3\n1.1.1  Windows系统下XAMPP集成软件包的下载和安装\t4\n1.1.2  Linux系统下Apache、MySQL、PHP的安装\t9\n1.1.3  Zend Server CE开发环境\t11\n1.1.4  phpMyAdmin工具\t11\n1.2  模仿更真实的服务器环境\t12\n1.2.1  劫持一个域名\t13\n1.2.2  启用Rewrite模块\t14\n1.2.3  创建虚拟主机\t14\n1.3  开发工具\t16\n1.3.1  Zend Studio\t16\n1.3.2  vim编辑器\t18\n1.4  本章小结\t20\n第2章  安装并初步了解Zend Framework框架\t21\n2.1  Zend Framework的下载和安装\t22\n2.2  创建Zend Framework项目\t23\n2.2.1  使用ZF tool\t23\n2.2.2  使用Zend Studio\t30\n2.3  了解Zend Framework的MVC结构\t33\n2.3.1  Controller控制器\t37\n2.3.2  Model模型\t38\n2.3.3  View视图\t38\n2.3.4  路由和分发规则\t39\n2.4  本章小结\t41\n第3章  layout模板布局\t42\n3.1  准备整站CSS文件\t43\n3.2  理解layout\t43\n3.3  开启layout布局模板\t44\n3.4  规划layout\t45\n3.4.1  应用不同的layout\t47\n3.4.2  避免过度设计\t47\n3.5  在Bootstrap引导文件中添加资源\t47\n3.6  让布局更完整和符合标准\t48\n3.7  本章小结\t49\n第2部分  开发网站的前台\n第4章  基本页面的实现\t52\n4.1  准备好数据库\t53\n4.1.1  数据库的设计\t54\n4.1.2  创建数据库\t55\n4.1.3  添加示例数据\t56\n4.1.4  在application.ini文件中配置数据库信息\t56\n4.2  显示一篇新闻文章\t60\n4.2.1  创建文章模型和方法\t61\n4.2.2  创建新闻文章控制器\t64\n4.2.3  创建新闻频道首页视图\t65\n4.2.4  改进模型，让它适应更复杂的查询条件\t66\n4.2.5  改进NewsController控制器\t67\n4.3  显示一个新闻文章列表\t68\n4.3.1  扩充Page模型，添加getPages方法\t69\n4.3.2  扩充News控制器\t70\n4.3.3  使用partialLoop助手输出循环\t71\n4.4  创建文章详细信息页面\t72\n4.4.1  创建PageController控制器并添加detail方法\t73\n4.4.2  创建detail页面视图\t74\n4.4.3  在detail页面添加其他文章的链接\t74\n4.5  本章小结\t76\n第5章  对页面进行分类和导航\t78\n5.1  页面组织和分类的数据库设计\t79\n5.1.1  设计分类数据库\t79\n5.1.2  创建分类数据库并添加示例数据\t80\n5.2  创建Category模型\t81\n5.3  创建CategoryController分类控制器\t82\n5.4  输出分类到视图\t83\n5.5  创建新频道\t84\n5.5.1  准备一些数据\t85\n5.5.2  创建About控制器\t85\n5.5.3  创建About视图\t85\n5.6  创建导航菜单和面包屑路径\t87\n5.6.1  了解Zend_Navigation组件\t87\n5.6.2  编写XML文件\t88\n5.6.3  在bootstrap.ini引导文件中进行配置\t89\n5.6.4  在layout布局模板和视图中调用\t90\n5.6.5  结合JavaScript代码完成导航栏制作\t90\n5.7  本章小结\t92\n第6章  用户注册、登录和注销\t93\n6.1  准备用户数据表\t94\n6.2  实现用户注册功能\t95\n6.2.1  创建注册表单\t95\n6.2.2  处理表单\t101\n6.2.3  增加用户页面\t105\n6.2.4  用E-mail通知用户注册成功\t107\n6.2.5  避免同名用户\t108\n6.3  实现用户登录和注销\t110\n6.3.1  创建登录表单\t111\n6.3.2  使用Zend_Auth组件实现登录\t112\n6.3.3  在layout中构建用户面板\t115\n6.4  注销账户\t118\n6.5  账户管理\t119\n6.5.1  修改账户页面\t119\n6.5.2  更新用户信息\t120\n6.5.3  修改密码\t126\n6.5.4  忘记密码的处理方法\t127\n6.6  本章小结\t131\n第7章  博客\t132\n7.1  准备数据库\t133\n7.1.1  添加博客分类数据\t133\n7.1.2  创建Tag标签相关数据表\t133\n7.2  发表博客\t134\n7.2.1  创建博客表单\t134\n7.2.2  为表单扩展Page模型\t140\n7.2.3  实现博客Tag功能\t143\n7.2.4  博客表单的处理\t145\n7.3  博客的显示\t147\n7.3.1  博客首页\t147\n7.3.2  使用Zend_Paginator进行分页显示\t148\n7.3.3  博客内容页面\t154\n7.4  博客的更新与删除\t157\n7.5  为博客添加评论功能\t162\n7.5.1  创建数据库\t162\n7.5.2  评论表单\t162\n7.5.3  在控制器中增加验证码\t164\n7.5.4  评论表单的处理\t166\n7.5.5  显示评论\t170\n7.6  本章小结\t171\n第8章  社区\t172\n8.1  数据库设计和准备工作\t173\n8.2  更换布局\t176\n8.2.1  创建新的论坛布局模板\t176\n8.2.2  控制器中使用新布局文件\t177\n8.3  社区的模型\t177\n8.3.1  ForumCategories模型\t178\n8.3.2  Forum模型\t178\n8.3.3  ForumTopic模型\t179\n8.3.4  ForumPost模型\t182\n8.4  社区首页\t185\n8.4.1  首页控制器\t186\n8.4.2  视图\t187\n8.5  发表主题\t188\n8.5.1  表单\t188\n8.5.2  控制器\t189\n8.5.3  视图\t190\n8.6  为表单添加所见即所得编辑器\t191\n8.6.1  安装和配置\t192\n8.6.2  在视图中部署\t204\n8.6.3  用装饰器修正错误\t205\n8.7  为编辑器添加图片上传功能\t206\n8.8  板块页面\t208\n8.8.1  控制器\t208\n8.8.2  视图\t209\n8.9  主题页面\t212\n8.9.1  控制器\t212\n8.9.2  视图\t213\n8.10  回复主题\t217\n8.10.1  控制器\t217\n8.10.2  视图\t218\n8.11  帖子管理\t218\n8.11.1  修改模型\t218\n8.11.2  主题的更新和删除\t220\n8.11.3  回复的更新和删除\t221\n8.12  论坛、博客和用户页面的整合\t223\n8.12.1  User控制器\t223\n8.12.2  用户account视图\t224\n8.13  本章小结\t226\n第3部分  开发网站后台和其他特殊功能\n第9章  框架结构和后台管理模块的创建\t228\n9.1  什么是模块\t229\n9.2  创建admin模块\t230\n9.3  模块Bootstrap引导文件\t231\n9.4  为admin模块规划模板\t232\n9.4.1  模板文件\t232\n9.4.2  给admin应用新模板\t233\n9.5  启用Dojo框架\t236\n9.5.1  部署Dojo\t238\n9.5.2  启用Zend_Dojo组件\t239\n9.6  本章小结\t242\n第10章  实现后台管理功能\t243\n10.1  管理分类\t244\n10.1.1  分类管理的准备工作\t245\n10.1.2  后台分类首页\t246\n10.1.3  创建分类\t251\n10.1.4  更新分类\t256\n10.1.5  删除分类\t257\n10.2  管理用户\t258\n10.2.1  后台用户首页\t258\n10.2.2  添加用户\t260\n10.2.3  更新用户\t268\n10.2.4  删除用户\t270\n10.2.5  用户信息页面\t271\n10.3  文章和页面的管理\t274\n10.3.1  文章列表\t275\n10.3.2  添加文章\t276\n10.3.3  编辑文章\t281\n10.3.4  删除文章\t282\n10.3.5  构建条件过滤表单\t283\n10.4  管理论坛\t288\n10.4.1  后台论坛模型\t288\n10.4.2  论坛分区\t292\n10.4.3  移动论坛分区位置\t295\n10.4.4  论坛板块\t298\n10.5  用自定义视图助手实现RSS调用\t299\n10.6  本章小结\t303\n第11章  用户认证、授权和管理\t304\n11.1  认识Zend_Acl组件\t305\n11.2  理解基本概念\t306\n11.2.1  开发Acl插件\t309\n11.2.2  在配置文件中开启插件\t313\n11.3  本章小结\t313\n第12章  网站的优化和部署\t314\n12.1  性能测试\t314\n12.2  使用Zend_Db_Profiler了解数据库查询情况\t320\n12.3  使用Zend_Cache缓存数据\t322\n12.3.1  Zend_Cache缓存原理\t323\n12.3.2  配置文件\t323\n12.4  服务器空间的选择\t324\n12.5  Zend Framework在服务器上的安装\t325\n12.6  重新修改配置文件\t326\n12.7  本章小结\t326\n附录A  Zend Framework的组件索引\t328",
      pages: "330",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s11095751.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s11095751.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s11095751.jpg"
      },
      alt: "https://book.douban.com/subject/10829513/",
      id: "10829513",
      publisher: "电子工业",
      isbn10: "7121171279",
      isbn13: "9787121171277",
      title: "诗意的边缘",
      url: "https://api.douban.com/v2/book/10829513",
      alt_title: "",
      author_intro:
        "欧雪冰，网名unity，目前在一所职业学讲授PHP课程，并在一些大学开展针对毕业大学生的技术培训，在学校他创办了一个工作室，带领学生进行实际项目的开发工作。在此之前，他做过书店店员、杂志编辑、IT经理，更多的时间是作为一名自由职业者，从事写作和艺术活动，涉足领域包括诗歌、小说、剧本、独立电影和数字艺术、观念艺术等。由于对计算机和互联网的痴迷，他花费了很多时间和精力钻研各种IT技术，后来PHP语言逐渐成为他的最爱，用它设计、开发了多个网站程序。\n他对科学技术和人文知识都怀有浓厚兴趣，认为现行教育的分学科分专业对人的学习潜能产生极大束缚，应该打破学科限制，用更有效的方式组织和传授知识，让人在知识领域自由邀翔。他是一名巴哈伊信仰者，开源运动和开放课程计划的坚实拥护者，主张以“人类一体，天下一家”的视野构建知识框架，推动世界文明的演进。\n现在，他正专注于一个名为CloudBody的科幻主题协同创作平台的开发和推广，希望对青少年教育、流行文化传播、文学艺术创作产生影响，感兴趣的朋友可以通过邮件与他联系：unityoxb@gmail.com",
      summary:
        "本书适合有一定PHP基础和开发网站经验的读者学习，以进一步提高网络应用程序的开发效率。Zend Framework是PHP官方推出的重量级框架，拥有强大的功能和稳健的性能，因为完全采用面向对象思想和模式构建，所以相对于仅熟悉面向过程开发的PHP程序员来说显得比较难。本书通过一个完整的网络应用实例，带领读者轻松愉快地掌握该框架。\n这不是一本关于诗歌的书，虽然名字叫《诗意的边缘》，但网络程序开发的诗意依托于程序代码，如果说本书除了讲解技术之外，还有一点“文学性”的话，那么这种“文学性”离开程序开发的过程，显得累赘、造作而枯燥，并无可读性。\n这是一本Zend Framework的入门级实例教程，但不是PHP的，如果你没有学过PHP，不曾了解过面向对象编程，这本书对你来说可能会有点难——Zend Framework入门时的学习曲线陡峭是出了名的。但是，也有一种可能：本书也可能适合一些开发经验不多，但却有着使用各类开源程序来搭建网站的丰富经验的使用者，如果他们想进入开发领域，那么读这本书可能是一条捷径，他们可以绕过PHP面向过程的编码方式，直接从面向对象入手——我这么说可能会引起争议，因为在很多过来人看来，学好面向过程的原生代码是基本功课，这之后才能开始步入面向对象和框架的领域——我觉得凡事没有绝对，PHP也在进化之中，我编写这本书的主要目的，就是希望一些刚开始接触网站开发的读者能够以面向对象的框架为起点，比较顺利地步入网站开发的行程。如果你是这样的一个新手，本书的过程讲解细致周全，学习起来不会太吃力，然而可能会有一部分内容对你来说显得比较难，需要你以很大的耐心去泡Google、百度，做一些补习功课。\n如果你胸怀大志，但既没有学过任何计算机语言，也没有接触过做网站这件事，那么这本书对你来说就很困难了，建议你还是从一些更为基础的书籍着手学习，如可以先学习HTML，并尝试多了解一些PHP的开源程序和PHP的基础知识，对网络编程具备一定的了解之后，再来学习这本书。",
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 13,
        average: "8.5",
        min: 0
      },
      subtitle: "深入浅出PHP ＆ MySQL",
      author: [],
      pubdate: "2010-06-01",
      tags: [
        {
          count: 10,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 6,
          name: "mysql",
          title: "mysql"
        },
        {
          count: 4,
          name: "数据库",
          title: "数据库"
        },
        {
          count: 3,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 2,
          name: "HeadFirst",
          title: "HeadFirst"
        },
        {
          count: 1,
          name: "网页设计",
          title: "网页设计"
        },
        {
          count: 1,
          name: "产品经理",
          title: "产品经理"
        },
        {
          count: 1,
          name: "MySQL",
          title: "MySQL"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s6243500.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "774",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6243500.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6243500.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6243500.jpg"
      },
      alt: "https://book.douban.com/subject/5337332/",
      id: "5337332",
      publisher: "",
      isbn10: "7564122668",
      isbn13: "9787564122669",
      title: "深入浅出PHP & MySQL",
      url: "https://api.douban.com/v2/book/5337332",
      alt_title: "",
      author_intro: "",
      summary:
        "深入浅出PHP&MySQL（影印版），ISBN：9787564122669，作者：（美）贝伊利，（美）莫里森 著",
      price: "98.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 6,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP 5",
      author: ["David Sklar"],
      pubdate: "July, 2004",
      tags: [
        {
          count: 12,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 6,
          name: "web",
          title: "web"
        },
        {
          count: 5,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 3,
          name: "程序",
          title: "程序"
        },
        {
          count: 3,
          name: "web技术",
          title: "web技术"
        },
        {
          count: 2,
          name: "技术",
          title: "技术"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "正在读,有点儿晕",
          title: "正在读,有点儿晕"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4245081.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "368",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4245081.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4245081.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4245081.jpg"
      },
      alt: "https://book.douban.com/subject/1428049/",
      id: "1428049",
      publisher: "O'Reilly",
      isbn10: "0596005601",
      isbn13: "9780596005603",
      title: "Learning PHP 5",
      url: "https://api.douban.com/v2/book/1428049",
      alt_title: "",
      author_intro: "",
      summary:
        "Learning PHP 5 is the ideal tutorial for graphic designers, bloggers, and other web crafters who want a thorough but non-intimidating way to understand the code that makes web sites dynamic. The book begins with an introduction to PHP, then moves to more advanced features: language basics, arrays and functions, web forms, connecting to databases, and much more. Complete with exercises to make sure the lessons stick, this book offers the ideal classroom learning experience whether you're in a classroom or on your own.",
      price: "$29.95"
    },
    {
      rating: {
        max: 10,
        numRaters: 143,
        average: "7.8",
        min: 0
      },
      subtitle: "",
      author: ["列旭松，陈文"],
      pubdate: "2013-1-1",
      tags: [
        {
          count: 269,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 80,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 60,
          name: "核心技术",
          title: "核心技术"
        },
        {
          count: 46,
          name: "编程",
          title: "编程"
        },
        {
          count: 35,
          name: "性能优化",
          title: "性能优化"
        },
        {
          count: 33,
          name: "php",
          title: "php"
        },
        {
          count: 29,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 27,
          name: "互联网",
          title: "互联网"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s27276430.jpg",
      binding: "平装",
      translator: [],
      catalog:
        "前言\n第1章　面向对象思想的核心概念\n1.1　面向对象的“形”与“本”\n1.1.1　对象的“形”\n1.1.2　对象的“本”\n1.1.3　对象与数组\n1.1.4　对象与类\n1.2　魔术方法的应用\n1.2.1　set和get方法\n1.2.2　call和callStatic方法\n1.2.3　toString方法\n1.3　继承与多态\n1.3.1　类的组合与继承\n1.3.2　各种语言中的多态\n1.4　面向接口编程\n1.4.1　接口的作用\n1.4.2　对PHP接口的思考\n1.5　反射\n1.5.1　如何使用反射API\n1.5.2　反射有什么作用\n1.6　异常和错误处理\n1.6.1　如何使用异常处理机制\n1.6.2　怎样看PHP的异常\n1.6.3　PHP中的错误级别\n1.6.4　PHP中的错误处理机制\n1.7　本章小结\n第2章　面向对象的设计原则\n2.1　面向对象设计的五大原则\n2.1.1　单一职责原则\n2.1.2　接口隔离原则\n2.1.3　开放-封闭原则\n2.1.4　替换原则\n2.1.5　依赖倒置原则\n2.2　一个面向对象留言本的实例\n2.3　面向对象的思考\n2.4　本章小结\n第3章　正则表达式基础与应用\n3.1　认识正则表达式\n3.1.1　PHP中的正则函数\n3.1.2　正则表达式的组成\n3.1.3　测试工具的使用\n3.2　正则表达式中的元字符\n3.2.1　什么是元字符\n3.2.2　起始和结束元字符\n3.2.3　点号\n3.2.4　量词\n3.3　正则表达式匹配规则\n3.3.1　字符组\n3.3.2　转义\n3.3.3　反义\n3.3.4　分支\n3.3.5　分组\n3.3.6　反向引用\n3.3.7　环视\n3.3.8　贪婪懒惰匹配模式\n3.4　构造正则表达式\n3.4.1　正则表达式的逻辑关系\n3.4.2　运算符优先级\n3.4.3　正则表达式的常用模式\n3.5　正则在实际开发中的应用\n3.5.1　移动手机校验\n3.5.2　匹配E-mail地址\n3.5.3　转义在数据安全中的应用\n3.5.4　URL重写与搜索引擎优化\n3.5.5　删除文件中的空行和注释\n3.6　正则表达式的效率与优化\n3.7　本章小结\n第4章　PHP网络技术及应用\n4.1　HTTP协议详解\n4.1.1　HTTP协议与SPDY协议\n4.1.2　HTTP协议如何工作\n4.1.3　HTTP应用：模拟灌水机器人\n4.1.4　垃圾信息防御措施\n4.2　抓包工具\n4.2.1　抓包工具分类\n4.2.2　Fiddler功能与原理\n4.2.3　安装Fiddler\n4.2.4　Fiddler基本界面\n4.2.5　使用Fiddler进行HTTP断点调试\n4.3　Socket进程通信机制及应用\n4.3.1　进程通信相关概念\n4.3.2　Socket演示：实现服务器端与客户端的交互\n4.3.3　Socket函数原型\n4.3.4　PHP中的Socket函数\n4.3.5　Socket交互应用：使用Socket抓取数据\n4.4　cURL工具及应用\n4.4.1　建立cURL请求的基本步骤\n4.4.2　检查cURL错误和获取返回信息\n4.4.3　在cURL中伪造头信息\n4.4.4　在cURL中用POST方法发送数据\n4.4.5　使用cURL上传文件\n4.4.6　cURL批处理\n4.4.7　cURL设置项\n4.4.8　网络应用：使用cURL抓取腾讯微博\n4.5　简单邮件传输协议SMTP\n4.5.1　SMTP协议如何工作\n4.5.2　SMTP协议常用命令\n4.5.3　SMTP协议应用：使用Socket发送邮件\n4.6　WebService的前世今生\n4.6.1　WebService简介\n4.6.2　认识PHPRPC协议\n4.6.3　Web服务的实现模式\n4.6.4　简单对象访问协议SOAP\n4.6.5　调试工具soapUI\n4.7　Cookie详解\n4.7.1　Cookie的基本概念及设置\n4.7.2　PHP和JavaScript对Cookie的操作\n4.7.3　Cookie存储机制及应用\n4.7.4　Cookie跨域与P3P协议\n4.7.5　本地存储localStorage\n4.8　Session详解\n4.8.1　Session的基本概念及设置\n4.8.2　Session的工作原理\n4.8.3　Session入库\n4.8.4　Cookie与Session问答\n4.9　本章小结\n第5章　PHP与数据库基础\n5.1　什么是PDO\n5.1.1　PDO预定义类\n5.1.2　如何使用PDO\n5.1.3　PDO参数绑定与预编译\n5.1.4　PDO事务处理\n5.1.5　PDO的效率问题\n5.2　数据库应用优化\n5.2.1　基本语句优化10个原则\n5.2.2　索引与性能分析\n5.2.3　服务器和配置的优化\n5.2.4　MySQL瓶颈及应对措施\n5.3　数据库设计\n5.3.1　范式与反范式\n5.3.2　数据库分区\n5.3.3　分表的应用\n5.4　MySQL的高级应用\n5.4.1　MySQL自增长序列\n5.4.2　MySQL视图\n5.4.3　MySQL存储过程和事件调度\n5.4.4　用MySQL模拟消息队列\n5.4.5　SQL注入漏洞与防范\n5.5　本章小结\n第6章　PHP模板引擎的原理与实践\n6.1　代码分层的思想\n6.2　实现一个简单的模板引擎骨架\n6.2.1　搭建模板引擎基础类骨架\n6.2.2　编译类骨架\n6.2.3　测试模板引擎\n6.3　模板引擎的编译\n6.3.1　实现变量标签\n6.3.2　实现foreach标签\n6.3.3　实现if…else标签\n6.3.4　对PHP原生语法的支持\n6.4　完善模板引擎\n6.4.1　模板缓存机制的实现\n6.4.2　调试和缓存清理\n6.4.3　如何使用模板\n6.5　常用模板引擎\n6.5.1　Discuz模板引擎\n6.5.2　Smarty模板引擎\n6.5.3　DedeCms模板引擎\n6.5.4　Blitz模板引擎\n6.5.5　模板引擎的一些思考\n6.6　本章小结\n第7章　PHP扩展开发\n7.1　为什么要开发PHP扩展\n7.2　搭建PHP扩展框架\n7.2.1　PHP源代码目录\n7.2.2　ext_skel工具\n7.2.3　Windows平台环境配置\n7.2.4　Linux平台环境配置\n7.2.5　PHP的生命周期\n7.3　PHP内核中的变量\n7.3.1　PHP变量在内核中的存储方式\n7.3.2　PHP内核变量访问宏\n7.3.3　引用计数器与写时复制\n7.4　PHP内核中的HashTable分析\n7.4.1　PHP内核HashTable的数据结构\n7.4.2　HashTable的代码实现\n7.5　Zend API详解与扩展编写\n7.5.1　什么是Zend引擎\n7.5.2　Zend引擎内存管理\n7.5.3　PHP扩展的架构\n7.5.4　接收用户传递的参数\n7.5.5　在PHP扩展中创建变量\n7.5.6　在PHP扩展中为变量赋值\n7.5.7　错误和输出API\n7.5.8　运行时信息函数\n7.5.9　调用用户自定义函数\n7.5.10　PHP配置项\n7.5.11　创建常量的宏\n7.6　编写一个完整的扩展\n7.6.1　链表结构的实现\n7.6.2　创建PHP扩展框架\n7.6.3　编写代码\n7.6.4　编译安装扩展\n7.6.5　测试扩展\n7.7　本章小结\n第8章　缓存详解\n8.1　认识缓存\n8.1.1　为什么使用缓存\n8.1.2　命中率\n8.1.3　缓存更新策略\n8.1.4　缓存最大数据量\n8.2　文件缓存\n8.2.1　文件缓存机制\n8.2.2　文件缓存开源产品Secache\n8.3　Opcode缓存\n8.3.1　eAccelerator下载及使用\n8.3.2　如何查看Opcode\n8.4　客户端缓存\n8.4.1　客户端缓存规则\n8.4.2　HTTP协议中的缓存使用\n8.4.3　HTTP缓存实例\n8.4.4　HTML 5中的Application Cache\n8.5　Web服务器缓存\n8.5.1　Apache缓存\n8.5.2　Nginx缓存\n8.6　本章小结\n第9章　Memcached使用与实践\n9.1　为什么要用Memcached\n9.2　Memcached的安装及使用\n9.2.1　安装Memcached服务器\n9.2.2　安装Memcached客户端\n9.2.3　使用memcache扩展访问Memcached服务器\n9.2.4　使用Memcached加速Web应用\n9.3　深入了解Memcached\n9.3.1　Memcached如何支持高并发\n9.3.2　使用Slab分配算法保存数据\n9.3.3　删除过期item\n9.3.4　使用LRU算法淘汰数据\n9.3.5　Memcached多线程模型\n9.4　Memcached分布式布置方案\n9.4.1　普通Hash分布\n9.4.2　一致性Hash分布\n9.4.3　一致性Hash分布算法实例\n9.5　本章小结\n第10章　Redis使用与实践\n10.1　Redis的安装及使用\n10.1.1　Redis安装步骤\n10.1.2　修改Redis配置文件\n10.1.3　运行Redis服务器\n10.1.4　key相关命令\n10.1.5　Redis支持的数据类型\n10.1.6　Redis排序命令详解\n10.2　事务处理\n10.2.1　事务处理原理\n10.2.2　事务处理实现\n10.3　持久化\n10.3.1　内存快照\n10.3.2　日志追加\n10.4　主从同步\n10.4.1　Redis主从同步原理\n10.4.2　Slave端的工作流程\n10.4.3　Master端的工作流程\n10.5　虚拟内存\n10.5.1　配置文件信息\n10.5.2　开启VM的后台操作\n10.5.3　Redis Object和VM Pointer\n10.5.4　交换过程\n10.5.5　阻塞式VM\n10.5.6　非阻塞式VM\n10.6　扩展库phpredis安装及使用\n10.7　Redis应用实践\n10.7.1　使用消息队列发布微博\n10.7.2　Redis替代文件存储Session\n10.8　深入了解Redis内核\n10.8.1　内存淘汰\n10.8.2　对象引用计数器\n10.8.3　自动关闭超时连接\n10.8.4　清除过期数据\n10.9　本章小结\n第11章　高性能网站架构方案\n11.1　如何优化网站响应时间\n11.1.1　吞吐率\n11.1.2　压力测试\n11.1.3　持久连接\n11.2　MySQL响应速度提高方案：HandlerSocket\n11.2.1　HandlerSocket工作原理\n11.2.2　HandlerSocket安装和配置\n11.2.3　PHP-HandlerSocket性能测试\n11.3　MySQL稳定性提高方案：主从复制\n11.3.1　主从复制工作原理\n11.3.2　主从复制配置\n11.3.3　连接主从服务器\n11.4　Web应用加速方案：Varnish\n11.4.1　传统代理与反向代理\n11.4.2　Varnish安装和配置\n11.4.3　Varnish性能测试\n11.4.4　修改缓存规则\n11.4.5　监控Varnish运行状态\n11.5　异步计算方案：Gearman\n11.5.1　Gearman工作原理\n11.5.2　安装Gearman和PHP扩展\n11.5.3　使用Gearman异步发送邮件\n11.6　本章小结\n第12章　代码调试和测试\n12.1　调试PHP代码\n12.1.1　PHP调试函数\n12.1.2　断点调试与变量跟踪工具Xdebug\n12.2　前端调试\n12.2.1　Firebug调试API\n12.2.2　使用Firebug调试DOM结构\n12.2.3　使用Firebug调试JavaScript\n12.2.4　使用Fiddler调试远程服务器上的文件\n12.3　日志管理\n12.3.1　PHP日志\n12.3.2　Apache服务器日志\n12.3.3　MySQL日志\n12.4　代码性能测试技术\n12.4.1　时间点测试\n12.4.2　文件查看工具WinCacheGrind\n12.4.3　性能测试注意事项\n12.5　单元测试\n12.5.1　单元测试框架PHPUnit的安装\n12.5.2　结合NetBeans使用PHPUnit进行单元测试\n12.5.3　PHPUnit中的断言函数\n12.5.4　PHPUnit常用方法\n12.5.5　PHPUnit常用注解\n12.6　压力测试\n12.6.1　使用JMeter压力测试HTTP\n12.6.2　压力测试MySQL\n12.6.3　JMeter+Badboy组合测试\n12.7　本章小结\n第13章　Hash算法与数据库实现\n13.1　Hash函数\n13.2　Hash算法\n13.2.1　直接取余法\n13.2.2　乘积取整法\n13.2.3　经典Hash算法Times33\n13.3　Hash表\n13.3.1　Hash表结构\n13.3.2　使用PHP实现Hash表\n13.3.3　Hash表冲突\n13.3.4　拉链法解决冲突\n13.4　一个小型数据库的实现\n13.4.1　pack函数的用法\n13.4.2　unpack函数的用法\n13.4.3　索引文件和数据文件\n13.4.4　数据库接口方法\n13.4.5　源代码解析\n13.4.6　测试代码\n13.5　本章小结\n第14章　PHP编码规范\n14.1　文件格式\n14.1.1　文件标记\n14.1.2　文件和目录命名\n14.1.3　文件目录结构\n14.2　命名规范\n14.2.1　变量命名\n14.2.2　类及接口命名\n14.2.3　数据库命名\n14.2.4　习惯与约定\n14.3　注释规范\n14.3.1　程序注释\n14.3.2　文件注释\n14.3.3　类接口注释\n14.3.4　方法和函数注释\n14.3.5　标注的使用\n14.4　代码风格\n14.4.1　缩进和空格\n14.4.2　语句断行\n14.4.3　更好的习惯\n14.5　本章小结",
      ebook_url: "https://read.douban.com/ebook/15166496/",
      pages: "522",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s27276430.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s27276430.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s27276430.jpg"
      },
      alt: "https://book.douban.com/subject/20370984/",
      id: "20370984",
      publisher: "机械工业出版社",
      isbn10: "7111401921",
      isbn13: "9787111401926",
      title: "PHP核心技术与最佳实践",
      url: "https://api.douban.com/v2/book/20370984",
      alt_title: "",
      author_intro:
        "列旭松，资深PHP技术工程师，精通PHP及其相关技术，对PHP内核原理有较深入的理解，开发经验丰富。曾自主开发了关键字匹配服务器和消息队列SquirrelMQ。平时喜欢开发一些实用的PHP扩展，如PHP字典扩展（红黑树算法）和PHP索引扩展（B+树算法）。精通C语言，同时对Web服务器的架构和优化、高并发服务端编程、Redis和Memcached等技术有深入的研究和认识。活跃于PHPChina和ChinaUnix等专业社区，担任PHPChina论坛内核版块版主。\n陈文，资深PHP技术工程师，精通PHP及其相关技术，尤其擅长于PHP框架开发和应用架构。他还是一位资深的Java开发工程师，具有Fortran、Scala和C++语言的开发和使用背景，在传统软件和互联网开发领域都有丰富的实战经验。此外，他还擅长TCP/IP编程、多线程与并发程序设计、网络协议分析、数据库性能优化以及各种缓存技术，熟悉MySQL和Oracle等关系数据库产品。现从事网络安全软件开发，以及移动SI业务开发。对语言特性和软件设计思想有独到的见解，追求代码之美和高效率程序开发，爱好钻研底层技术，崇尚和提倡“以理论指导实践”。尤其爱好数学，认为数学是培养和锻炼思维和逻辑能力的重要工具，对算法有一定研究。长期活跃在PHPChina、ITeye和看雪论坛等社区，在PHPChina社区担任版主。",
      summary:
        "《PHP核心技术与最佳实践》是一本致力于为希望成为中高级PHP程序员的读者提供高效而有针对性指导的经典著作。系统归纳和深刻解读了PHP开发中的编程思想、底层原理、核心技术、开发技巧、编码规范和最佳实践。全书分为5个部分：第一部分（1～2章）从不同的角度阐述了面向对象软件设计思想的核心概念、技术和原则，分析了面向对象的特性、设计模式的理念，指出了如何设计低耦合、高可扩展性的软件，等等；第二部分（3～6章）详细讲解了PHP中正则表达式的规范和使用技巧，PHP网络编程的原理、方法、技巧和一些重要的操作，PDO、数据库应用优化，数据库设计和MySQL的高级应用，PHP扩展引擎的原理与实践；第三部分（第7章）拨云见日，围绕PHP扩展开发进行了细致而深入的探讨，解析了PHP的底层实现和Zend虚拟机API，并用PHP扩展开发的实例带领读者走进PHP的底层世界，旨在让读者对PHP性能优化、底层原理进行深入的理解。第四部分（8～11章）重点讨论了缓存的设计、Memcached的原理与实践、NoSQL数据库Redis源码分析与应用实践、高性能PHP网站的架构和设计等内容；第五部分（12～14章）详细讲解了PHP代码的调试和测试、Hash算法和数据库的实现，以及PHP的编码规范，旨在帮助读者提高开发效率，养成良好编程习惯。",
      ebook_price: "30.00",
      price: "89.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 62,
        average: "7.9",
        min: 0
      },
      subtitle: "",
      author: ["（美）斯克拉", "（美）切贝特伯格"],
      pubdate: "2009-10-01",
      tags: [
        {
          count: 123,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 40,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 34,
          name: "编程",
          title: "编程"
        },
        {
          count: 26,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 15,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 15,
          name: "Web",
          title: "Web"
        },
        {
          count: 11,
          name: "软件工程",
          title: "软件工程"
        },
        {
          count: 11,
          name: "计算机语言",
          title: "计算机语言"
        }
      ],
      origin_title: "PHP Cookbook, 2nd Ed",
      image: "https://img3.doubanio.com/view/subject/m/public/s4048154.jpg",
      binding: "",
      translator: ["李松峰", "秦绪文", "李丽"],
      catalog:
        "前言\n第1章 字符串\n1.0 概述\n1.1 访问子字符串\n1.2 提取子字符串\n1.3 替换子字符串\n1.4 逐字节处理字符串\n1.5 按字或按字节来反转字符串\n1.6 扩展和压缩制表符\n1.7 控制大小写\n1.8 在字符串中插入函数和表达式\n1.9 删除字符串两端的空白符\n1.10 生成逗号分隔的数据\n1.11 解析逗号分隔的数据\n1.12生成宇段宽度固定的数据记录\n1.13 解析宇段宽度固定的数据记录\n1.14 分离字符串\n1.15 使文本在特定长度处自动换行\n1.16 在字符串中存储二进制数据\n1.17 编程：可下载的csv文件\n第2章 数字\n2.0 概述\n2.1 检查变量中是否包含有效的数字\n2.2 比较浮点型数字\n2.3 对浮点型数取整\n2.4 操纵一系列连续的整数\n2.5 在一个范围内生成随机数\n2.6 生成有偏随机数\n2.7 取对数\n2.8 计算指数\n2.9 格式化数字\n2.10 格式化货币值\n2.11 正确地打印复数\n2.12 计算三角函数\n2.13 用度数而不是弧度来度量三角\n2.14 处理极大数或极小数\n2.15 在不同进制间转换\n2.16 非十进制数的计算\n2.17 计算球面坐标系中两点间的距离\n第3章 日期和时间\n3.0 概述\n3.1 查出当前的日期和时间\n3.2 将时间和日期部件转换为纪元时间戳\n3.3 将纪元时间戳转换为时间和日期部件\n3.4 以特定的格式打印日期和时间\n3.5 计算两个日期间的时间差\n3.6 用儒略日计算两个日期间的时间差\n3.7 找到周、月或者年中的某一天\n3.8 验证日期\n3.9 从字符串中解析日期和时间\n3.10 对日期进行加、减运算\n3.11 根据时区计算时间\n3.12 处理夏令时\n3.13 生成高精度的时间\n3.14 生成时间范围\n3.15 使用非公历纪年\n3.16 使用纪元时间戳范围之外的日期\n3.17 编程：日历\n第4章 数组\n4.0 概述\n4.1 定义一个起始元素不为零的数组\n4.2 用数组中的一个键保存多个元素\n4.3 用一个整数范围来初始化数组\n4.4 遍历数组\n4.5 从数组中删除元素\n4.6 改变数组大小\n4.7 将一个数组追加到另一个数组\n4.8 把数组转换成字符串\n4.9 使用逗号来打印数组\n4.10 检查数组中是否存在某个键\n4.11 检查数组中是否包含某个元素\n4.12 确定值在数组中的位置\n4.13 确定通过某种测试的元素\n4.14 确定数组中经计算后的最大或最小元素\n4.15 反转数组\n4.16 数组排序\n4.17 根据可计算的字段对数组进行排序\n4.18 对多个数组进行排序\n4.19 使用方法而不是函数来对数组进行排序\n4.20 对数组进行随机化处理\n4.21 删除数组中重复的元素\n4.22 对数组中的每个元素都应用一个函数\n4.23 计算两个数组的并集、交集和差集\n4.24 创建一个类数组对象\n4.25 编程：输出水平居中的HTML表格\n第5章 变量\n5.0 概述\n5.1 消除==和=的困扰\n5.2 为变量设定默认值\n5.3 不使用临时变量而实现变量值的交换\n5.4 动态创建变量名\n5.5 使用静态变量\n5.6 在进程间共享变量\n5.7 把复杂的数据类型压缩到一个字符串中\n5.8 将变量内容转存为字符串\n第6章 函数\n6.0 概述\n6.1 访问函数的参数\n6.2 为函数的参数设定默认值\n6.3 传递引用\n6.4 使用命名的参数\n6.5 创建可以接受个数可变的参数的函数\n6.6 返回变量的引用\n6.7 返回多个值\n6.8 跳跃选择返回的值\n6.9 返回失败信息\n6.10 调用可变函数\n6.11 在函数内部访问全局变量\n6.12 创建动态函数\n第7章 类和对象\n7.0 概述\n7.1 技巧化对象\n……\n第8章 Web基础\n第9章 表单\n第10章 访问数据库\n第11章 Session和数据保持\n第12章 XML\n第13章 Web自动化\n第14章 消费Web服务\n第15章 建立Web服务\n第16章 互联网服务\n第17章 图形\n第18章 安全和加密\n第19章 国际化和本地化\n第20章 错误处理，故障排除和测试\n第21章 性能调谐和负载测试\n第22章 正则表达式\n第23章 文件\n第24章 目录\n第25章 命令行PHP\n第26章 PEAR和PECL",
      pages: "816",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4048154.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4048154.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4048154.jpg"
      },
      alt: "https://book.douban.com/subject/4099306/",
      id: "4099306",
      publisher: "中国电力出版社",
      isbn10: "7508386086",
      isbn13: "9787508386089",
      title: "PHP经典实例",
      url: "https://api.douban.com/v2/book/4099306",
      alt_title: "PHP Cookbook, 2nd Ed",
      author_intro:
        "DaVid Sklar是Ning的一名软件开发人员。在1996年发现PHP能够满足他编写Web编程需要的时候，他创建了PX，这是一个可以让PHP用户交换程序的场所。此外，他还是《Learning PHP5》（O’Reilly）和《Essential PHP Tools》（Apress）的作者。\nAdam Trachtenberg是eBay的一名技术讲师，也是《upgrading to PHP5》（O’Reilly）的作者。他经常会在O’Reilly conference和LinuxWor’1d上发表演讲。他还拥有哥伦比亚大学商学院的MBA学位。",
      summary:
        "PHP经典实例（第2版）能够为您节省宝贵的Web开发时间。有了这些针对真实问题的解决方案放在手边，大多数编程难题都会迎刃而解。《PHP经典实例(第2版)》将PHP的特性与经典实例丛书的独特形式组合到一起，足以帮您成功地构建跨浏览器的Web应用程序。在这个修订版中，您可以更加方便地找到各种编程问题的解决方案，《PHP经典实例(第2版)》中内容涵盖了：表单处理；Session管理；数据库交互；使用Web服务。\n从初学者常见的问题到高级Web编程技术，这本包含了丰富的、具有实际应用价值的实例图书，可以满足使用PHP生成动态web内容的任何人的需要。书中的每个实例都细致地讨论了所提供解决方案背后的逻辑和思想，用源自PHP专家的洞察力帮你轻松地掌握这门语言。书中更新了PItP5的有关内容，并详细地解释了如何使用新增的语言特性，比如面向对象能力的巨大改进和新的PD0数据访问扩展等。书中特别增加了有关类和对象的部分，包含了以下基本内容：处理XM；与JavaScript交互；用PHP构建Web服务；使用SOAP和REST架构。\n《PHP经典实例（第2版）》中超过250个实例，为你每天都要面对的诸多问题提供了足够丰富的解决方案。而且，每个实例的讨论部分都浸透着对每个PHP开发人员极为有益的理念。",
      price: "98.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 99,
        average: "7.6",
        min: 0
      },
      subtitle: "",
      author: ["(美)古曼兹等"],
      pubdate: "2007-12-01",
      tags: [
        {
          count: 101,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 34,
          name: "编程",
          title: "编程"
        },
        {
          count: 21,
          name: "web",
          title: "web"
        },
        {
          count: 20,
          name: "PHP5",
          title: "PHP5"
        },
        {
          count: 15,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 15,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 11,
          name: "LAMP",
          title: "LAMP"
        },
        {
          count: 8,
          name: "技术",
          title: "技术"
        }
      ],
      origin_title: "PHP 5 Power Programming",
      image: "https://img1.doubanio.com/view/subject/m/public/s5860028.jpg",
      binding: "",
      translator: ["简张桂"],
      catalog:
        "第1章 PHP 5新特性\n第2章 PHP 5基础语言\n第3章 PHP 5面向对象语言\n第4章 PHP 5高级面向对象编程和设计模式\n第5章 如何用PHP写一个Web应用\n第6章 使用PHP 5访问数据库\n第7章 错误处理\n第8章 PHP 5中处理XML\n第9章 主流扩展\n第10章 使用PEAR\n第11章 重要的PEAR包\n第12章 创建PEAR的组件\n第13章 迁移\n第14章 性能\n第15章 一个编写PHP扩展的介绍\n第16章 PHP Shell 脚本编程\n附录A PEAR和PECL包索引\n附录B phpDocumentor格式参考\n附录C Zend Studio快速使用说明\n索引",
      pages: "689",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s5860028.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s5860028.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s5860028.jpg"
      },
      alt: "https://book.douban.com/subject/2981954/",
      id: "2981954",
      publisher: "电子工业出版社",
      isbn10: "7121050781",
      isbn13: "9787121050787",
      title: "PHP 5权威编程",
      url: "https://api.douban.com/v2/book/2981954",
      alt_title: "PHP 5 Power Programming",
      author_intro:
        "古曼兹，参与创造了PHP 3和此后所有版本。作为PHP核心团队的一个成员，他是全世界最受尊敬的PHP开发者之一。\n    贝肯，也是PHP核心团队的一位成员，创造了PEAR——PHP扩展和应用库。PEAR是为可复用PHP组件而开发的框架和全球的发布系统。\n\n    瑞桑斯|，是一位开源爱好者、开发者和顾问，他的软件是大多数商业嵌入式Linux提供商的主要组件。他建立了或者说参与建立了Linux的标准基础、开源协会，以及人们常用的软件。作为DebianGNU/Linux项目的领导者，他致力于该系统在美国的两个空间往返飞行项目中的应用。",
      summary:
        "《BRUCE PERENS开源系列丛书•PHP 5权威编程》为大家全面介绍了PHP 5中的新功能、面向对象编程方法及设计模式，还分析阐述了PHP5中新的数据库连接处理、错误处理和XML处理等机制。希望能够帮助读者系统了解、熟练掌握PHP，最大程度地挖掘：PHP的潜力，以更低的成本搭建更加稳健、高效的PHP应用。\n近年来，随着使用PHP的大流量网站逐渐增加，企业在使用PHP的时候开始面临新的问题，代码的规范与维护就是其中比较突出的问题。另外，在PIIPfl勺速度满足业务需求后，人们对项目的稳健性、可升级性提出了新的要求。",
      price: "90.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 73,
        average: "8.4",
        min: 0
      },
      subtitle: "",
      author: ["厄尔曼"],
      pubdate: "2007-05-01",
      tags: [
        {
          count: 99,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 57,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 31,
          name: "PHP&MySQL",
          title: "PHP&MySQL"
        },
        {
          count: 18,
          name: "编程",
          title: "编程"
        },
        {
          count: 18,
          name: "PHP与MySQL基础教程(第2版)",
          title: "PHP与MySQL基础教程(第2版)"
        },
        {
          count: 17,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 16,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 13,
          name: "互联网",
          title: "互联网"
        }
      ],
      origin_title: "PHP and MySQL for Dynamic Web Sites, 2nd Ed",
      image: "https://img3.doubanio.com/view/subject/m/public/s26278810.jpg",
      binding: "",
      translator: ["陈宗斌"],
      catalog:
        "第1章　php概述.　1\n1.1　基本语法　1\n1.2　发送数据到web浏览器　4\n1.3　理解php、html和空白　6\n1.4　编写注释　9\n1.5　什么是变量　11\n1.6　关于字符串　14\n1.7　关于数字　18\n1.8　关于常量　21\n1.9　单引号与双引号　23\n第2章　php编程　26\n2.1　创建html表单　26\n2.2　处理html表单　29\n2.3　管理magic quotes　32\n2.4　条件语句和运算符　34\n2.5　验证表单数据　39\n2.6　什么是数组　43\n2.6.1　创建数组　46\n2.6.2　访问数组　47\n2.6.3　多维数组　50\n2.6.4　数组和字符串　55\n2.6.5　数组排序　57\n2.7　for和while循环　60\n第3章　创建动态web站点　64\n3.1　包含多个文件　64\n3.2　利用php的粘结能力处理html表单　72\n3.3　建立黏性表单　75\n3.4　创建和调用自己的函数　78\n3.4.1　创建带参数的函数　81\n3.4.2　设置默认的参数值　83\n3.4.3　从函数返回值　86\n3.5　变量作用域　88\n3.6　日期和时间函数　92\n3.7　发送电子邮件　96\n第4章　sql和mysql简介　102\n4.1　选择列类型　102\n4.2　选择其他的列属性　105\n4.3　使用mysql客户　107\n4.4　创建数据库和表　110\n4.5　插入记录　112\n4.6　选择数据　114\n4.7　使用条件语句　116\n4.8　使用like和not like　119\n4.9　对查询结果排序　120\n4.10　限制查询结果　121\n4.11　更新数据　123\n4.12　删除数据　124\n4.13　使用函数　126\n4.13.1　文本函数　126\n4.13.2　数字函数　128\n4.13.3　日期和时间函数　130\n4.13.4　格式化日期和时间　132\n第5章　高级sql和mysql　134\n5.1　数据库设计　134\n5.1.1　规范化　134\n5.1.2　键　135\n5.1.3　关系　136\n5.1.4　第一范式　137\n5.1.5　第二范式　139\n5.1.6　第三范式　140\n5.1.7　创建数据库　142\n5.2　执行联结　148\n5.3　对选择的结果进行分组　151\n5.4　创建索引　152\n5.5　使用不同的表类型　155\n5.6　执行fulltext查找　157\n5.6.1　创建fulltext索引　158\n5.6.2　执行基本的fulltext查找　159\n5.6.3　执行布尔型fulltext查找　160\n5.7　数据库优化　162\n5.7.1　优化数据库　163\n5.7.2　解释查询　164\n第6章　错误处理和调试　167\n6.1　常规错误类型和调试　167\n6.1.1　基本的调试步骤　168\n6.1.2　调试html　170\n6.2　显示php错误　172\n6.3　调整php中的错误报告　173\n6.4　创建自定义的错误处理程序　175\n6.5　记录php错误　179\n6.6　php调试技术　182\n6.7　sql和mysql调试技术　184\n6.7.1　调试sql问题　185\n6.7.2　调试访问问题　186\n第7章　使用php和mysql　187\n7.1　修改模板　187\n7.2　连接到mysql并选择数据库　188\n7.3　执行简单的查询　192\n7.4　检索查询结果　198\n7.5　确保sql安全　201\n7.6　统计返回的记录　206\n7.7　利用php更新记录　212\n第8章　web应用程序开发..　218\n8.1　针对服务器设置调整行为　218\n8.2　手动发送值给脚本　220\n8.3　使用隐藏的表单输入框　223\n8.4　编辑现有的记录　229\n8.5　给查询结果标页码　235\n8.6　建立可排序的显示结果　241\n8.7　理解http头　247\n第9章　cookie和会话　255\n9.1　使用cookie　255\n9.1.1　设置cookie　256\n9.1.2　访问cookie　261\n9.1.3　设置cookie参数　264\n9.1.4　删除cookie　267\n9.2　使用会话　270\n9.2.1　设置会话变量　271\n9.2.2　访问会话变量　274\n9.2.3　删除会话变量　277\n9.2.4　更改会话行为　279\n9.3　会话和cookie　284\n9.3.1　更改会话cookie设置　284\n9.3.2　使用不带cookie的会话　287\n9.4　提高会话安全性　290\n第10章　web应用程序安全性　295\n10.1　更安全的表单验证　295\n10.1.1　防止多次提交　295\n10.1.2　验证正确的表单　302\n10.2　处理html代码　305\n10.3　通过类型验证数据　308\n10.4　利用javascript进行表单验证　312\n10.5　正则表达式　318\n10.5.1　定义模式　318\n10.5.2　匹配模式　321\n10.5.3　匹配和替换模式　324\n10.6　数据库安全性和加密　327\n10.6.1　安全性惯例　327\n10.6.2　加密　328\n10.6.3　保障salt存储的安全　330\n第11章　扩展主题　333\n11.1　处理文件上载　333\n11.1.1　允许文件上载　333\n11.1.2　利用php上载文件　337\n11.2　php和javascript　342\n11.3　使用输出缓冲　350\n11.4　使用improved mysql extension　357\n11.5　mysql的新特性　361\n11.5.1　使用事务　361\n11.5.2　使用预处理语句　364\n11.6　使用pear　369\n第12章　示例——内容管理　374\n12.1　创建模板　374\n12.2　创建基本的页面　377\n12.3　管理url　381\n12.3.1　添加url　381\n12.3.2　查看提交的url　389\n12.3.3　编辑url　395\n12.4　管理文件　406\n12.4.1　上载文件　407\n12.4.2　查看和下载文件　411\n第13章　示例——用户注册　418\n13.1　创建模板　418\n13.2　编写配置脚本　422\n13.2.1　建立配置文件　422\n13.2.2　建立数据库脚本　424\n13.3　创建主页　427\n13.4　注册　430\n13.5　激活账户　437\n13.6　登录和注销　440\n13.7　密码管理　446\n13.7.1　重置密码　446\n13.7.2　更改密码　450\n第14章　示例——电子商务　456\n14.1　创建数据库　456\n14.2　管理端　460\n14.3　创建公共模板　473\n14.4　产品目录　476\n14.5　购物车　486\n14.5.1　添加项目　486\n14.5.2　查看购物车　489\n14.6　记录订单　495\n附录a (图灵网站下载)\n附录b (图灵网站下载)\n附录c (图灵网站下载)",
      pages: "499",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s26278810.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s26278810.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s26278810.jpg"
      },
      alt: "https://book.douban.com/subject/2109775/",
      id: "2109775",
      publisher: "人民邮电出版社",
      isbn10: "7115156875",
      isbn13: "9787115156877",
      title: "PHP与MySQL基础教程",
      url: "https://api.douban.com/v2/book/2109775",
      alt_title: "PHP and MySQL for Dynamic Web Sites, 2nd Ed",
      author_intro: "",
      summary:
        "《PHP与MySQL基础教程(第2版)》采用基于任务的方法来讲授PHP和MySQL，使用大量图片指导读者深入学习语言，并向读者展示了如何构造Web站点。用简洁、直观的步骤和讲解提供了学习任务和概念的最快方式。通过《PHP与MySQL基础教程(第2版)》，读者可以快速、高效地学习PHP和MySQL，并可以立刻成为一位构筑Web站点的高手！",
      series: {
        id: "28503",
        title: "图灵程序设计丛书·Web开发系列"
      },
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 6,
        average: "0.0",
        min: 0
      },
      subtitle: "基于HTML5 WebSocket、PHP和jQuery",
      author: ["Jason Lengstorf", "Phil Leggetter"],
      pubdate: "2013-10-01",
      tags: [
        {
          count: 7,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 6,
          name: "实时应用",
          title: "实时应用"
        },
        {
          count: 4,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "长连接技术",
          title: "长连接技术"
        },
        {
          count: 3,
          name: "php",
          title: "php"
        },
        {
          count: 3,
          name: "html5",
          title: "html5"
        },
        {
          count: 3,
          name: "[Web]",
          title: "[Web]"
        },
        {
          count: 2,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s27262769.jpg",
      binding: "平装",
      translator: ["肖智清"],
      catalog: "",
      pages: "288",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s27262769.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s27262769.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s27262769.jpg"
      },
      alt: "https://book.douban.com/subject/25733166/",
      id: "25733166",
      publisher: "机械工业出版社",
      isbn10: "711143983X",
      isbn13: "9787111439837",
      title: "构建实时Web应用：基于HTML5 WebSocket、PHP和jQuery",
      url: "https://api.douban.com/v2/book/25733166",
      alt_title: "",
      author_intro: "",
      summary:
        "实时web应用开发领域的经典著作，由实时web技术领域的布道者和资深web开发工程师撰写。不仅详细讲解了构建实时web应用所需的各项技术，还系统讲解了实时web应用规划与设计的的过程和方法，为构建实时web应用提供了翔实的指导。此外，《构建实时web应用：基于html5 websocket、php和jquery》包含大量代码和设计示例，实战性极强。\n全书一共10章：第1章介绍了什么是实时web技术及其原理；第2章详细讲解了构建实时web应用需要哪些技术和工具；第3章讲解了如何利用pusher构建实时web应用；第4章介绍了如何根据需要在web应用和原生应用之间做出选择；第5章讲解了如何规划应用程序的功能和结构；第6章讲解了实时web应用的设计，第7章讲解了如何为实时web应用创建html和css标记；第8章和第9章则非常详细地讲解了如何构建实时web应用的后端程序；第10章讲解了如何实现实时事件和jquery效果。",
      series: {
        id: "31205",
        title: "Web开发技术丛书"
      },
      price: "69"
    },
    {
      rating: {
        max: 10,
        numRaters: 54,
        average: "7.6",
        min: 0
      },
      subtitle: "",
      author: ["[澳] Hugh E.Williams", "David Lane"],
      pubdate: "2006-11-01",
      tags: [
        {
          count: 85,
          name: "php",
          title: "php"
        },
        {
          count: 50,
          name: "mysql",
          title: "mysql"
        },
        {
          count: 27,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 24,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 24,
          name: "Web",
          title: "Web"
        },
        {
          count: 16,
          name: "数据库",
          title: "数据库"
        },
        {
          count: 14,
          name: "编程",
          title: "编程"
        },
        {
          count: 8,
          name: "programming",
          title: "programming"
        }
      ],
      origin_title: "Web Database Applications with PHP & MySQL",
      image: "https://img1.doubanio.com/view/subject/m/public/s5793818.jpg",
      binding: "平装",
      translator: ["O’Reilly Taiwan 公司"],
      catalog:
        "前言\n第一章 数据库应用程序与web\nweb\n三层体系结构\n第二章 php脚本编程语言\nphp简介\n条件与分支\n循环\n函数\n类型\n用户自定义函数\nphp运作实例\n第三章 php的高级数据控制功能\n数组\n字符串\n正则表达式\n日期与时间\n整数与浮点数\n第四章php 5的面向对象编程\n类和对象\n.继承\n抛出与捕获异常\n第五章sql与mysql\n数据库基础\nmysql命令解释器\n管理数据库与表\n数据的插入、更新与删除\n使用sql的select进行查询\n联接查询\n案例分析：添加新葡萄酒\n第六章查询web数据库\n使用php查询mysql数据库\n处理用户输入的数据\n与mysql相关的函数\n第七章pea日包\npear概述\n核心组件\n可选包\n第八章 web数据库的写入\n数据库的插入、更新与删除\n写入数据至数据库的常见问题\n第九章 使用php与javascript的验证\n验证与错误报告的规则\n服务器端验证\nhava script与客户端验证\n第十章 会话(session)\nsession管理简介\nphp的session管理\n案例研究：在验证中使用session\n使用session的日寸机\nphp的session api与酉己置\n第十一章 认证与安全\nhttp认证\n利用php管理http认证\n基于表单的认证\n保护web上的数据\n第十二章 错误、调试与部署\n错误\n常见的编程错误\n自定义错误处理器\n第十三章 报表\n创建报表\n产生pdf文件\npdf-php参考数据\n第十四章 php 5面向对象程序设计的高级功能\n使用类层次\n类的类型提示\n抽象类与接口\n运费计算器范例\n第十五 章高级sql\n以show来探索\n高级查询\n操作数据与数据库\n函数\n自动查询\n表类型\n备份与恢复\n管理用户与权限\n调整mysql\n第十六章 案例研究：hugh and dave’s online wines\n功能与系统需求\n应用程序概述\n公用组件\n第十七章 管理客户\n程序代码概述\n客户验证\n客户表单\n第十八章 购物车\n程序代码概述\n葡萄酒商店首页\n购物车的实现\n第十九章 网上葡萄酒商店的订货与发货\n程序代码概述\n信用卡与发送指令\n确定订单\nhtml与电子邮件回执\n第二十章 在线葡萄酒商店的搜索与认证\n程序代码概述\n搜索与浏览\n认证\n附录一 linux安装指南\n附录二 microsoft windows安装指南\n附录三 mac os x安装指南\n附录四 网络协议\n附录五 关系数据库的建模与设计\n附录六 在数据库层管理session\n附录七 资源\n附录八 改进式mysql函数库\n索引",
      pages: "782",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s5793818.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s5793818.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s5793818.jpg"
      },
      alt: "https://book.douban.com/subject/1931540/",
      id: "1931540",
      publisher: "东南大学出版社",
      isbn10: "7564105771",
      isbn13: "9787564105778",
      title: "PHP & MySQL Web数据库应用开发指南",
      url: "https://api.douban.com/v2/book/1931540",
      alt_title: "Web Database Applications with PHP & MySQL",
      author_intro:
        "Hugh E.Williams是rmit大学（位于墨尔本）计算机科学与IT学校的副教授。他的教学范围涵盖计算机科学的各个领域，从1995年开始教授数据库，从2000年开始教授php。他的研究包括建立更好的网络搜索引擎、检索多媒体与基因信息以及设计快速的数据结构。在闲暇的时候，hugh喜欢跑步、看richmond队的比赛、打板球以及写书。hugh拥有rmit大学的博士学位。",
      summary:
        "有很多原因需要网站能够支持动态内容，包括：提供在线购物网站、创建个性化页面、管理来自数据库的大量信息等。只要拥有基础的html与网站管理知识，任何人都能学习php与mysql从而创建动态网站。这本书的目的是传授创建动态网站所需的背景知识，并使用这些工具架设安全且稳定的网站。\n《php & mysql web数据库应用开发指南（第二版）》详细反映实际程序的需求，仔细地探讨外部数据的验证（例如信用卡卡号的格式）、用户登录以及如何使用模板建立网页的标准外观。本书的内容不仅仅是这些。书中还提到如何串联javascript与php让用户操作时更快、更方便。还有正确处理用户输入错误的方法，让网站看起来更专业。另外还引入大量来自pear外挂函数库的强大功能，对常用的、强大的包进行了详细说明。\n本书虽是写给程序设计新手的指南，却未遗漏网站需要的重要技巧。凡是需要更新数据的网站，都会面对多位用户同时访问数据的问题；用户按下“刷新”按钮时，有可能导致新增相同的记录到数据库中……我们对各种类型的问题都提供了相关解决方案。\n书中强调优秀的设计观念，像程序逻辑与页面显示分离就是一例。本书介绍php 5与mysql 4.1的功能，同时也提供适用于旧版程序的技巧。pear包也是本书的特色之一。包括模板、独立于数据库之外的api等数种重大包均频频出现于整合范例中，并附有详细说明。",
      price: "78.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 90,
        average: "8.1",
        min: 0
      },
      subtitle: "",
      author: ["温施耐德"],
      pubdate: "2006-09-01",
      tags: [
        {
          count: 124,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 61,
          name: "MYSQL",
          title: "MYSQL"
        },
        {
          count: 37,
          name: "web",
          title: "web"
        },
        {
          count: 30,
          name: "编程",
          title: "编程"
        },
        {
          count: 28,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 25,
          name: "PHP&MySQL",
          title: "PHP&MySQL"
        },
        {
          count: 14,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 12,
          name: "入门级最好的书",
          title: "入门级最好的书"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s1856795.jpg",
      binding: "16",
      translator: ["马朝晖"],
      catalog: "",
      pages: "628",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s1856795.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s1856795.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s1856795.jpg"
      },
      alt: "https://book.douban.com/subject/1824542/",
      id: "1824542",
      publisher: "机械工业出版社",
      isbn10: "7111192362",
      isbn13: "9787111192367",
      title: "PHP和MySQL Web应用开发核心技术",
      url: "https://api.douban.com/v2/book/1824542",
      alt_title: "",
      author_intro: "",
      summary:
        "本书详细讲解了3个应用程序的构建过程:一个日程安排系统、一个博客引擎以及一个电子商务商店。细致分析如何创建健壮的Web数据库应用程序，以及如何避免困扰许多PHP和MySQL开发者的常见错语。\n    本书是为程序员提供的综合且实用的指南，教他们使用PHP和MySQL开发具有产品品质的、使用数据库的Web应用程序。本书不仅包括编写代码，而且介绍前端应用程序、用户界面和数据库设计，还有安全性、测试以及更多内容。\n    主要内容：\n    ·从PHP开发的入门开始，包括代码组织、重用和面向对象的PHP。\n    ·对数据访问详细讨论，包含事务处理、外键和索引。\n    ·利用PHP正则表达式的功能强大的数据验证技术。\n    ·介绍计划Web应用程序，包括用户界面和用户管理。\n    ·提供关于保证Web应用程序安全性的系统化指南。\n    ·涵盖广泛的实现问题——包括国际化、错语处理、数据验证、调试、会话管理和部署。\n    ·关于XML、基于XML的Web服务和用于可重用PHP组件的PEAR框架。\n    ·如何使用Oracle和PostgreSQL的数据库。\n    ·本书配套光盘的内容本书的源代码（包括3个完整的应用程序）。",
      price: "78.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 81,
        average: "6.6",
        min: 0
      },
      subtitle: "",
      author: ["Armando Padilla", "Tim Hawkins"],
      pubdate: "2011-11-01",
      tags: [
        {
          count: 78,
          name: "php",
          title: "php"
        },
        {
          count: 54,
          name: "性能",
          title: "性能"
        },
        {
          count: 43,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 38,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 20,
          name: "优化",
          title: "优化"
        },
        {
          count: 17,
          name: "编程",
          title: "编程"
        },
        {
          count: 16,
          name: "高性能PHP应用开发",
          title: "高性能PHP应用开发"
        },
        {
          count: 13,
          name: "高性能",
          title: "高性能"
        }
      ],
      origin_title: "Pro PHP Application Performance",
      image: "https://img3.doubanio.com/view/subject/m/public/s9019966.jpg",
      binding: "平装",
      translator: ["刘霞", "盛海艳"],
      catalog:
        "目　　录\n第1章　基准测试技术 1\n1.1　PHP应用程序栈 1\n1.2　基准测试实用工具 2\n1.3　定义请求/响应生命周期 3\n1.4　Apache Benchmark 4\n1.4.1　安装Apache Benchmark 4\n1.4.2　运行Apache Benchmark 5\n1.4.3　弄清响应的含义 6\n1.4.4　ab选项标记 8\n1.4.5　ab陷阱 11\n1.5　Siege 12\n1.5.1　安装Siege 12\n1.5.2　运行Siege 13\n1.5.3　分析结果 13\n1.5.4　Siege选项标记 15\n1.5.5　测试很多URL 15\n1.6　影响基准测试数字 16\n1.6.1　地理位置 16\n1.6.2　旅行的数据包 16\n1.6.3　响应的大小 16\n1.6.4　代码复杂性 17\n1.6.5　浏览器行为 18\n1.6.6　Web服务器设置 18\n1.7　小结 19\n第2章　提高客户端下载和呈现性能 20\n2.1　优化响应的重要性 21\n2.2　Firebug 21\n2.2.1　安装Firebug 22\n2.2.2　Firebug性能选项卡 22\n2.2.3　Console选项卡 23\n2.2.4　Net选项卡 25\n2.3　YSlow 26\n2.3.1　YSlow v2规则集 26\n2.3.2　安装YSlow 27\n2.3.3　启动YSlow 28\n2.4　Page Speed 30\n2.4.1　安装Page Speed 31\n2.4.2　运行中的Page Speed 31\n2.5　优化工具 32\n2.5.1　JavaScript优化 33\n2.5.2　JavaScript的放置位置 33\n2.5.3　精简JavaScript 36\n2.6　精简工具 37\n2.7　YUI Compressor 38\n2.8　Closure Compiler 38\n2.8.1　减少资源请求 39\n2.8.2　使用服务器端压缩 39\n2.9　图像压缩 39\n2.10　Smush.it 40\n2.11　小结 42\n第3章　PHP代码优化 43\n3.1　PHP最佳实践 43\n3.1.1　PHP的经济性 45\n3.1.2　require与require_once 45\n3.1.3　提前计算循环长度 47\n3.1.4　使用foreach、for、while循环访问数组元素 49\n3.1.5　文件访问 50\n3.1.6　更快速地访问对象属性 52\n3.2　使用VLD、strace和Xdebug一探究竟 54\n3.2.1　用VLD查看Opcode函数 54\n3.2.2　使用strace进行C级跟踪 56\n3.3　发现瓶颈 58\n3.3.1　Xdebug 2：PHP调试工具 58\n3.3.2　验证安装 60\n3.3.3　安装基于GUI的工具 61\n3.4　小结 64\n第4章　Opcode缓存 65\n4.1　回顾路线图 65\n4.2　PHP的生命周期 66\n4.3　Opcode缓存工具 68\n4.3.1　Alternative PHP Cache 68\n4.3.2　XCache 75\n4.3.3　用XCache缓存 76\n4.3.4　XCache设置 77\n4.3.5　eAccelerator 78\n4.3.6　eA设置 82\n4.4　小结 84\n第5章　变量缓存 85\n5.1　应用程序的性能路线图 85\n5.2　实现变量缓存的价值 86\n5.3　示例项目：创建表 87\n5.3.1　获取记录 88\n5.3.2　计算读取数据库的开销 89\n5.4　APC缓存 93\n5.4.1　将数据添加到缓存中 93\n5.4.2　对APC进行基准测量 94\n5.5　Memcached 96\n5.5.1　安装Memcached 96\n5.5.2　启动memcached服务器 97\n5.5.3　在PHP中使用memcached 97\n5.6　小结 101\n第6章　选择正确的Web服务器 102\n6.1　选择适合你的Web服务器程序包 103\n6.1.1　安全性和稳定性非常重要 103\n6.1.2　找到具有丰富知识的工程师非常重要 103\n6.1.3　你的网站主要是静态内容 103\n6.1.4　你在托管服务中托管 103\n6.1.5　你正在使用不常见的PHP 扩展 103\n6.2　Web服务器的使用情况图表 103\n6.3　Web服务器请求的处理 104\n6.4　Web服务器硬件 105\n6.5　对Web服务器进行分类 106\n6.6　Apache HTTPD 106\n6.6.1　Apache Daemon命令行 107\n6.6.2　Apache多处理模块 108\n6.7　了解Apache模块 109\n6.7.1　添加动态Apache模块 110\n6.7.2 删除动态Apache模块 110\n6.8　关于Apache的最后几点 111\n6.9　lighttpd 111\n6.9.1　安装lighttpd 111\n6.9.2　lighttpd配置设置 113\n6.9.3　比较静态负载内容 114\n6.9.4　在lighttpd上安装PHP 115\n6.10　Nginx 118\n6.10.1　安装Nginx 118\n6.10.2　Windows安装 121\n6.11　Nginx作为静态Web服务器 122\n6.11.1　安装FastCGI PHP 123\n6.11.2　Nginx基准测试 124\n6.12　小结 126\n第7章　优化Web服务器和内容交付 127\n7.1　测定Web服务器的性能 127\n7.2　了解应用程序的内存占用情况 129\n7.3　优化Apache中的进程 130\n7.3.1　控制Apache客户端（Prefork MPM） 131\n7.3.2　优化内存使用和防止产生交换 131\n7.4　其他Apache配置调整 131\n7.4.1　使用.htaccess文件和AllowOverride 132\n7.4.2　使用FollowSymlinks 133\n7.4.3　使用DirectoryIndex 133\n7.4.4　关闭HostnameLookup 133\n7.4.5　启用Keep-Alive 134\n7.4.6　使用mod_deflate来压缩内容 134\n7.5　扩展到单台服务器之外 135\n7.5.1　使用Round-Robin DNS 135\n7.5.2　使用负载均衡器 135\n7.5.3　使用直接服务器返回 137\n7.5.4　在服务器场的成员之间共享会话 138\n7.5.5　与共享文件系统共享资产 139\n7.5.6　与独立资产服务器共享资产 140\n7.5.7　与内容分发网络共享资产 140\n7.6　使用分布式架构的陷阱 141\n7.6.1　缓存一致性问题 141\n7.6.2　缓存版本问题 141\n7.6.3　用户IP地址跟踪 142\n7.6.4　多米诺骨牌或级联失败效应 143\n7.6.5　部署失败 143\n7.7　监视应用程序 144\n7.8　小结 144\n第8章　数据库优化 145\n8.1　MySQL简介 146\n8.2　了解MySQL存储引擎 146\n8.2.1　MyISAM：原始引擎 147\n8.2.2　InnoDB：专业级的选择 147\n8.2.3　选择存储引擎 148\n8.3　了解MySQL如何使用内存 148\n8.3.1　InnoDB与MyISAM内存使用的比较 149\n8.3.2　每服务器与每连接（线程）内存使用的比较 149\n8.4　查找配置文件 150\n8.4.1　Mysqltuner.pl：优化数据库服务器的内存 151\n8.4.2　示例服务器可能出现的问题 154\n8.4.3　优化InnoDB 155\n8.5　找到有问题的查询 155\n8.6　分析有问题的查询 157\n8.7　PHP数据库应用程序的建议 158\n8.7.1　保持独立的读写连接 158\n8.7.2　默认使用“utf8”（多字节Unicode）字符集 158\n8.7.3　使用“UTC”日期格式 159\n8.8　小结 160\n附录A　在Windows上安装Apache、 MySQL、PHP和PECL 161\n附录B　在Linux上安装Apache、 MySQL、PHP和PECL 174",
      pages: "177",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s9019966.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s9019966.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s9019966.jpg"
      },
      alt: "https://book.douban.com/subject/6902577/",
      id: "6902577",
      publisher: "人民邮电出版社",
      isbn10: "7115264953",
      isbn13: "9787115264954",
      title: "高性能PHP应用开发",
      url: "https://api.douban.com/v2/book/6902577",
      alt_title: "Pro PHP Application Performance",
      author_intro:
        "Yahoo公司技术专家力作\nPHP性能优化的修炼秘籍\n掌握各种重构技术与最佳实践",
      summary:
        "《高性能PHP应用开发》是一本广受好评的PHP性能优化方面的图书，通过介绍PHP的原理和相关的工具集来实现调优性能的目的。它分析和研究了Web应用程序的前端和后端，并系统地提升了其性能和运行效率。《高性能PHP应用开发》还介绍了PHP编码最佳实践的运用以及如何使用工具来应用缓存技术。另外书中也涉及了对Web服务器的优化和数据库的优化。《高性能PHP应用开发》适合PHP开发人员阅读。",
      price: "39.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 118,
        average: "7.7",
        min: 0
      },
      subtitle: "",
      author: ["高洛峰"],
      pubdate: "2009-10-01",
      tags: [
        {
          count: 148,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 48,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 33,
          name: "编程",
          title: "编程"
        },
        {
          count: 27,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 20,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 18,
          name: "WEB",
          title: "WEB"
        },
        {
          count: 15,
          name: "技术",
          title: "技术"
        },
        {
          count: 12,
          name: "还不错",
          title: "还不错"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s6080118.jpg",
      binding: "平装",
      translator: [],
      catalog:
        "第1章 LAMP网站构建  1\n1.1 网站软件简介\t1\n1.1.1 B/S软件体系结构\t1\n1.1.2 动态网站介绍\t2\n1.2 动态网站软件开发所需的Web构件\t3\n1.2.1 客户端浏览器\t4\n1.2.2 扩展超文本标记语言XHTML\t5\n1.2.3 层叠样式表CSS\t6\n1.2.4 XML和XSLT\t6\n1.2.5 客户端脚本编程语言\t7\n1.2.6 Web服务器\t8\n1.2.7 服务器端脚本编程语言\t9\n1.2.8 数据库管理系统\t10\n1.3 网站软件开发平台及工作流程\t11\n1.3.1 动态网站开发平台\t11\n1.3.2 动态网站开发平台技术比较\t12\n1.4 客户端与服务器端交互的工作原理\t13\n1.4.1 HTTP协议是什么\t13\n1.4.2 Web的工作原理\t14\n1.5 LAMP网站开发组合概述\t16\n1.5.1 Linux操作系统\t17\n1.5.2 Web服务器Apache\t17\n1.5.3 MySQL数据库管理系统\t18\n1.5.4 PHP后台脚本编程语言\t18\n1.5.5 LAMP发展趋势\t20\n1.6 小结\t21\n自测题\t21\n第2章 搭建PHP的开发环境\t23\n2.1 环境安装对操作系统的选择\t23\n2.1.1 选择网站运营的操作系统\t23\n2.1.2 选择网站开发的操作系统\t24\n2.2 Linux系统下源代码包方式安装环境\t24\n2.2.1 安装前准备\t24\n2.2.2 编译安装过程介绍\t26\n2.2.3 安装libxml2最新库文件\t27\n2.2.4 安装libmcrypt最新库文件\t27\n2.2.5 安装zlib最新库文件\t28\n2.2.6 安装libpng最新库文件\t29\n2.2.7 安装jpeg6最新库文件\t29\n2.2.8 安装freetype最新库文件\t30\n2.2.9 安装autoconf最新的库文件\t30\n2.2.10 安装最新的GD库文件\t31\n2.2.11 安装新版本的Apache服务器\t31\n2.2.12 安装MySQL数据库管理系统\t32\n2.2.13 安装最新版本的PHP模块\t36\n2.2.14 安装Zend加速器\t38\n2.2.15 phpMyAdmin的安装\t39\n2.2.16 phpMyAdmin的配置\t40\n2.3 在Windows系统上安装Web工作环境\t42\n2.3.1 安装前准备\t42\n2.3.2 安装Apache\t43\n2.3.3 安装MySQL\t46\n2.3.4 安装PHP\t52\n2.3.5 安装Zend加速器\t55\n2.4 Window系统上安装集成开发环境\t57\n2.4.1 安装前准备\t58\n2.4.2 安装步骤\t58\n2.4.3 环境测试\t60\n2.5 小结\t61\n自测题\t61\n第3章 Apache服务器的配置\t62\n3.1 Apache简介\t62\n3.1.1 Apache的诞生\t63\n3.1.2 Apache的特性\t63\n3.2 Apache服务器的目录结构\t63\n3.3 Apache服务器配置文件结构说明\t64\n3.3.1 Apache服务器配置文件位置\t64\n3.3.2 配置文件的语法\t65\n3.4 Apache服务器全局参数设置\t66\n3.4.1 在主配置文件httpd.conf中的全局参数\t67\n3.4.2 附加配置文件httpd-default.conf中的\n全局参数\t70\n3.4.3 附加配置文件httpd-mpm.conf中的全局\n参数\t71\n3.5 Apache服务器中使用配置段（容器）\t74\n3.5.1 文件系统容器\t76\n3.5.2 网络空间容器\t76\n3.5.3 通配符和正则表达式\t76\n3.5.4 如何选择使用容器\t77\n3.6 .htaccess文件和访问限制\t77\n3.6.1 设置路径别名\t78\n3.6.2 在.htaccess文件中设置目录的访问限制\t80\n3.7 设置虚拟主机\t80\n3.7.1 基于IP地址的虚拟主机\t81\n3.7.2 基于主机名的虚拟主机\t83\n3.8 小结\t87\n自测题\t87\n第4章 XHTML和CSS网页标准化布局\t89\n4.1 网页制作概述\t89\n4.1.1 XHTML基础\t89\n4.1.2 CSS基础\t91\n4.2 HTML的设计与应用\t92\n4.2.1 XHTML语言的语法\t92\n4.2.2 XHTML文件的主体结构\t94\n4.2.3 文字版面的编辑\t97\n4.2.4 创建图像和链接\t99\n4.2.5 使用XHTML表格\t101\n4.2.6 XHTML框架结构\t103\n4.2.7 XHTML表单设计\t106\n4.3 CSS的设计与应用\t109\n4.3.1 将样式表加入到HTML中\t110\n4.3.2 CSS选择符\t111\n4.3.3 常见的样式属性和值\t113\n4.4 DIV+CSS网页标准化布局\t120\n4.4.1 DIV+CSS的优势\t121\n4.4.2 “无意义”的元素div和span\t121\n4.4.3 区块框模型\t122\n4.4.4 区块框定位\t123\n4.4.5 区块框浮动\t124\n4.4.6 使用区块框设计页面布局\t126\n4.5 XHTML和CSS网站首页面布局实例\t129\n4.5.1 XHTML文件的设计\t129\n4.5.2 CSS文件设计\t130\n4.6 小结\t132\n自测题\t133\n第5章 PHP的基本语法\t136\n5.1 PHP在Web开发中的应用\t136\n5.2 第一个PHP脚本程序\t138\n5.2.1 PHP语言标记\t141\n5.2.2 指令分隔符“分号”\t144\n5.2.3 程序注释\t144\n5.2.4 在程序中使用空白的处理\t145\n5.3 变量\t146\n5.3.1 变量的声明\t146\n5.3.2 变量的命名\t147\n5.3.3 可变变量\t148\n5.3.4 变量的引用赋值\t149\n5.4 变量的类型\t149\n5.4.1 类型介绍\t150\n5.4.2 布尔型（boolean）\t150\n5.4.3 整型（integer）\t151\n5.4.4 浮点型（float或double）\t152\n5.4.5 字符串（String）\t152\n5.4.6 数组（Array）\t155\n5.4.7 对象（Object）\t155\n5.4.8 资源类型（Resource）\t156\n5.4.9 NULL类型\t156\n5.4.10 伪类型介绍\t157\n5.4.11 数据类型之间相互转换\t157\n5.5 常量\t160\n5.5.1 常量的定义和使用\t160\n5.5.2 常量和变量\t161\n5.5.3 预定义常量\t161\n5.6 PHP中的运算符\t162\n5.6.1 算术运算符\t163\n5.6.2 字符串运算符\t165\n5.6.3 赋值运算符\t165\n5.6.4 比较运算符\t166\n5.6.5 逻辑运算符\t167\n5.6.6 位运算符\t168\n5.6.7 其他运算符\t171\n5.6.8 运算符的优先级\t173\n5.7 表达式\t174\n5.8 小结\t174\n自测题\t174\n第6章 PHP的语言结构\t176\n6.1 流程控制概述\t176\n6.2 分支结构\t176\n6.2.1 单一条件分支结构（if）\t177\n6.2.2 双向条件分支结构（else子句）\t178\n6.2.3 多向条件分支结构（elseif子句）\t179\n6.2.4 多向条件分支结构（switch语句）\t180\n6.2.5 巢状条件分支结构\t183\n6.2.6 条件分支结构应用实例（简单计算器）\t184\n6.3 循环结构\t186\n6.3.1 while语句\t187\n6.3.2 do…while循环\t189\n6.3.3 for语句\t190\n6.3.4 特殊的流程控制语句\t192\n6.4 PHP中的函数\t195\n6.4.1 函数的定义\t195\n6.4.2 自定义函数\t195\n6.4.3 函数的工作原理和结构化编程\t201\n6.4.4 PHP变量的范围\t202\n6.4.5 参数的传递\t204\n6.4.6 变量函数\t207\n6.4.7 递归函数\t208\n6.4.8 使用自定义函数库\t209\n6.4.9 使用系统函数库\t210\n6.5 小结\t210\n自测题\t211\n第7章 PHP中的数组与数据结构\t214\n7.1 数组的概述\t214\n数组的分类\t215\n7.2 数组的定义\t216\n7.2.1 直接赋值的方式声明数组\t216\n7.2.2 使用array()语言结构新建数组\t218\n7.2.3 多维数组的声明\t218\n7.3 数组的遍历\t220\n7.3.1 使用for语句循环遍历数组\t220\n7.3.2 使用foreach语句遍历数组\t222\n7.3.3 联合使用list( )、each( )和while循环\n遍历数组\t225\n7.3.4 使用数组的内部指针控制函数遍历\n数组\t227\n7.4 预定义数组\t228\n7.4.1 服务器变量：$_SERVER\t229\n7.4.2 环境变量：$_ENV\t229\n7.4.3 HTTP GET变量：$_GET\t230\n7.4.4 HTTP POST变量：$_POST\t230\n7.4.5 request变量：$_REQUEST\t232\n7.4.6 HTTP文件上传变量：$_FILES\t232\n7.4.7 HTTP Cookies：$_COOKIE\t232\n7.4.8 Session变量：$_SESSION\t232\n7.4.9 Global变量：$GLOBALS\t233\n7.5 数组的相关处理函数\t233\n7.5.1 数组的键/值操作函数\t233\n7.5.2 统计数组元素的个数和唯一性\t236\n7.5.3 使用回调函数处理数组的函数\t237\n7.5.4 数组的排序函数\t240\n7.5.5 拆分、合并、分解和接合数组\t244\n7.5.6 数组与数据结构\t247\n7.5.7 其他有用的数组处理函数\t248\n7.6 小结\t250\n自测题\t250\n第8章 PHP面向对象的程序设计\t253\n8.1 面向对象的介绍\t253\n8.1.1 类和对象之间的关系\t253\n8.1.2 面向对象的程序设计\t254\n8.2 如何抽象一个类\t255\n8.2.1 类的声明\t255\n8.2.2 成员属性\t256\n8.2.3 成员方法\t257\n8.3 通过类实例化对象\t258\n8.3.1 创建对象\t259\n8.3.2 对象类型在内存中的分配\t259\n8.3.3 对象中成员的访问\t261\n8.3.4 特殊的对象引用“$this”\t263\n8.3.5 构造方法与析构方法\t264\n8.4 封装性\t267\n8.4.1 设置私有成员\t268\n8.4.2 私有成员的访问\t269\n8.4.3 __set()、__get()、__isset()和__unset()\n四个方法\t271\n8.5 继承性\t276\n8.5.1 类继承的应用\t277\n8.5.2 访问类型控制\t278\n8.5.3 子类中重载父类的方法\t280\n8.6 常见的关键字和魔术方法\t282\n8.6.1 final关键字的应用\t283\n8.6.2 static和const关键字的使用\t283\n8.6.3 克隆对象\t285\n8.6.4 类中通用的方法__toString()\t287\n8.6.5 通过__call()方法处理错误调用\t287\n8.6.6 自动加载类\t288\n8.6.7 对象串行化\t289\n8.7 抽象类与接口\t291\n8.7.1 抽象方法和抽象类\t291\n8.7.2 接口技术\t293\n8.8 多态性的应用\t295\n8.9 小结\t300\n自测题\t300\n第9章 字符串处理与正则表达式\t303\n9.1 字符串的处理介绍\t303\n9.1.1 字符串的处理方式\t303\n9.1.2 字符串类型的特点\t303\n9.2 常用的字符串输出函数\t304\n9.3 常用的字符串格式化函数\t306\n9.3.1 去除空格和字符串填补函数\t307\n9.3.2 字符串大小写的转换\t308\n9.3.3 和HTML标签相关的字符串格式化\t309\n9.3.4 其他字符串格式化函数\t313\n9.4 字符串比较函数\t314\n9.4.1 按字节顺序进行字符串比较\t314\n9.4.2 按自然排序进行字符串比较\t315\n9.5 正则表达式在字符串处理中的应用\t316\n9.5.1 正则表达式简介\t316\n9.5.2 正则表达式的语法规则\t317\n9.6 与Perl兼容的正则表达式函数\t322\n9.6.1 字符串的匹配与查找\t323\n9.6.2 字符串的替换\t326\n9.6.3 字符串的分割和连接\t331\n9.7 文章发布操作示例\t333\n9.8 小结\t337\n自测题\t337\n第10章 PHP常用功能模块\t340\n10.1 错误和异常处理\t340\n10.1.1 错误类型和基本的调试方法\t341\n10.1.2 错误日志\t343\n10.1.3 异常处理\t345\n10.2 日期和时间\t350\n10.2.1 UNIX时间戳\t350\n10.2.2 在PHP中获取日期和时间\t351\n10.2.3 日期和时间格式化输出\t352\n10.2.4 修改PHP的默认时区\t353\n10.2.5 使用微秒计算PHP脚本执行时间\t354\n10.3 动态图像处理\t355\n10.3.1 PHP中GD库的使用\t355\n10.3.2 画布管理\t356\n10.3.3 设置颜色\t357\n10.3.4 生成图像\t358\n10.3.5 绘制图像\t359\n10.3.6 在图像中绘制文字\t361\n10.3.7 在PHP中实现验证码类的设计..\t363\n10.4 小结\t367\n自测题\t367\n第11章 文件系统处理\t369\n11.1 文件系统概述\t369\n11.1.1 文件类型\t369\n11.1.2 文件的属性\t370\n11.2 目录的基本操作\t373\n11.2.1 解析目录路径\t373\n11.2.2 遍历目录\t375\n11.2.3 统计目录大小\t376\n11.2.4 建立和删除目录\t377\n11.2.5 复制或移动目录\t377\n11.3 文件的基本操作\t378\n11.3.1 文件的打开与关闭\t378\n11.3.2 写入文件\t380\n11.3.3 读取文件内容\t381\n11.3.4 访问远程文件\t383\n11.3.5 移动文件指针\t384\n11.3.6 文件的锁定机制\t385\n11.3.7 文件的一些基本操作函数\t387\n11.4 文件的上传与下载\t388\n11.4.1 文件上传\t389\n11.4.2 处理多个文件上传\t392\n11.4.3 文件下载\t393\n11.5 文件系统项目实例\t394\n11.5.1 功能分析\t394\n11.5.2 系统功能设计\t395\n11.5.3 实例代码实现\t396\n11.6 小结\t418\n自测题\t418\n第12章 MySQL数据库设计\t420\n12.1 MySQL数据库管理\t420\n12.1.1 数据库管理系统\t420\n12.1.2 结构化查询语言SQL\t421\n12.1.3 MySQL数据库的连接与关闭\t422\n12.1.4 创建、选择及查看数据库\t423\n12.2 MySQL数据库中数据表的设计\t423\n12.2.1 数据表（Table）\t423\n12.2.2 数据值和列类型\t424\n12.2.3 数据字段属性\t427\n12.2.4 创建、修改及删除表\t427\n12.2.5 数据表的类型及存储位置\t430\n12.2.6 数据表的默认字符集\t431\n12.2.7 创建索引\t432\n12.3 数据库的设计步骤\t435\n12.3.1 需求分析\t435\n12.3.2 概念设计\t437\n12.3.3 逻辑设计\t439\n12.4 SQL语言设计\t441\n12.4.1 执行DDL命令操作数据对象\t441\n12.4.2 使用DML命令操作数据表中的数据\n记录\t443\n12.4.3 通过DQL命令查询数据表中的数据\t445\n12.5 使用PHP脚本向MySQL服务器发送\nSQL\t455\n12.5.1 在PHP脚本中连接MySQL服务器\t456\n12.5.2 在PHP程序中选择已创建的数据库\t456\n12.5.3 执行SQL命令\t457\n12.5.4 在PHP脚本中处理SELECT查询\n结果集\t458\n12.6 小结\t460\n自测题\t460\n第13章 PHP的mysqli扩展\t464\n13.1 启用mysqli扩展模块\t464\n13.2 使用mysqli类\t465\n13.2.1 连接MySQL服务器\t466\n13.2.2 处理连接错误报告\t467\n13.2.3 关闭与MySQL服务器连接\t468\n13.2.4 执行SQL命令\t469\n13.3 使用mysqli_result类\t469\n13.3.1 创建结果集对象\t470\n13.3.2 回收查询内存\t470\n13.3.3 从结果集中解析数据\t471\n13.3.4 从结果集中获取数据列的信息\t474\n13.3.5 一次执行多条SQL命令\t475\n13.4 使用mysqli_stmt类\t476\n13.4.1 获取预处理语句对象\t477\n13.4.2 绑定参数\t477\n13.4.3 执行准备好的语句\t478\n13.4.4 回收资源\t478\n13.4.5 简单的示例分析\t478\n13.4.6 使用预处理语句处理SELECT查询\n结果\t479\n13.5 数据库事务\t481\n13.5.1 事务处理\t481\n13.5.2 构建事务应用程序\t482\n13.6 MVC模式实现商品管理系统\t483\n13.6.1 MVC设计模式\t483\n13.6.2 商品管理系统的设计与实现\t485\n13.7 小结\t494\n自测题\t494\n第14章 数据库抽象层PDO\t497\n14.1 PDO所支持的数据库\t497\n14.2 PDO的安装\t498\n14.3 创建PDO对象\t499\n14.3.1 以多种方式调用构造方法\t500\n14.3.2 PDO对象中的成员方法\t502\n14.4 使用PDO对象\t502\n14.4.1 调整PDO的行为属性\t503\n14.4.2 PDO处理PHP程序和数据库之间的\n数据类型转换\t503\n14.4.3 PDO的错误处理模式\t504\n14.4.4 使用PDO执行SQL语句\t504\n14.5 PDO对预处理语句的支持\t506\n14.5.1 了解PDOStatement对象\t507\n14.5.2 准备语句\t507\n14.5.3 绑定参数\t508\n14.5.4 执行准备好的查询\t509\n14.5.5 获取数据\t510\n14.5.6 大数据对象的存取\t513\n14.6 PDO的事务处理\t514\n14.7 小结\t515\n自测题\t515\n第15章 会话控制\t517\n15.1 为什么要使用会话控制\t517\n15.2 会话跟踪的方式\t518\n15.3 Cookie的应用\t518\n15.3.1 Cookie概述\t519\n15.3.2 向客户端电脑中设置Cookie\t519\n15.3.3 在PHP脚本中读取Cookie的资料内容\t521\n15.3.4 数组形态的Cookie应用\t521\n15.3.5 删除Cookie\t522\n15.3.6 基于Cookie的用户登录模块\t522\n15.4 Session的应用\t524\n15.4.1 Session概述\t524\n15.4.2 配置Session\t525\n15.4.3 Session的声明与使用\t526\n15.4.4 注册一个会话变量和读取Session\t526\n15.4.5 注销变量与销毁Session\t527\n15.4.6 传递Session ID\t528\n15.5 一个简单的邮件系统\t530\n15.5.1 为邮件系统准备数据\t531\n15.5.2 编码实现邮件系统\t531\n15.5.3 邮件系统执行说明\t534\n15.6 小结\t535\n自测题\t535\n第16章 PHP的模板技术Smarty\t537\n16.1 什么是模板引擎\t537\n16.2 编写自己的模板引擎\t538\n16.2.1 创建自己的模板引擎类\t538\n16.2.2 使用自已的模板引擎\t540\n16.2.3 自定义模板的使用示例分析\t542\n16.3 选择Smarty模板引擎\t545\n16.4 安装Smarty及初使化配置\t546\n16.4.1 安装Smarty\t546\n16.4.2 初使化Smarty类库的默认设置\t546\n16.4.3 第一个Smarty的简单示例\t548\n16.5 Smarty在应用程序逻辑层的使用步骤\t550\n16.6 Smarty模板中的程序逻辑\t551\n16.6.1 模板中的注释\t551\n16.6.2 模板中变量的声明\t552\n16.6.3 在模板中输出从PHP分配的变量\t552\n16.6.4 模板中变量的数学计算\t554\n16.6.5 在模板中使用{$smarty}保留变量\t554\n16.6.6 变量调解器\t555\n16.6.7 模板的控制结构\t557\n16.6.8 在模板中包含子模板\t563\n16.7 为Smarty模板创建配置文件\t563\n16.7.1 配置文件语法格式\t563\n16.7.2 加载配置文件\t564\n16.7.3 引用配置文件中的变量\t565\n16.8 Smarty处理页面缓存\t566\n16.8.1 在Smarty中控制缓存\t567\n16.8.2 每个页面多个缓存\t568\n16.8.3 为缓存实例消除处理开销\t568\n16.8.4 清除缓存\t569\n16.8.5 关闭局部缓存\t570\n16.9 应用Smarty实现分页示例\t571\n16.9.1 准备工作\t571\n16.9.2 设计数据库操作类\t572\n16.9.3 设计分页操作类\t573\n16.9.4 PHP的程序逻辑层\t575\n16.9.5 Smarty模板的表现层\t576\n16.10 小结\t577\n自测题\t577\n第17章 内容管理系统（CMS）\t579\n17.1 Web软件开发流程概述\t579\n17.1.1 Web开发团队的成员\t579\n17.1.2 Web软件开发流程\t580\n17.1.3 项目开发规范\t582\n17.2 需求分析\t584\n17.2.1 CMS简介\t584\n17.2.2 用户行为分析\t584\n17.2.3 系统目标\t585\n17.2.4 系统特点\t586\n17.3 系统功能预览\t586\n17.3.1 CMS系统安装\t586\n17.3.2 登录管理平台\t589\n17.3.3 常规设置管理\t590\n17.3.4 友情链接管理\t591\n17.3.5 图片管理\t592\n17.3.6 栏目管理\t595\n17.3.7 文章管理\t596\n17.3.8 用户管理\t597\n17.3.9 网站首页\t598\n17.3.10 文章列表页面\t599\n17.3.11 文章内容页面\t600\n17.4 数据库设计\t601\n17.4.1 数据库需求分析\t601\n17.4.2 数据表关系\t605\n17.5 系统架构\t605\n17.5.1 系统体系结构\t605\n17.5.2 管理平台的文件结构\t607\n17.5.3 网站前台模板风格的文件结构\t608\n17.6 常用的功能模块开发\t610\n17.6.1 系统安装模块设计\t610\n17.6.2 管理平台（后台）的模块设计\t616\n17.6.3 无限分类模块设计\t619\n17.6.4 网站首页面的设计\t624\n17.7 小结\t625\n附录A PHP配置文件详解  627",
      pages: "649",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s6080118.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s6080118.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s6080118.jpg"
      },
      alt: "https://book.douban.com/subject/4090200/",
      id: "4090200",
      publisher: "电子工业出版社",
      isbn10: "712109441X",
      isbn13: "9787121094415",
      title: "细说PHP",
      url: "https://api.douban.com/v2/book/4090200",
      alt_title: "",
      author_intro: "",
      summary:
        "《细说PHP》开发Web应用程序PHP是最理想的工具，易于使用、功能强大、成本低廉、高安全性、开发速度快且执行灵活。《细说PHP》以实用为目标设计，包含PHP开发最主流的各项技术，对每一个知识点都进行了深入详细的讲解，并附有大量的实例代码，图文并茂。系统地介绍了PHP的相关技术及其在实际Web开发中的应用。\n  《细说PHP》共17章，每一章都是PHP独立知识点的总结。内容涵盖了PHP的运行环境搭建、Web服务器Apache的配置与应用、动态网站开发的前台技术、PHP编程语言的语法、PHP的常用功能模块和实用技巧、MySQL数据库的设计与应用、PHP 5面向对象的程序设计思想、Web开发的设计模式，以及包含DIV+CSS、mysqli扩展模块、数据库抽象层PDO、Smarty模板技术等目前PHP开发中最主流的技术。每一章中都有大量的实用示例，以及详尽的注释，加速读者的理解和学习，也为每章的技术点设置了大量的自测试题。最后以一个比较完整的、采用面向对象思想，以及通过MVC模式设计，并结合Smarty模板的CMS系统为案例，详细介绍了Web系统开发从设计到部署的各个细节，更好地进行开发实践。",
      price: "79.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 68,
        average: "7.3",
        min: 0
      },
      subtitle: "图灵程序设计丛书",
      author: ["泽瓦斯"],
      pubdate: "2008-10-1",
      tags: [
        {
          count: 70,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 21,
          name: "Web2.0",
          title: "Web2.0"
        },
        {
          count: 14,
          name: "编程",
          title: "编程"
        },
        {
          count: 14,
          name: "Zend_Framwork",
          title: "Zend_Framwork"
        },
        {
          count: 11,
          name: "web",
          title: "web"
        },
        {
          count: 4,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 4,
          name: "技术",
          title: "技术"
        },
        {
          count: 4,
          name: "开发技术和语言",
          title: "开发技术和语言"
        }
      ],
      origin_title: "Practical Web 2.0 Applications with PHP",
      image: "https://img3.doubanio.com/view/subject/m/public/s9114674.jpg",
      binding: "平装",
      translator: ["苏金国"],
      catalog:
        "第1章　应用规划与设计\n1.1　什么是web 2.0\n1.2　数据库连接\n1.3　网站模板\n1.4　网站特性\n1.4.1　网站主页和用户主页\n1.4.2　用户注册\n1.4.3　账户登录和管理\n1.4.4　用户博客\n1.4.5　网站搜索\n1.4.6　应用管理\n1.5　开发的其他方面\n1.5.1　搜索引擎优化\n1.5.2　phpdoc风格的注释\n1.5.3　安全性\n1.5.4　应用日志\n1.5.5　可维护性和可扩展性\n1.6　版本控制和单元测试\n1.7　小结\n第2章　建立应用框架\n2.1　web服务器配置\n2.1.1　操作系统\n2.1.2　安装apache http服务器\n2.1.3　安装mysql 5\n2.1.4　安装php 5.2.3\n2.2　应用文件系统结构\n2.2.1　web根目录\n2.2.2　数据存储目录\n2.2.3　php类目录\n2.2.4　模板目录\n2.2.5　完整的目录结构\n2.3　安装zend框架\n2.4　配置web服务器\n2.4.1　在linux上创建虚拟主机\n2.4.2　在windows上创建虚拟主机\n2.4.3　重启web服务器\n2.5　建立数据库\n2.6　使用mvc模式\n2.6.1　将应用逻辑与表示逻辑分离\n2.6.2　将所有请求定向到index.php\n2.6.3　zend_controller类简介\n2.6.4　zend_controller如何处理请求\n2.6.5　创建indexcontroller\n2.7　定义应用设置\n2.8　连接数据库\n2.9　smarty模板引擎\n2.9.1　为什么不使用其他模板引擎\n2.9.2　下载和安装smarty\n2.9.3　利用zend_controller自动显示视图\n2.9.4　smarty与网站控制器集成\n2.10　增加日志功能\n2.11　小结\n第3章　用户认证、授权和管理\n3.1　创建用户数据库表\n3.1.1　时间戳\n3.1.2　用户个性化信息\n3.2　zend_auth简介\n3.2.1　实例化zend_auth\n3.2.2　使用zend_auth完成认证\n3.3　zend_acl简介\n3.4　结合zend_auth、zend_acl和zend_controller_front\n3.5　用databaseobject管理用户记录\n3.5.1　databaseobject_user类\n3.5.2　使用databaseobject_user\n3.6　管理用户个性化信息\n3.6.1　使用profile_user\n3.6.2　集成profile_user和databaseobject_user\n3.7　小结\n第4章　用户注册、登录和注销\n4.1　为应用增加用户注册功能\n4.1.1　为用户注册创建表单处理器\n4.1.2　显示注册表单并处理注册\n4.1.3　为用户注册表单增加captcha\n4.1.4　增加e-mail功能\n4.2　实现账户登录和注销\n4.2.1　创建登录模板\n4.2.2　增加account控制器login动作\n4.2.3　记录成功和失败登录\n4.2.4　用户注销账户\n4.3　处理忘记口令的情况\n4.3.1　重置用户口令\n4.3.2　重置口令的函数\n4.4　实现账户管理\n4.4.1　创建账户主页\n4.4.2　更新网站导航\n4.4.3　允许用户更新信息\n4.5　小结\n第5章　prototype与scriptaculous简介\n5.1　下载和安装prototype\n5.2　选择文档对象模型中的对象\n5.2.1　$()函数\n5.2.2　getelementsbyclassname()函数\n5.2.3　$$()函数\n5.2.4　getelementsbyselector()函数\n5.3　prototype的hash对象\n5.4　其他元素扩展\n5.4.1　显示和隐藏元素\n5.4.2　获取元素尺寸\n5.4.3　管理元素类\n5.4.4　用prototype管理字符串\n5.5　prototype中的ajax操作\n5.5.1　ajax请求选项\n5.5.2　ajax回调函数\n5.5.3　json\n5.5.4　一个ajax.request例子\n5.6　prototype中的事件处理\n5.6.1　观察事件\n5.6.2　查找事件出现在哪个元素上\n5.6.3　取消事件\n5.7　利用prototype创建javascript类\n5.7.1　创建类\n5.7.2　为函数调用绑定对象\n5.8　从prototype转向scriptaculous\n5.8.1　预置控件\n5.8.2　拖放\n5.8.3　视觉效果\n5.8.4　dom元素构建器\n5.8.5　javascript单元测试\n5.9　下载和安装scriptaculous\n5.10　在一个实用例子中结合使用prototype、scriptaculous、ajax和php\n5.10.1　创建主html页面：index.php\n5.10.2　为应用设置样式：styles.css\n5.10.3　创建和填充数据库：schema.sql\n5.10.4　服务器端管理列表项：items.php\n5.10.5　在服务器端处理ajax请求：processor.php\n5.10.6　创建客户端应用逻辑：scripts.js\n5.11　小结\n第6章　为web应用设置样式\n6.1　增加页面标题和浏览路径\n6.1.1　breadcrumbs类\n6.1.2　生成url\n6.1.3　为各个控制器动作设置标题和浏览路径\n6.1.4　创建一个smarty插件输出浏览路径\n6.1.5　显示页面标题\n6.2　在应用中集成设计\n6.2.1　创建静态html\n6.2.2　将html标记移入smarty模板\n6.3　构建css\n6.3.1　指定媒体类型和加载css文件\n6.3.2　创建应用css\n6.3.3　创建只打印样式表\n6.3.4　完整的应用样式表\n6.4　为应用web表单设置样式\n6.5　加载prototype和scriptaculous\n6.6　实现客户端表单验证\n6.6.1　为customcontrolleraction类增加json支持\n6.6.2　修改表单处理器\n6.6.3　修改注册控制器动作\n6.6.4　创建javascript表单验证器\n6.6.5　加载userregistrationform类\n6.7　小结\n第7章　构建博客系统\n7.1　创建数据库表\n7.2　建立databaseobject和profile类\n7.2.1　创建databaseobject_blogpost类\n7.2.2　创建profile_blogpost类\n7.3　创建控制器管理博客帖子\n7.3.1　扩展应用权限\n7.3.2　blogmanagercontroller动作\n7.3.3　链接博客管理系统\n7.4　创建和编辑博客帖子\n7.4.1　创建博客帖子提交表单模板\n7.4.2　在editaction()中实例化formprocessor_blogpost\n7.4.3　实现formprocessor_blogpost类\n7.4.4　为博客帖子生成一个永久链接\n7.4.5　过滤提交的html\n7.4.6　创建一个新博客帖子\n7.5　预览博客帖子\n7.5.1　创建预览动作\n7.5.2　实现预览模板\n7.5.3　请求对用户动作的确认\n7.6　更新博客帖子的状态\n7.6.1　完成setstatusaction()\n7.6.2　通知用户\n7.7　小结\n第8章　扩展博客管理系统\n8.1　在博客管理系统索引页面上列出帖子\n8.1.1　从数据库获取博客帖子\n8.1.2　将最新帖子和各月概要赋给模板\n8.1.3　在模板中显示最新帖子\n8.1.4　显示各月概要\n8.2　为博客各月概要增加ajax功能\n8.2.1　创建ajax请求输出\n8.2.2　blogmonthlysummary javascript类\n8.2.3　安装blogmonthlysummary类\n8.2.4　通知用户内容已更新\n8.3　集成wysiwyg编辑器\n8.3.1　下载并安装fckeditor\n8.3.2　配置fckeditor\n8.3.3　在博客编辑页面中加载fckeditor\n8.4　小结\n第9章　个人化用户区\n9.1　控制用户设置\n9.1.1　为用户提供定制设置\n9.1.2　处理对用户设置的修改\n9.1.3　创建默认用户设置\n9.2　usercontroller类\n9.2.1　将请求路由到usercontroller\n9.2.2　处理对usercontroller的请求\n9.3　显示用户的博客\n9.3.1　显示博客索引页面\n9.3.2　显示单个博客帖子\n9.3.3　生成博客归档链接\n9.3.4　显示各月归档\n9.4　填充应用主页\n9.4.1　加载最新公开帖子\n9.4.2　实现应用主页\n9.5　小结\n第10章　实现web 2.0特性\n10.1　标签\n10.1.1　实现标签系统\n10.1.2　管理博客帖子标签\n10.1.3　在用户博客上显示用户的标签\n10.1.4　显示标签空间\n10.1.5　在各帖子上显示标签\n10.2　web提要\n10.2.1　web提要的数据格式\n10.2.2　用zend_feed创建一个atom提要\n10.2.3　为usercontroller增加提要\n10.2.4　链接到提要\n10.2.5　其他提要选项\n10.3　微格式\n10.3.1　使用微格式的例子\n10.3.2　为什么使用微格式\n10.3.3　对标签标记微格式\n10.4　允许用户创建公开个性化数据\n10.4.1　允许用户创建公开个性化数据\n10.4.2　显示用户的个性化数据\n10.5　小结\n第11章　一个动态图库\n11.1　存储上传文件\n11.1.1　为图像数据创建数据库表\n11.1.2　用databaseobject控制上传图像\n11.2　上传文件\n11.2.1　设置表单编码\n11.2.2　增加表单\n11.2.3　指定文件输入类型\n11.2.4　设置最大文件大小\n11.2.5　处理上传文件\n11.3　发送图像\n11.4　调整图像大小\n11.4.1　创建缩略图\n11.4.2　将缩略图生成工具链接到图像动作处理程序\n11.5　管理博客帖子图像\n11.5.1　自动加载博客帖子图像\n11.5.2　在帖子预览页面上显示图像\n11.5.3　删除博客帖子图像\n11.5.4　使用scriptaculous和ajax删除图像\n11.5.5　删除帖子时删除图像\n11.5.6　重排博客帖子图像的顺序\n11.6　在用户博客上显示图像\n11.6.1　扩展getposts()函数\n11.6.2　在博客索引页面上显示缩略图\n11.6.3　在博客详细信息页面上显示图像\n11.6.4　用lightbox显示更大的图像\n11.7　小结\n第12章　实现网站搜索\n12.1　zend_search_lucene简介\n12.1.1　与mysql全文索引比较\n12.1.2　zend_search_lucene字段类型\n12.1.3　字段命名\n12.2　建立应用内容的索引\n12.2.1　对多种类型的数据建立索引\n12.2.2　创建新zend_search_lucene_document\n12.2.3　获取索引位置\n12.2.4　构建完整索引\n12.2.5　对一个博客帖子建立索引和解除索引\n12.2.6　触发搜索索引更新\n12.3　创建搜索工具\n12.3.1　增加搜索表单\n12.3.2　处理搜索请求\n12.3.3　查询搜索索引\n12.3.4　显示搜索结果\n12.3.5　搜索类型\n12.4　为搜索工具增加自动完成功能\n12.4.1　提供搜索建议\n12.4.2　创建一个动作处理程序返回搜索结果\n12.4.3　获取搜索建议\n12.4.4　加载searchsuggestor类\n12.4.5　显示搜索建议\n12.4.6　为结果增加鼠标导航\n12.4.7　为结果增加键盘导航\n12.5　小结\n第13章　集成google maps\n13.1　google maps特性\n13.1.1　地理编码\n13.1.2　显示地图\n13.1.3　控制地图\n13.2　集成规划\n13.2.1　google maps的局限性\n13.2.2　浏览器兼容性\n13.2.3　文档和资源\n13.2.4　创建google maps api键\n13.3　增加位置存储功能\n13.3.1　创建数据库表\n13.3.2　创建databaseobject_blogpostlocation类\n13.3.3　修改博客帖子来加载位置\n13.4　创建第一个地图\n13.4.1　创建一个新博客管理系统控制器动作\n13.4.2　显示第一个google地图\n13.5　在地图上管理位置\n13.5.1　处理位置管理ajax请求\n13.5.2　创建地址查找表单\n13.5.3　扩展bloglocationmanagerjavascript类\n13.5.4　使用bloglocationmanager\n13.6　在用户公开博客上显示地图\n13.6.1　使用geo微格式输出位置\n13.6.2　创建bloglocations类\n13.6.3　更新博客帖子显示模板\n13.7　小结\n第14章　部署与维护\n14.1　应用日志\n14.1.1　通过e-mail向管理员通知重大错误\n14.1.2　使用应用日志\n14.2　网站错误处理\n14.2.1　错误处理的目标\n14.2.2　处理分派前错误\n14.2.3　运行时错误\n14.3　网站管理\n14.3.1　管理区特性\n14.3.2　实现管理\n14.4　应用部署\n14.4.1　不同服务器有不同配置\n14.4.2　用rsync部署应用文件\n14.5　备份和恢复\n14.5.1　导出数据库\n14.5.2　导入数据库\n14.6　小结",
      pages: "475",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s9114674.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s9114674.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s9114674.jpg"
      },
      alt: "https://book.douban.com/subject/3229992/",
      id: "3229992",
      publisher: "人民邮电出版社",
      isbn10: "7115187312",
      isbn13: "9787115187314",
      title: "PHP Web 2.0开发实战",
      url: "https://api.douban.com/v2/book/3229992",
      alt_title: "Practical Web 2.0 Applications with PHP",
      author_intro:
        "Quentin Zervaas，资深PHP程序员。曾为世界各地众多客户开发了许多Web应用，其中Recite CMS已经用于澳大利亚许多大公司。他还是知名PHP开发资源网站PhpRiot（WWW.phpriot.com）的维护者。",
      summary:
        "本书通过一个完整的Web 2.0应用——带有动态图库、搜索和地图功能的博客系统详细介绍了Web开发的全过程。首先讨论了Web应用的规划与设计，然后逐章实现各个具体特性，包括网站主页、用户主页、用户注册页面、账户登录和管理页面、用户博客系统、网站搜索以及应用管理等，最后介绍部署和维护。\n本书适合中、高级的PHP程序员阅读。",
      series: {
        id: "28503",
        title: "图灵程序设计丛书·Web开发系列"
      },
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 3,
        average: "0.0",
        min: 0
      },
      subtitle: "A Guide to Developing Internet Agents with PHP/CURL",
      author: ["Michael Schrenk"],
      pubdate: "2012-3-12",
      tags: [
        {
          count: 7,
          name: "数据挖掘",
          title: "数据挖掘"
        },
        {
          count: 6,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 5,
          name: "Webbots",
          title: "Webbots"
        },
        {
          count: 3,
          name: "计算机科学",
          title: "计算机科学"
        },
        {
          count: 3,
          name: "Webbots,",
          title: "Webbots,"
        },
        {
          count: 3,
          name: "Spiders,",
          title: "Spiders,"
        },
        {
          count: 2,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s21025140.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "392",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s21025140.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s21025140.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s21025140.jpg"
      },
      alt: "https://book.douban.com/subject/6980412/",
      id: "6980412",
      publisher: "No Starch Press",
      isbn10: "1593273975",
      isbn13: "9781593273972",
      title: "Webbots, Spiders, and Screen Scrapers",
      url: "https://api.douban.com/v2/book/6980412",
      alt_title: "",
      author_intro: "",
      summary:
        "There's a wealth of data online, but sorting and gathering it by hand can be tedious and time consuming. Rather than click through page after endless page, why not let bots do the work for you?  Webbots, Spiders, and Screen Scrapers will show you how to create simple programs with PHP/CURL to mine, parse, and archive online data to help you make informed decisions. Michael Schrenk, a highly regarded webbot developer, teaches you how to develop fault-tolerant designs, how best to launch and schedule the work of your bots, and how to create Internet agents that:  * Send email or SMS notifications to alert you to new information quickly * Search different data sources and combine the results on one page, making the data easier to interpret and analyze * Automate purchases, auction bids, and other online activities to save time  Sample projects for automating tasks like price monitoring and news aggregation will show you how to put the concepts you learn into practice. This second edition of Webbots, Spiders, and Screen Scrapers includes tricks for dealing with sites that are resistant to crawling and scraping, writing stealthy webbots that mimic human search behavior, and using regular expressions to harvest specific data. As you discover the possibilities of web scraping, you'll see how webbots can save you precious time and give you much greater control over the data available on the Web.",
      price: "USD 39.95"
    },
    {
      rating: {
        max: 10,
        numRaters: 54,
        average: "8.0",
        min: 0
      },
      subtitle: "",
      author: ["Dagfinn Reiersol", "Marcus Baker", "Chris Shiflett"],
      pubdate: "2010-01-01",
      tags: [
        {
          count: 77,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 21,
          name: "面向对象",
          title: "面向对象"
        },
        {
          count: 15,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 9,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 5,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 5,
          name: "技术",
          title: "技术"
        },
        {
          count: 5,
          name: "web",
          title: "web"
        },
        {
          count: 3,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "PHP in Action: Objects, Design, Agility",
      image: "https://img3.doubanio.com/view/subject/m/public/s4101120.jpg",
      binding: "",
      translator: ["张颖 等", "段大为 审校"],
      catalog:
        "第一部分 工具和概念\n第1章 PHP与现代软件开发 2\n1.1 PHP的作用 2\n1.1.1 PHP流行的原因 3\n1.1.2 克服PHP的局限 5\n1.2 语言、原则和模式 7\n1.2.1 敏捷方法：从蛮干到巧干 7\n1.2.2 PHP 5和软件趋势 8\n1.2.3 面向对象编程进化的规律 8\n1.2.4 设计模式 9\n1.2.5 重构 10\n1.2.6 单元测试和TDD 10\n1.3 小结 13\n第2章 PHP中的对象 14\n2.1 对象基础 14\n2.1.1 为什么将PHP与Java相比较 15\n2.1.2 对象和类 15\n2.1.3 Hello world 15\n2.1.4 构造函数：创建和初始化对象 16\n2.1.5 继承和关键字extends 18\n2.1.6 继承构造函数 19\n2.2 异常处理 20\n2.2.1 异常的工作原理 20\n2.2.2 何时使用异常与返回代码 22\n2.2.3 创建自己的异常类 23\n2.2.4 用异常替换PHP内置的严重错误 24\n2.2.5 不要过度使用异常 24\n2.3 PHP 4和PHP 5中的对象引用 24\n2.3.1 对象引用的工作原理 25\n2.3.2 对象引用的优势 26\n2.3.3 引用何时没有用处 27\n2.4 方法调用的拦截和类的实例化 27\n2.4.1 什么是方法重载 27\n2.4.2 PHP中的Java式方法重载 27\n2.4.3 面向方面的体验：记录方法调用的日志 28\n2.4.4 自动加载类 30\n2.5 小结 31\n第3章 有效使用PHP类 32\n3.1 可见性：私有和受保护的方法与变量 32\n3.1.1 对方法可见性的要求 33\n3.1.2 何时使用私有方法 34\n3.1.3 何时使用受保护方法 34\n3.1.4 让实例变量保持private或protected属性 35\n3.1.5 私有变量和受保护变量的存取 36\n3.1.6 两全其美——通过拦截来控制变量 37\n3.1.7 final类和方法 38\n3.2 没有对象的类：类方法、类变量和类常量 39\n3.2.1 类(静态)方法 40\n3.2.2 何时使用类方法 41\n3.2.3 类变量 41\n3.2.4 类常量 42\n3.2.5 PHP中常量的限制 43\n3.3 抽象类和方法(函数) 45\n3.3.1 什么是抽象类和方法 45\n3.3.2 使用抽象类 45\n3.4 类的类型提示 46\n3.4.1 类型提示的作用 46\n3.4.2 何时使用类型提示 47\n3.5 接口 48\n3.5.1 什么是接口 49\n3.5.2 PHP中需要接口吗 49\n3.5.3 用接口让设计更清晰 50\n3.5.4 用接口改善类的类型提示 50\n3.5.5 PHP 5与Java中的接口 51\n3.6 小结 52\n第4章 理解对象和类 53\n4.1 对象和类的优点 54\n4.1.1 类帮助组织 54\n4.1.2 可以告诉对象要做什么 55\n4.1.3 多态性 55\n4.1.4 对象让代码更易读 56\n4.1.5 类帮助消除重复性代码 59\n4.1.6 可以重用对象和类 60\n4.1.7 避免牵一发而动全身 61\n4.1.8 对象提供类型安全 61\n4.2 好设计的标准 62\n4.2.1 不要混淆结果和含义 64\n4.2.2 透明性 64\n4.2.3 简单设计 64\n4.2.4 一次并且只有一次 65\n4.3 什么是对象 67\n4.3.1 对象来自虚构世界 67\n4.3.2 域对象基础 68\n4.4 小结 70\n第5章 理解类关系 71\n5.1 继承 71\n5.1.1 将继承作为思考工具 72\n5.1.2 继承重构 73\n5.2 对象组合 77\n5.3 接口 79\n5.3.1 将接口作为思考工具 79\n5.3.2 单继承和多继承 80\n5.4 优先考虑对象组合而不是类继承 80\n5.4.1 避免父类命名含糊 81\n5.4.2 避免继承层次结构过深 81\n5.5 小结 82\n第6章 面向对象原则 83\n6.1 原则和模式 84\n6.1.1 架构原则或模式 84\n6.1.2 了解面向对象原则 85\n6.2 开放—封闭原则(OCP) 85\n6.2.1 初识OCP 85\n6.2.2 用类替换的情况 86\n6.2.3 OCP在PHP中是如何相关的 88\n6.3 单一职责原则(SRP) 88\n6.3.1 混合职责：模板引擎 89\n6.3.2 一个试验：分离职责 91\n6.3.3 实验是否成功 93\n6.4 依赖倒置原则(DIP) 94\n6.4.1 什么是依赖性 94\n6.4.2 插入接口 96\n6.5 分层设计 96\n6.5.1 “三层”模式及其同属 97\n6.5.2 Web应用程序能否有域层 98\n6.6 小结 99\n第7章 设计模式 100\n7.1 策略模式 101\n7.1.1 使用策略模式的“Hello world” 101\n7.1.2 策略模式的用处 103\n7.2 适配器模式 104\n7.2.1 初学适配器模式 104\n7.2.2 让一个模板引擎与另一个相像 105\n7.2.3 具有多个类的适配器模式 106\n7.2.4 调整为通用接口 109\n7.3 装饰器模式 109\n7.3.1 资源装饰器 110\n7.3.2 装饰与再装饰 111\n7.4 空对象模式 113\n7.4.1 混合黑暗的灯和明亮的灯 114\n7.4.2 空策略对象 114\n7.5 迭代器模式 115\n7.5.1 迭代器的工作原理 115\n7.5.2 使用迭代器的好原因 116\n7.5.3 迭代器与普通数组 116\n7.5.4 SPL迭代器 117\n7.5.5 SPL如何帮助我们解决迭代器和数组间的冲突 118\n7.6 组合模式 118\n7.6.1 用组合模式实现菜单 118\n7.6.2 基本理论 120\n7.6.3 连贯接口 121\n7.6.4 递归处理 121\n7.6.5 我们的方法低效吗 123\n7.7 小结 123\n第8章 设计指南：日期和时间处理 124\n8.1 为何日期和时间处理要面向对象 124\n8.1.1 更容易，但并非更简单 125\n8.1.2 面向对象的优势 125\n8.2 找到正确的抽象 126\n8.2.1 单个时间表示法：时间点、Instant、DateAndTime 126\n8.2.2 不同类别的时间范围：期间、持续时间、日期范围、时间间隔 127\n8.3 高级对象构建 128\n8.3.1 使用创建方法 128\n8.3.2 多个构造函数 129\n8.3.3 使用工厂类 132\n8.4 大型结构 133\n8.4.1 包的概念 133\n8.4.2 命名空间和包 134\n8.4.3 PHP缺少命名空间支持 135\n8.4.4 处理名称冲突 135\n8.5 使用值对象 140\n8.5.1 对象引用带来的麻烦 141\n8.5.2 实现值对象 142\n8.5.3 更改不可变的对象 142\n8.6 实现基本类 143\n8.6.1 DateAndTime 143\n8.6.2 属性和字段 144\n8.6.3 期间 149\n8.6.4 时间间隔 151\n8.7 小结 151\n第二部分 测试和重构\n第9章 测试驱动开发 154\n9.1 过程形成质量 155\n9.1.1 本示例的需求 155\n9.1.2 报告测试结果 156\n9.2 从数据库取数 157\n9.2.1 基本测试 157\n9.2.2 第一个真正的测试 158\n9.2.3 通过测试 160\n9.2.4 让代码运行 161\n9.2.5 测试直到确信没有问题 163\n9.3 数据库插入和更新 164\n9.3.1 让测试更易读 165\n9.3.2 红，绿，重构 166\n9.4 真正的数据库事务处理 168\n9.4.1 测试事务处理 168\n9.4.2 实现事务处理 170\n9.4.3 调试的终结 171\n9.4.4 测试是工具，不是替代品 171\n9.5 小结 172\n第10章 高级测试技术 173\n10.1 具有持久化功能的联系人管理器 174\n10.1.1 运行多个测试用例 174\n10.1.2 测试联系人的持久化 175\n10.1.3 Contact和ContactFinder类 177\n10.1.4 setUp()和tearDown() 178\n10.1.5 最终版本 179\n10.2 向联系人发送邮件 180\n10.2.1 设计Mailer类及其测试环境 180\n10.2.2 手工编写模拟对象 181\n10.2.3 更为完善的模拟对象 182\n10.2.4 自顶向下测试 183\n10.2.5 模拟的局限性 184\n10.3 虚拟的邮件服务器 185\n10.3.1 安装fakemail 186\n10.3.2 邮件测试 187\n10.3.3 网关作为适配器 190\n10.4 小结 190\n第11章 重构Web应用程序 192\n11.1 真实世界中的重构 193\n11.1.1 早期重构和后期重构 193\n11.1.2 重构与重新实现 194\n11.2 重构基础：可读性和重复性代码 195\n11.2.1 提高可读性 195\n11.2.2 消除重复性代码 197\n11.3 分离标记与程序代码 199\n11.3.1 分离何以有用 200\n11.3.2 合宜使用CSS 200\n11.3.3 清理生成链接的函数 201\n11.3.4 在SimpleTest中引入模板 205\n11.4 简化条件表达式 209\n11.4.1 简单示例 210\n11.4.2 稍长的示例：身份验证代码 211\n11.4.3 处理条件HTML 216\n11.5 从面向过程到面向对象的重构 217\n11.5.1 测试面向过程代码 217\n11.5.2 进行重构 218\n11.6 小结 221\n第12章 用Web测试控制 222\n12.1 再看联系人管理器 223\n12.1.1 样板 223\n12.1.2 创建Web测试 225\n12.1.3 用虚拟网页交互通过测试 226\n12.1.4 一次编写，到处测试 227\n12.2 可工作的表单 229\n12.2.1 尝试将联系人保存到数据库中 230\n12.2.2 创建数据库 231\n12.2.3 为查找器创建存根 232\n12.3 质量保证 234\n12.3.1 让联系人管理器可以进行单元测试 234\n12.3.2 从用例到验收测试 236\n12.4 可怕的遗留代码 238\n12.5 小结 242\n第三部分 构建Web界面\n第13章 使用模板管理Web表现层 244\n13.1 分离表现层和域逻辑 244\n13.1.1 分离还是不分离…… 245\n13.1.2 为什么使用模板 245\n13.2 哪个模板引擎 247\n13.2.1 普通PHP 248\n13.2.2 定制语法：Smarty 249\n13.2.3 属性语言：PHPTAL 251\n13.3 转换：XSLT 254\n13.3.1 “XML化”网页 255\n13.3.2 设置XSLT 256\n13.3.3 XSLT样式表 256\n13.3.4 从PHP运行XSLT 258\n13.4 将逻辑与模板分离 259\n13.4.1 视图协助器 260\n13.4.2 交替行颜色 260\n13.4.3 处理日期和时间格式 261\n13.4.4 生成层级显示 263\n13.4.5 防止从模板更新 265\n13.5 模板和安全 266\n13.5.1 PHPTAL 266\n13.5.2 Smarty 267\n13.5.3 XSLT 267\n13.6 小结 267\n第14章 构建复杂网页 269\n14.1 组合模板(复合视图) 269\n14.1.1 复合视图：一个或多个设计模式 269\n14.1.2 复合数据和复合模板 270\n14.2 实现直观的复合视图 270\n14.2.1 我们的目标 270\n14.2.2 使用Smarty 272\n14.2.3 使用PHPTAL 273\n14.2.4 使用PHPTAL的页面宏 274\n14.3 复合视图示例 275\n14.3.1 制作打印友好的页面 276\n14.3.2 将现有应用程序集成到复合视图中 277\n14.3.3 多方显示站点和Fowler的两步视图 278\n14.4 小结 280\n第15章 用户交互 281\n15.1 MVC体系结构 282\n15.1.1 拨开MVC的迷雾 283\n15.1.2 定义基本概念 284\n15.1.3 命令还是操作 286\n15.1.4 Web MVC不是富客户MVC 286\n15.2 Web命令模式 287\n15.2.1 工作原理 288\n15.2.2 命令标识符 288\n15.2.3 Web处理程序 289\n15.2.4 命令执行器 289\n15.3 保持实现简单 290\n15.3.1 示例：“原生的”Web应用程序 290\n15.3.2 引入命令函数 292\n15.4 小结 294\n第16章 控制器 296\n16.1 控制器和请求对象 297\n16.1.1 基本请求对象 297\n16.1.2 安全问题 298\n16.2 使用页面控制器 299\n16.2.1 简单示例 300\n16.2.2 从页面控制器选择视图 301\n16.2.3 让命令可进行单元测试 302\n16.2.4 避免HTML输出 303\n16.2.5 使用模板 303\n16.2.6 重定向问题 304\n16.3 构建前端控制器 307\n16.3.1 一个命令一个类的Web处理程序 307\n16.3.2 命令还需要些什么 308\n16.3.3 使用命令组 309\n16.3.4 有多个提交按钮的表单 310\n16.3.5 用JavaScript生成命令 311\n16.3.6 用于复合视图的控制器 311\n16.4 小结 312\n第17章 输入验证 314\n17.1 应用程序设计中的输入验证 315\n17.1.1 验证和应用程序体系结构 315\n17.1.2 验证策略 316\n17.1.3 命名表单组件 317\n17.2 服务器端验证及其问题 317\n17.2.1 重复问题 318\n17.2.2 样式问题 318\n17.2.3 测试和页面导航问题 319\n17.2.4 我们能解决多少问题 319\n17.3 客户端验证 320\n17.3.1 普通的乏味的客户端验证 320\n17.3.2 逐个验证字段 321\n17.3.3 你做不到这一点 323\n17.3.4 表单 326\n17.4 面向对象的服务器端验证 327\n17.4.1 规则和验证程序 328\n17.4.2 安全的请求对象体系结构 329\n17.4.3 现在验证非常简单 333\n17.4.4 让其变得简单的类 334\n17.4.5 使用Specification对象 336\n17.4.6 知识丰富的设计 339\n17.4.7 向外观添加验证 340\n17.5 同步服务器端和客户端验证 341\n17.5.1 表单生成器 342\n17.5.2 配置文件 342\n17.5.3 从客户端验证生成服务器端验证 343\n17.6 小结 343\n第18章 表单处理 345\n18.1 用HTML_QuickForm设计解决方案 345\n18.1.1 最小需求和设计 346\n18.1.2 将生成的元素放到HTML表单中 346\n18.1.3 找到抽象 347\n18.1.4 更为具体的需求 348\n18.1.5 选择问题 349\n18.2 实现解决方案 350\n18.2.1 包装HTML_QuickForm元素 350\n18.2.2 输入控件 351\n18.2.3 哪个类创建表单控件 354\n18.2.4 验证 355\n18.2.5 在模板中使用表单对象 357\n18.2.6 下一步做什么 359\n18.3 小结 359\n第19章 数据库连接、抽象和配置 361\n19.1 数据库抽象 362\n19.1.1 预处理语句 362\n19.1.2 面向对象的数据库查询 364\n19.2 装饰和适配数据库资源对象 366\n19.2.1 简单的可配置数据库连接 366\n19.2.2 从结果集制作与SPL兼容的迭代器 367\n19.3 让数据库连接可用 369\n19.3.1 单例和类似模式 370\n19.3.2 服务定位器和注册表 371\n19.4 小结 373\n第四部分 数据库和基础结构\n第20章 对象和SQL 376\n20.1 对象-关系阻抗不匹配 376\n20.2 封装和隐藏SQL 378\n20.2.1 基本示例 378\n20.2.2 在SQL语句中替换字符串 379\n20.3 通用化SQL 383\n20.3.1 列的列表和表名 383\n20.3.2 使用SQL别名 386\n20.3.3 生成INSERT、UPDATE和DELETE语句 386\n20.3.4 查询对象 390\n20.3.5 适用的设计模式 391\n20.4 小结 391\n第21章 数据类设计 392\n21.1 最简单的方法 392\n21.1.1 用Finder类检索数据 393\n21.1.2 主要程序：表数据网关 395\n21.2 让对象自身持久化 400\n21.2.1 自我持久化的查找器 401\n21.2.2 让对象存储自己 405\n21.3 数据映射器模式 406\n21.3.1 数据映射器和DAO 406\n21.3.2 这些模式无甚差别 408\n21.3.3 模式小结 409\n21.4 实际使用效果 409\n21.4.1 模式在典型Web应用程序中的效果 410\n21.4.2 优化查询 411\n21.5 小结 411\n附录A 测试工具和小技巧 412\n附录B 安全 420\n参考文献 429",
      pages: "444",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4101120.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4101120.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4101120.jpg"
      },
      alt: "https://book.douban.com/subject/4196842/",
      id: "4196842",
      publisher: "人民邮电出版社",
      isbn10: "7115217459",
      isbn13: "9787115217455",
      title: "PHP实战",
      url: "https://api.douban.com/v2/book/4196842",
      alt_title: "PHP in Action: Objects, Design, Agility",
      author_intro:
        "Dagfinn Reiersøl 资深软件咨询师，有10年以上的从业经验，设计并开发了Web应用程序、Web内容挖掘软件、Web编程工具以及文本分析程序，其中绝大多数都是针对PHP的。他居住在挪威奥斯陆。\nMarcus Baker 资深软件咨询师，多年来一直从事面向对象设计和开发以及Web程序开发和测试方面的工作。他同时也是PHP Architecture Magazine的专栏作家。\nChris Shiflett  PHP软件咨询师、安全专家以及PHP社区的领军人物。他是PHP安全协会的奠基者，也是HTTP Developer’s Handbook和Essential PHP Security两本图书的作者。",
      summary:
        "“对于那些想要在PHP方面更进一步的开发者而言，此书必不可少。”\n——Gabriel Malkas， Developpez.com\n“简而言之，这是我所读过的关于面向对象编程和PHP最好的图书。……强烈推荐此书，绝不要错过！”\n——Amazon评论\n“此书是理论与实践的完美融合，到目前为止，其他任何图书都无法与它相媲美。如果5颗星是满分，它完全值得10颗星!”\n——Amazon评论\n近几年，PHP的发展突飞猛进，业已超越Java和ASP，成为目前最流行的Web开发语言。而随着PHP 5的发布和Zend框架项目的应用，PHP和敏捷思想、设计模式以及单元测试的联姻成为主流话题。\n本书首先介绍了面向对象设计的原则、模式和技巧，然后讲述了如何在PHP上利用其语法和特性，处理和实施这些原则、模式和技巧，并应用于Web编程中遇到的难题上。通过作者生动的叙述，读者可以学习到先进的面向对象实践、理论和技巧，对PHP有更深层、更透彻的理解，极大地提升自己面向对象设计和编程能力。",
      price: "69.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 98,
        average: "7.1",
        min: 0
      },
      subtitle: "",
      author: ["W. Jason Gilmore"],
      pubdate: "2009-06-01",
      tags: [
        {
          count: 132,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 75,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 46,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 20,
          name: "编程",
          title: "编程"
        },
        {
          count: 18,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 15,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 10,
          name: "Web",
          title: "Web"
        },
        {
          count: 8,
          name: "软件开发",
          title: "软件开发"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s3747918.jpg",
      binding: "",
      translator: ["朱涛江等"],
      catalog:
        "第1章 php概述  1\n1.1 历史 1\n1.1.1 php 4 2\n1.1.2 php 5 3\n1.1.3 php 6 4\n1.2 一般语言特性 4\n1.2.1 实用性 4\n1.2.2 强大功能 5\n1.2.3 可能性 5\n1.2.4 成本 6\n1.3 小结 6\n第2章 环境配置 7\n2.1 安装的前提条件 7\n2.1.1 下载apache 8\n2.1.2 下载php 8\n2.1.3 获得文档 9\n2.2 在linux上安装apache和php 9\n2.3 在windows上安装apache和php 11\n2.4 在windows上安装iis和php 12\n2.4.1 安装iis和php 13\n2.4.2 配置fastcgi来管理php进程 13\n2.5 测试安装 14\n2.6 配置php 16\n2.6.1 在linux上构建时配置php 16\n2.6.2 定制windows构建 16\n2.7 运行时配置 16\n2.7.1 管理php的配置指令 17\n2.7.2 php的配置指令 18\n2.8 选择代码编辑器 29\n2.8.1 adobe dreamweaver cs3 29\n2.8.2 notepad++ 30\n2.8.3 pdt 30\n2.8.4 zend studio 30\n2.9 选择web托管服务提供商 31\n2.10 小结 32\n第3章 php基础 33\n3.1 在web页面中嵌入php代码 33\n3.1.1 默认语法 33\n3.1.2 短标记 34\n3.1.3 脚本 34\n3.1.4 asp风格 35\n3.1.5 嵌入多个代码块 35\n3.2 为代码添加注释 35\n3.2.1 单行c++语法 35\n3.2.2 shell语法 36\n3.2.3 多行c语法 36\n3.3 向浏览器输出数据 36\n3.3.1 print()语句 37\n3.3.2 printf()语句 38\n3.3.3 sprintf() 39\n3.4 php支持的数据类型 39\n3.4.1 标量数据类型 39\n3.4.2 复合数据类型 40\n3.4.3 使用类型强制转换实现数据类型间的转换 41\n3.4.4 类型自动转换 42\n3.4.5 与类型有关的函数 43\n3.4.6 类型标识符函数 43\n3.5 标识符 44\n3.6 变量 45\n3.6.1 变量声明 45\n3.6.2 变量作用域 46\n3.6.3 php的超级全局变量 49\n3.6.4 变量的变量 52\n3.7 常量 53\n3.8 表达式 53\n3.8.1 操作数 53\n3.8.2 操作符 54\n3.9 字符串插入 58\n3.9.1 双引号 58\n3.9.2 单引号 59\n3.9.3 heredoc 60\n3.10 控制结构 60\n3.10.1 条件语句 61\n3.10.2 循环语句 63\n3.10.3 文件包含语句 67\n3.11 小结 69\n第4章 函数 70\n4.1 调用函数 70\n4.2 创建函数 71\n4.2.1 按值传递参数 71\n4.2.2 按引用传递参数 72\n4.2.3 默认参数值 73\n4.2.4 从函数返回值 74\n4.2.5 递归函数 75\n4.3 函数库 77\n4.4 小结 78\n第5章 数组 79\n5.1 什么是数组 79\n5.2 创建数组 80\n5.2.1 用array()创建数组 81\n5.2.2 用list()提取数组 81\n5.2.3 用预定义的值范围填充数组 82\n5.2.4 测试数组 83\n5.3 添加和删除数组元素 84\n5.3.1 在数组头添加元素 84\n5.3.2 在数组尾添加元素 84\n5.3.3 从数组头删除值 84\n5.3.4 从数组尾删除元素 85\n5.4 定位数组元素 85\n5.4.1 搜索数组 85\n5.4.2 获取数组键 86\n5.4.3 获取数组值 86\n5.5 遍历数组 87\n5.5.1 获取当前数组键 87\n5.5.2 获取当前数组值 87\n5.5.3 获取当前数组键和值 88\n5.5.4 移动数组指针 88\n5.5.5 向函数传递数组值 89\n5.6 确定数组的大小和唯一性 90\n5.6.1 确定数组的大小 90\n5.6.2 统计数组元素出现的频度 91\n5.6.3 确定唯一的数组元素 91\n5.7 数组排序 91\n5.7.1 逆置数组元素顺序 91\n5.7.2 置换数组键和值 92\n5.7.3 数组排序 92\n5.8 合并、拆分、接合和分解数组 96\n5.8.1 合并数组 96\n5.8.2 递归追加数组 97\n5.8.3 连接两个数组 97\n5.8.4 拆分数组 97\n5.8.5 接合数组 98\n5.8.6 求数组的交集 99\n5.8.7 求关联数组的交集 100\n5.8.8 求数组的差集 100\n5.8.9 求关联数组的差集 100\n5.9 其他有用的数组函数 101\n5.9.1 返回一组随机的键 101\n5.9.2 随机洗牌数组元素 101\n5.10 小结 103\n第6章 面向对象的php 104\n6.1 oop的好处 104\n6.1.1 封装 104\n6.1.2 继承 105\n6.1.3 多态 105\n6.2 关键的oop概念 106\n6.2.1 类 106\n6.2.2 对象 107\n6.2.3 字段 107\n6.2.4 属性 109\n6.2.5 常量 112\n6.2.6 方法 112\n6.3 构造函数和析构函数 116\n6.3.1 构造函数 116\n6.3.2 析构函数 118\n6.4 静态类成员 119\n6.5 instanceof关键字 120\n6.6 辅助函数 120\n6.7 自动加载对象 122\n6.8 小结 122\n第7章 高级oop特性 123\n7.1 php不支持的高级oop特性 123\n7.2 对象克隆 124\n7.2.1 克隆示例 124\n7.2.2 __clone()方法 125\n7.3 继承 126\n7.3.1 类继承 127\n7.3.2 继承和构造函数 128\n7.4 接口 130\n7.4.1 实现一个接口 131\n7.4.2 实现多个接口 132\n7.5 抽象类 132\n7.6 命名空间介绍 133\n7.7 小结 135\n第8章 错误和异常处理 136\n8.1 配置指令 136\n8.2 错误日志 138\n8.3 异常处理 140\n8.3.1 为什么异常处理很方便 141\n8.3.2 php的异常处理实现 142\n8.4 小结 146\n第9章 字符串和正则表达式 147\n9.1 正则表达式 147\n9.1.1 正则表达式语法（posix） 147\n9.1.2 php的正则表达式函数（posix扩展） 149\n9.1.3 正则表达式语法（perl风格） 152\n9.2 其他字符串函数 158\n9.2.1 确定字符串长度 158\n9.2.2 比较两个字符串 158\n9.2.3 处理字符串大小写 160\n9.2.4 字符串与html相互转换 161\n9.3 正则表达式函数的替代函数 165\n9.3.1 填充和剔除字符串 171\n9.3.2 字符和单词计数 172\n9.4 使用pear：validate_us 174\n9.4.1 安装validate_us 174\n9.4.2 使用validate_us 175\n9.5 小结 175\n第10章 处理文件和操作系统 176\n10.1 了解文件和目录 176\n10.1.1 解析目录路径 176\n10.1.2 计算文件、目录和磁盘大小 178\n10.1.3 确定访问和修改时间 181\n10.2 文件处理 182\n10.2.1 资源的概念 182\n10.2.2 换行 182\n10.2.3 识别文件末尾字符 182\n10.2.4 打开和关闭文件 183\n10.2.5 读取文件 184\n10.2.6 将字符串写入文件 189\n10.2.7 移动文件指针 190\n10.2.8 读取目录内容 190\n10.3 执行shell命令 191\n10.4 系统级程序执行 193\n10.4.1 清理输入 193\n10.4.2 php的程序执行函数 194\n10.5 小结 196\n第11章 pear 197\n11.1 流行的pear包 197\n11.1.1 预安装的包 197\n11.1.2 安装程序建议的包 198\n11.2 pear的强大功能：数值格式转换 198\n11.3 安装和更新pear 199\n11.3.1 安装pear 199\n11.3.2 pear和托管公司 200\n11.3.3 更新pear 200\n11.4 使用pear包管理器 201\n11.4.1 查看安装的pear包 201\n11.4.2 了解pear安装包的更多信息 201\n11.4.3 安装pear包 202\n11.4.4 将包包含到脚本中 203\n11.4.5 升级pear包 204\n11.4.6 卸载包 204\n11.4.7 降级pear包 205\n11.5 小结 205\n第12章 日期和时间 206\n12.1 unix时间戳 206\n12.2 php的日期和时间库 206\n12.2.1 验证日期 207\n12.2.2 格式化日期和时间 207\n12.2.3 将时间戳转换为用户友好的值 210\n12.2.4 处理时间戳 211\n12.3 日期函数 212\n12.3.1 显示本地化的日期和时间 212\n12.3.2 显示网页的最新修改日期 215\n12.3.3 确定当前月份中的天数 216\n12.3.4 确定任意给定月份的天数 216\n12.3.5 计算当前日期后x天的日期 216\n12.3.6 利用pear：创建日历 217\n12.4 为php 5.1+用户提供的日期时间改进 219\n12.4.1 datetime构造函数简介 220\n12.4.2 格式化日期 220\n12.4.3 实例化后设置日期 220\n12.4.4 实例化后设置时间 221\n12.4.5 修改日期和时间 221\n12.5 小结 221\n第13章 表单 222\n13.1 php和web表单 222\n13.1.1 简单示例 223\n13.1.2 向函数传递表单数据 224\n13.1.3 处理多值表单组件 225\n13.2 充分利用pear: html_quickform 226\n13.2.1 安装html_quickform 227\n13.2.2 创建一个简单的表单 227\n13.2.3 使用自动完成 231\n13.3 小结 232\n第14章 身份验证 233\n14.1 http验证概念 233\n14.2 php验证 234\n14.2.1 验证变量 234\n14.2.2 有用的函数 235\n14.3 php验证方法 236\n14.3.1 硬编码的身份验证 236\n14.3.2 基于文件的身份验证 236\n14.3.3 基于数据库的身份验证 238\n14.3.4 基于ip的身份验证 239\n14.3.5 利用pear：auth_http 241\n14.4 用户登录管理 243\n14.4.1 用cracklib库测试密码易猜性 243\n14.4.2 一次性url和密码恢复 245\n14.5 小结 247\n第15章 处理文件上传 248\n15.1 通过http协议上传文件 248\n15.2 通过php上传文件 249\n15.2.1 php的文件上传/资源指令 249\n15.2.2 $_files数组 250\n15.2.3 php的文件上传函数 251\n15.2.4 上传错误消息 252\n15.2.5 一个简单的示例 252\n15.3 利用pear：http_upload 253\n15.3.1 安装http_upload 253\n15.3.2 上传文件 254\n15.3.3 了解关于上传文件的更多信息 254\n15.3.4 上传多个文件 255\n15.4 小结 256\n第16章 网络 257\n16.1 dns、服务器和服务 257\n16.1.1 dns 257\n16.1.2 服务 261\n16.1.3 建立套接字连接 261\n16.2 邮件 263\n16.2.1 配置指令 263\n16.2.2 使用php脚本发送电子邮件 264\n16.3 常见网络任务 268\n16.3.1 连接服务器 269\n16.3.2 创建端口扫描器 269\n16.3.3 创建子网转换器 270\n16.3.4 测试用户带宽 272\n16.4 小结 273\n第17章 php和ldap 274\n17.1 在php中使用ldap.. 275\n17.1.1 连接到ldap服务器 275\n17.1.2 获取ldap数据 277\n17.1.3 统计所获取的项 280\n17.1.4 排序ldap记录 281\n17.1.5 插入ldap数据 281\n17.1.6 更新ldap数据 282\n17.1.7 删除ldap数据 283\n17.1.8 处理区分名 283\n17.1.9 错误处理 284\n17.2 小结 285\n第18章 会话处理器 286\n18.1 什么是会话处理 286\n18.2 配置指令 288\n18.2.1 管理会话存储介质 288\n18.2.2 设置会话文件路径 288\n18.2.3 自动启用会话 288\n18.2.4 设置会话名称 289\n18.2.5 选择cookie或url重写 289\n18.2.6 自动进行url重写 289\n18.2.7 设置会话cookie的生存期 289\n18.2.8 设置会话cookie的有效url路径 289\n18.2.9 为启用会话的页面设置缓存方向 290\n18.3 处理会话 291\n18.3.1 开始会话 291\n18.3.2 销毁会话 291\n18.3.3 设置和获取会话id 292\n18.3.4 创建和删除会话变量 292\n18.3.5 编码和解码会话数据 293\n18.4 实际的会话处理示例 294\n18.4.1 以返回用户的身份自动登录 294\n18.4.2 生成最近浏览的文档索引 296\n18.5 创建定制会话处理器 297\n18.5.1 将定制会话函数加入到php逻辑 298\n18.5.2 基于mysql的定制会话处理器 298\n18.6 小结 302\n第19章 用smarty模板化 303\n19.1 什么是模板化引擎 303\n19.2 smarty介绍 305\n19.3 安装smarty 305\n19.4 使用smarty 306\n19.5 smarty的表现逻辑 308\n19.5.1 注释 308\n19.5.2 变量修饰符 308\n19.5.3 控制结构 311\n19.5.4 语句 315\n19.6 创建配置文件 317\n19.6.1 config_load 317\n19.6.2 引用配置变量 317\n19.7 结合smarty使用css 318\n19.8 缓存 319\n19.8.1 处理缓存生命期 320\n19.8.2 通过is_cached()消除处理开销 320\n19.8.3 为每个模板创建多个缓存 321\n19.8.4 关于缓存的结束语 322\n19.9 小结 322\n第20章 web服务 323\n20.1 为什么使用web服务 323\n20.2 rss 324\n20.2.1 理解rss语法 326\n20.2.2 magpierss介绍 327\n20.3 simplexml 334\n20.3.1 加载xml 335\n20.3.2 解析xml 336\n20.4 soap 339\n20.4.1 soap消息介绍 339\n20.4.2 php的soap扩展介绍 340\n20.5 小结 346\n第21章 安全php编程 347\n21.1 安全地配置php 347\n21.1.1 安全模式 347\n21.1.2 其他与安全有关的配置参数 349\n21.2 隐藏配置细节 351\n21.2.1 隐藏apache 351\n21.2.2 隐藏php 351\n21.3 隐藏敏感数据 352\n21.3.1 隐藏文档根目录 353\n21.3.2 拒绝访问某些文件扩展名 353\n21.4 清理用户数据 353\n21.4.1 文件删除 354\n21.4.2 跨网站脚本 354\n21.4.3 清理用户输入：解决方案 355\n21.4.4 利用pear：validate 357\n21.5 数据加密 359\n21.5.1 php的加密函数 359\n21.5.2 mcrypt包 361\n21.6 小结 362\n第22章 sqlite 363\n22.1 sqlite介绍 363\n22.1.1 安装sqlite 363\n22.1.2 使用sqlite命令行界面 364\n22.2 php的sqlite库 365\n22.2.1 sqlite.assoc_case=o",
      pages: "620",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s3747918.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s3747918.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s3747918.jpg"
      },
      alt: "https://book.douban.com/subject/3693851/",
      id: "3693851",
      publisher: "人民邮电出版社",
      isbn10: "7115189099",
      isbn13: "9787115189097",
      title: "PHP与MySQL程序设计",
      url: "https://api.douban.com/v2/book/3693851",
      alt_title: "",
      author_intro:
        "W. Jason Gilmore，世界知名的软件技术专家，CodeMash技术大会创始人之一，MySQL全球技术大会顾问委员会成员。他曾负责Apress出版公司开源图书出版项目，开发了大量PHP和MySQL应用程序，并在各大专业媒体发表了众多有影响的技术文章。他的个人网站是http://www.wjgilmore.com。",
      summary:
        "PHP语言和MySQL数据库这两种开源技术已经成为开发Web应用的最佳组合。Web 2.0为它们提供了更广阔的天地。\n本书是久负盛名的经典著作，以内容全面、讲解翔实而著称。书中对主题的选取和组织从实用出发，在讲述知识之外还加入了作者多年积累的宝贵实战经验，并提供了500多个可以直接用于实际项目的代码示例，充分体现了作者深厚的开发功力。这一版不仅对原有章节进行了全面的修订、更新和改进，还加入了PHP 6和MySQL最新版本中的新特性，包括如何利用国际化和本地化开源工具创建面向全世界的Web网站，开发强大Web应用的利器MVC模式与Zend框架。\n本书不仅适合初中级程序员快速入门提高，也是有经验程序员必备的参考书。\n作者为本书专门开设了配套网站http://www.beginningphpandmysql.com，也可以通过Twitter（http://twitter.com/begphpandmysql）了解更多信息。",
      series: {
        id: "28503",
        title: "图灵程序设计丛书·Web开发系列"
      },
      price: "89.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 58,
        average: "8.1",
        min: 0
      },
      subtitle: "",
      author: ["W. Jason Gilmore"],
      pubdate: "2011-06-01",
      tags: [
        {
          count: 82,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 55,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 25,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 18,
          name: "Web",
          title: "Web"
        },
        {
          count: 16,
          name: "编程",
          title: "编程"
        },
        {
          count: 13,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 6,
          name: "开发",
          title: "开发"
        },
        {
          count: 5,
          name: "技术",
          title: "技术"
        }
      ],
      origin_title: "Beginning PHP and MySQL, 4th Ed.",
      image: "https://img3.doubanio.com/view/subject/m/public/s6485296.jpg",
      binding: "平装",
      translator: ["朱涛江"],
      catalog:
        "第1 章  PHP 概述　　1\n1.1  历史　　 1\n1.1.1  PHP 4　　2\n1.1.2  PHP 5　　 3\n1.1.3  PHP 5.3　　4\n1.1.4  PHP 6　　 4\n1.2  一般语言特性　　4\n1.2.1  实用性　　4\n1.2.2  强大功能　　 5\n1.2.3  可选择性　　 5\n1.2.4   成本　　6\n1.3  小结　　6\n第2 章  环境配置　　7\n2.1  安装的前提条件　　7\n2.1.1  下载Apache　　8\n2.1.2  下载PHP　　　8\n2.1.3  下载文档　　　 9\n2.2  在Linux 上安装Apache 和PHP　　 9\n2.3  在Windows 上安装Apache 和PHP 　　11\n2.4  在Windows 上安装IIS 和PHP　　 12\n2.5  测试安装　　13\n2.6  配置PHP　　14\n2.6.1  在Linux 上构建时配置PHP　　 14\n2.6.2  定制Windows 构建　　 15\n2.7  运行时配置　　15\n2.7.1  管理PHP 的配置指令　　15\n2.7.2  PHP 的配置指令　　17\n2.8  选择代码编辑器　　28\n2.8.1   Adobe Dreamweaver CS5 　　 28\n2.8.2  Notepad++　　 28\n2.8.3  PDT 　　28\n2.8.4  Zend Studio 　　29\n2.9  选择Web 托管服务提供商　　 29\n2.10  小结　　30\n第3 章  PHP 基础　　31\n3.1  在Web 页面中嵌入PHP 代码　　 31\n3.1.1  默认语法　　31\n3.1.2  短标签　　32\n3.1.3  脚本　　33\n3.1.4  ASP 风格　　33\n3.1.5  嵌入多个代码块　　33\n3.2  为代码添加注释　　33\n3.2.1  单行C++语法　　33\n3.2.2  shell 语法　　34\n3.2.3  多行C 语法　　34\n3.3  向浏览器输出数据　　35\n3.3.1  print()语句　　35\n3.3.2  echo()语句　　35\n3.3.3  printf()语句　　36\n3.3.4  sprintf() 　　37\n3.4  PHP 支持的数据类型　　37\n3.4.1  标量数据类型　　 38\n3.4.2  复合数据类型　　39\n3.4.3  使用类型强制转换实现数据类型间的转换　　40\n3.4.4  类型自动转换　　41\n3.4.5  与类型有关的函数　　41\n3.4.6  类型标识符函数　　42\n3.5  标识符　　42\n3.6  变量　　43\n3.6.1  变量声明　　43\n3.6.2  变量作用域　　44\n3.6.3  PHP 的超级全局变量　　 47\n3.6.4  变量的变量　　50\n3.7  常量　　51\n3.8  表达式　　51\n3.8.1  操作数　　52\n3.8.2  操作符　　52\n3.9  字符串插入　　 56\n3.9.1  双引号　　57\n3.9.2  转义序列　　　57\n3.9.3  单引号　　58\n3.9.4  大括号　　58\n3.9.5  heredoc 　　58\n3.9.6  Nowdoc 　　59\n3.10  控制结构　　59\n3.10.1  条件语句　　 59\n3.10.2  循环语句　　61\n3.10.3  文件包含语句　　65\n3.11  小结　　67\n第4 章  函数　　　68\n4.1  调用函数　　　68\n4.2  创建函数　　　 69\n4.2.1  按值传递参数　　69\n4.2.2  按引用传递参数　　70\n4.2.3  默认参数值　　 71\n4.2.4  使用类型提示　　72\n4.2.5  从函数返回值　　72\n4.2.6  递归函数　　73\n4.3  函数库　　75\n4.4  小结　　76\n第5 章  数组　　77\n5.1  什么是数组　　　 77\n5.2  创建数组　　 78\n5.2.1  用array()创建数组　　 79\n5.2.2  用list()提取数组　　 79\n5.2.3  用预定义的值范围填充数组　　 80\n5.2.4  测试数组　　 81\n5.3  输出数组　　 81\n5.4  添加和删除数组元素　　 82\n5.4.1  在数组头添加元素　　 83\n5.4.2  在数组尾添加元素　　83\n5.4.3  从数组头删除元素　　 83\n5.4.4  从数组尾删除元素　　 83\n5.5  定位数组元素　　84\n5.5.1  搜索数组　　84\n5.5.2  获取数组键　　85\n5.5.3  获取数组值　　85\n5.6  遍历数组　　85\n5.6.1  获取当前数组键　　86\n5.6.2  获取当前数组值　　86\n5.6.3  获取当前数组键和值　　 86\n5.6.4  移动数组指针　　 87\n5.6.5  向函数传递数组值　　 87\n5.7  确定数组的大小和唯一性　　88\n5.7.1  确定数组的大小　　 89\n5.7.2  统计数组元素出现的频度　　 89\n5.7.3  确定唯一的数组元素　　 89\n5.8  数组排序　　 90\n5.8.1  逆置数组元素顺序　　90\n5.8.2  置换数组键和值　　90\n5.8.3  数组排序　　91\n5.9  合并、拆分、接合和分解数组　　95\n5.9.1  合并数组　　95\n5.9.2  递归追加数组　　95\n5.9.3  合并两个数组　　96\n5.9.4  拆分数组　　 96\n5.9.5  接合数组　　 97\n5.9.6  求数组的交集　　98\n5.9.7  求关联数组的交集　　98\n5.9.8  求数组的差集　　99\n5.9.9  求关联数组的差集　　99\n5.10  其他有用的数组函数　　100\n5.10.1  返回一组随机的键　　 100\n5.10.2  随机洗牌数组元素　　 100\n5.11  小结　　102\n第6 章  面向对象的PHP　　103\n6.1  OOP 的好处　　103\n6.1.1  封装　　103\n6.1.2  继承　　104\n6.1.3  多态　　104\n6.2  关键的OOP 概念　　104\n6.2.1  类　　104\n6.2.2  对象　　105\n6.2.3  属性　　106\n6.2.4  常量　　110\n6.2.5  方法　　111\n6.3  构造函数和析构函数　　114\n6.3.1  构造函数　　114\n6.3.2  析构函数　　116\n6.4  静态类成员　　117\n6.5  instanceof 关键字　　118\n6.6  辅助函数　　118\n6.7  自动加载对象　　 120\n6.8  小结　　120\n第7 章  高级OOP 特性　　121\n7.1  PHP 不支持的高级OOP 特性　　121\n7.2  对象克隆　　122\n7.2.1  克隆示例　　122\n7.2.2  __clone()方法　　123\n7.3  继承　　124\n7.3.1  类继承　　124\n7.3.2  继承和构造函数　　126\n7.3.3  继承与延迟静态绑定　　 127\n7.4  接口　　128\n7.4.1  实现一个接口　　129\n7.4.2  实现多个接口　　130\n7.5  抽象类　　131\n7.6  命名空间介绍　　131\n7.7  小结　　133\n第8 章  错误和异常处理　　134\n8.1  配置指令　　134\n8.2  错误日志　　137\n8.3  异常处理　　139\n8.3.1  为什么异常处理很方便　　 139\n8.3.2  PHP 的异常处理实现　　 140\n8.3.3  SPL 异常　　144\n8.4  小结　　145\n第9 章  字符串和正则表达式　　146\n9.1  正则表达式　　146\n9.1.1  正则表达式语法（POSIX）　　147\n9.1.2  PHP 的正则表达式函数（POSIX扩展） 　　148\n9.1.3  正则表达式语法（Perl 风格） 　　 151\n9.2  其他字符串函数　　157\n9.2.1  确定字符串长度　　157\n9.2.2  比较两个字符串　　158\n9.2.3  处理字符串大小写　　159\n9.2.4  字符串与HTML 相互转换 　　161\n9.3  正则表达式函数的替代函数　　 165\n9.3.1  填充和剔除字符串　　 170\n9.3.2  统计字符和单词个数　　 171\n9.4  使用PEAR：Validate_US　　 173\n9.4.1  安装Validate_US　　 174\n9.4.2  使用Validate_US　　 174\n9.5  小结　　175\n第10 章  处理文件和操作系统　　 176\n10.1 了 解文件和目录　　176\n10.1.1  解析目录路径　　176\n10.1.2  计算文件、目录和磁盘大小　　 178\n10.1.3  确定访问和修改时间　　 180\n10.2  文件处理　　182\n10.2.1  资源的概念　　182\n10.2.2  识别换行符　　182\n10.2.3  识别文件末尾字符　　 182\n10.2.4  打开和关闭文件　　182\n10.2.5  读取文件　　184\n10.2.6  将字符串写入文件　　 189\n10.2.7  移动文件指针　　189\n10.2.8  读取目录内容　　190\n10.3  执行shell 命令　　191\n10.4  系统级程序执行　　192\n10.4.1  清理输入　　193\n10.4.2  PHP 的程序执行函数　　 194\n10.5  小结　　196\n第11 章  PEAR　　197\n11.1  PEAR 的强大功能：数值格式转换　　 197\n11.2  安装和更新PEAR　　198\n11.2.1  安装PEAR　　198\n11.2.2  PEAR 和托管公司　　199\n11.2.3  更新PEAR　　200\n11.3  使用PEAR 包管理器　　200\n11.3.1  查看安装的PEAR 包　　 200\n11.3.2  了解已安装PEAR 包的更多信息　　200\n11.3.3  安装PEAR 包　　201\n11.3.4  将包包含到脚本中　　 202\n11.3.5  升级PEAR 包　　 203\n11.3.6  卸载包　　203\n11.3.7  降级PEAR 包　　 204\n11.4  Pyrus 介绍　　204\n11.5  小结　　　204\n第12 章  日期和时间　　205\n12.1  UNIX 时间戳　　205\n12.2  PHP 的日期和时间库　　206\n12.2.1  验证日期　　206\n12.2.2  格式化日期和时间　　 206\n12.2.3  将时间戳转换为用户友好的值　　209\n12.2.4  处理时间戳　　 210\n12.3  日期函数　　　211\n12.3.1  显示本地化的日期和时间　　 211\n12.3.2  显示网页的最新修改日期　　 214\n12.3.3  确定当前月份中的天数　　 214\n12.3.4  确定任意给定月份的天数 　　215\n12.3.5  计算当前日期后X 天的日期　　　215\n12.4  为PHP 5.1+用户提供的日期时间改进　　　215\n12.4.1  DateTime 构造函数简介　　 215\n12.4.2  格式化日期　　216\n12.4.3  实例化后设置日期　　 216\n12.4.4  实例化后设置时间　　 217\n12.4.5  修改日期和时间　　217\n12.4.6  计算两个日期之差　　 217\n12.5  小结　　218\n第13 章  处理HTML 表单　　219\n13.1  PHP 和Web 表单　　219\n13.2  验证表单数据　　221\n13.2.1  文件删除　　221\n13.2.2  跨站点脚本攻击　　 221\n13.2.3  清理用户输入　　223\n13.2.4  利用Filter 扩展验证和清理数据　　225\n13.2.5  处理多值表单组件　　 226\n13.3  充分利用PEAR：HTML_QuickForm2　　 227\n13.3.1  安装HTML_QuickForm2　　 227\n13.3.2  创建和验证简单的表单　　 228\n13.4  小结　　 230\n第14 章  身份验证　　231\n14.1  HTTP 验证概念　　231\n14.2  用PHP 验证用户　　233\n14.2.1  PHP 验证变量　　233\n14.2.2  有用的函数　　233\n14.3  PHP 验证方法　　234\n14.3.1  硬编码的身份验证　　 234\n14.3.2  基于文件的身份验证　　 235\n14.3.3  基于数据库的身份验证　　 236\n14.3.4  利用PEAR：Auth_HTTP 　　237\n14.4  用户登录管理　　239\n14.4.1  用CrackLib 库测试密码易猜性　　239\n14.4.2  一次性URL 和密码恢复　　 241\n14.5  小结　　 243\n第15 章  处理文件上传　　244\n15.1  通过HTTP 协议上传文件　　 244\n15.2  通过PHP 上传文件　　245\n15.2.1  PHP 的文件上传/资源指令　　 245\n15.2.2  $_FILES 数组　　246\n15.2.3  PHP 的文件上传函数　　 247\n15.2.4  上传错误消息　　248\n15.2.5  一个简单的示例　　248\n15.3  利用PEAR：HTTP_Upload 　　 249\n15.3.1  安装HTTP_Upload　　 249\n15.3.2  上传文件　　　 250\n15.3.3  了解关于已上传文件的更多信息　　 250\n15.3.4  上传多个文件　　 251\n15.4  小结　　 252\n第16 章  网络　　 253\n16.1  DNS、服务器和服务　　 253\n16.1.1  DNS　　253\n16.1.2  服务　　257\n16.1.3  建立套接字连接　　 257\n16.2  邮件　　259\n16.2.1  配置指令　　259\n16.2.2  使用PHP 脚本发送电子邮件　　260\n16.3  常见网络任务　　264\n16.3.1  连接服务器　　264\n16.3.2  创建端口扫描器　　265\n16.3.3  创建子网转换器　　265\n16.3.4  测试用户带宽　　267\n16.4  小结　　267\n第17 章  PHP 和LDAP　　268\n17.1  在PHP 中使用LDAP　　 269\n17.1.1  为PHP 配置LDAP 　　 269\n17.1.2  连接到LDAP 服务器　　 269\n17.1.3  获取LDAP 数据　　271\n17.1.4  统计所获取的项　　274\n17.1.5  LDAP 记录排序　　 274\n17.1.6  插入LDAP 数据　　 275\n17.1.7  更新LDAP 数据　　276\n17.1.8  删除LDAP 数据　　276\n17.1.9  处理区分名　　277\n17.1.10  错误处理　　278\n17.2  小结　　 279\n第18 章  会话处理程序　　280\n18.1  什么是会话处理　　280\n18.2  配置指令　　281\n18.2.1  管理会话存储介质　　 281\n18.2.2  设置会话文件路径　　 281\n18.2.3  自动启用会话　　　282\n18.2.4  设置会话名称　　　282\n18.2.5  选择cookie 或URL 重写　　 282\n18.2.6  自动URL 重写　　282\n18.2.7  设置会话cookie 的生存期 　　283\n18.2.8  设置会话cookie 的有效URL 路径　　283\n18.2.9  为启用会话的页面设置缓存方向　　 283\n18.3  处理会话　　284\n18.3.1  开始会话　　284\n18.3.2  销毁会话　　285\n18.3.3  设置和获取会话ID　　 285\n18.3.4  创建和删除会话变量　　 285\n18.3.5  编码和解码会话数据　　 286\n18.4  实际的会话处理示例　　288\n18.4.1  以返回用户的身份自动登录 　　288\n18.4.2  生成最近浏览文档的索引 　　290\n18.5  创建定制会话处理程序　　291\n18.5.1  将定制会话函数加入到PHP 逻辑　　292\n18.5.2  使用基于MySQL 的定制会话处理程序　　292\n18.6  小结　　295\n第19 章  用Smarty 模板化　　 296\n19.1  什么是模板化引擎　　296\n19.2  Smarty 介绍　　298\n19.3  安装Smarty　　298\n19.4  使用Smarty　　299\n19.5  Smarty 的表现逻辑　　301\n19.5.1  注释　　301\n19.5.2  变量修饰符　　301\n19.5.3  控制结构　　303\n19.5.4  语句　　307\n19.6  创建配置文件　　309\n19.6.1  config_load　　309\n19.6.2  引用配置变量　　310\n19.7  结合Smarty 使用CSS　　310\n19.8  缓存　　311\n19.8.1  处理缓存生命期　　311\n19.8.2  通过is_cached()消除处理开销　　312\n19.8.3  为每个模板创建多个缓存 　　312\n19.8.4  关于缓存的结束语　　 313\n19.9  小结　　313\n第20 章  Web 服务　　314\n20.1  为什么使用Web 服务　　314\n20.2  RSS　　315\n20.3  SimplePie 介绍　　318\n20.3.1  安装SimplePie 　　318\n20.3.2  用SimplePie 解析提要　　 319\n20.3.3  解析多个提要　　320\n20.4  SimpleXML　　321\n20.4.1  加载XML　　321\n20.4.2  解析XML　　323\n20.5  小结　　325\n第21 章  保护网站安全　　326\n21.1  安全地配置PHP　　 326\n21.2  隐藏配置细节　　 328\n21.2.1  隐藏Apache　　　328\n21.2.2  隐藏PHP 　　329\n21.3  隐藏敏感数据　　　330\n21.3.1  隐藏文档根目录　　330\n21.3.2  拒绝访问某些文件扩展名 　　330\n21.4  数据加密　　331\n21.4.1  PHP 的加密函数　　331\n21.4.2  MCrypt 包　　 332\n21.5  小结　　333\n第22 章  用jQuery 和PHP 创建AJAX增强特性　　334\n22.1  AJAX 介绍　　334\n22.2  jQuery 介绍　　335\n22.2.1  安装jQuery　　 336\n22.2.2  一个简单示例　　　336\n22.2.3  响应事件　　 336\n22.2.4  jQuery 和DOM　　338\n22.3  创建一个用户名存在性验证程序 　　339\n22.4  小结　　342\n第23 章  构建面向全世界的网站　　 343\n23.1  用gettext 翻译网站　　　　 343\n23.1.1  第一步：更新网站脚本　　344\n23.1.2  第二步：创建本地化库　　345\n23.1.3  第三步：创建翻译文件　　345\n23.1.4  第四步：翻译文本　　 346\n23.1.5  第五步：生成二进制文件 　　346\n23.1.6  第六步：在脚本中设置所需语言　　　346\n23.2  本地化日期、数字和时间　　 347\n23.3  小结　　348\n第24 章  Zend 框架介绍　　349\n24.1  MVC 介绍　　349\n24.2  PHP 的框架解决方案　　351\n24.2.1  CakePHP 框架　　351\n24.2.2  Solar 框架　　351\n24.2.3  symfony 框架　　352\n24.2.4  Zend 框架　　352\n24.3  Zend 框架介绍　　352\n24.3.1  安装Zend 框架　　　353\n24.3.2  创建第一个Zend 框架驱动的网站　　353\n24.4  小结　　363\n第25 章  MySQL 介绍　　 364\n25.1  是什么让MySQL 如此流行　　 364\n25.1.1  灵活性　　　364\n25.1.2  强大功能　　　365\n25.1.3  灵活的许可选择　　366\n25.1.4  超级活跃的用户群体　　367\n25.2  MySQL 的演进　　 367\n25.2.1  MySQL 4　　367\n25.2.2  MySQL 5　　 368\n25.2.3  MySQL 5.1　　368\n25.2.4  MySQL 5.4 和5.5　　 369\n25.3  著名的MySQL 用户　　369\n25.3.1  craigslist 　　369\n25.3.2  维基百科　　369\n25.3.3  其他重要用户　　369\n25.4  小结　　370\n第26 章  安装和配置MySQL　　371\n26.1  下载MySQL 　371\n26.2  安装MySQL 　372\n26.2.1  在Linux 上安装MySQL 　　372\n26.2.2  在Windows 上安装并配置MySQL　　 374\n26.3  设置MySQL 管理员密码　　376\n26.4  启动和停止MySQL 　　376\n26.5  配置和优化MySQL 　　377\n26.5.1  mysqld_safe 包装程序　　378\n26.5.2  MySQL 的参数配置和优化 　　378\n26.5.3  my.cnf 文件　　381\n26.6  配置PHP 以便与MySQL 协作　　382\n26.6.1  在Linux 上重新配置PHP　　382\n26.6.2  在Windows 上重新配置PHP　　　 383\n26.7  小结　　　383\n第27 章  MySQL 客户端　　384\n27.1  命令行客户端介绍　　384\n27.1.1  mysql 客户端　　384\n27.1.2  mysqladmin 客户端　　391\n27.1.3  其他有用的客户端　　 392\n27.1.4  客户端选项　　 395\n27.2  MySQL 的GUI 客户程序　　 397\n27.3  phpMyAdmin　　　398\n27.4  小结　　　399\n第28 章  MySQL 存储引擎和数据类型　　 400\n28.1  存储引擎　　400\n28.1.1  MyISAM　　401\n28.1.2  IBMDB2I 　　 402\n28.1.3  InnoDB　　 403\n28.1.4  MEMORY　　403\n28.1.5  MERGE　　404\n28.1.6  FEDERATED　　　 404\n28.1.7  ARCHIVE　　 405\n28.1.8  CSV　　406\n28.1.9  EXAMPLE　　 406\n28.1.10  BLACKHOLE　　406\n28.1.11  存储引擎的常见问题　　 406\n28.2  数据类型和属性　　407\n28.2.1  数据类型　　 407\n28.2.2  数据类型属性　　411\n28.3  处理数据库和表　　 414\n28.3.1  处理数据库　　 414\n28.3.2  处理表　　 415\n28.3.3  更改表结构　　 417\n28.3.4  INFORMATION_SCHEMA　　 417\n28.4  小结　　　 420\n第29 章  保护MySQL 的安全　　 421\n29.1  首先应当做什么　　421\n29.2  保护mysqld 守护进程　　　422\n29.3  MySQL 访问权限系统　　　423\n29.3.1 权限系统的工作方式　　 　423\n29.3.2  访问信息存储在哪里　　　 424\n29.4  用户和权限管理　　　431\n29.4.1  创建用户　　　432\n29.4.2  删除用户　　　432\n29.4.3  重命名用户　　　432\n29.4.4  GRANT 和REVOKE 命令 　　432\n29.4.5  查看权限　　　437\n29.5  限制用户资源　　　437\n29.6  保护MySQL 连接　　 437\n29.6.1  授权选项　　 438\n29.6.2  SSL 选项　　439\n29.6.3  启动启用SSL 的MySQL服务器　　 440\n29.6.4  使用启用SSL 的客户端进行连接　　440\n29.6.5  在my.cnf 文件中存储SSL 选项　　440\n29.7  小结　　　441\n第30 章  结合使用PHP 与MySQL　　442\n30.1  进行安装的预备工作　　 443\n30.1.1  在Linux/UNIX 中启用mysqli 扩展　　　 443\n30.1.2  在Windows 中启用mysqli扩展　　　443\n30.1.3  使用MySQL 本地驱动程序　　443\n30.1.4  管理用户权限　　　443\n30.1.5  处理示例数据　　　444\n30.2  使用mysqli 扩展　　　444\n30.2.1  建立和断开连接　　　444\n30.2.2  处理连接错误　　　445\n30.2.3  获得错误信息　　　445\n30.2.4  在单独的文件中存储连接信息　　　446\n30.2.5  保护连接信息　　447\n30.3  与数据库交互　　447\n30.3.1  向数据库发送查询　　 447\n30.3.2  解析查询结果　　449\n30.3.3  确定所选择的行和受影响的行　　　450\n30.3.4  处理准备语句　　451\n30.4  执行数据库事务　　455\n30.4.1  启用自动提交模式　　 455\n30.4.2  提交事务　　 455\n30.4.3  回滚事务　　456\n30.5  小结　　　456\n第31 章  PDO 介绍　　457\n31.1  为什么还要另一种数据库抽象层 　　458\n31.2  使用PDO　　 458\n31.2.1  安装PDO　　 459\n31.2.2  PDO 的数据库选项　　459\n31.2.3  连接到数据库服务器并选择数据库　　460\n31.2.4  错误处理　　461\n31.2.5  获取和设置属性　　 463\n31.2.6  查询执行　　463\n31.2.7  准备语句介绍　　464\n31.2.8  获取数据　　467\n31.2.9  设置绑定列　　469\n31.2.10  处理事务　　470\n31.3  小结　　470\n第32 章  存储例程　　 471\n32.1  应当使用存储例程吗　　471\n32.1.1  存储例程的优点　　471\n32.1.2  存储例程的缺点　　472\n32.2  MySQL 如何实现存储例程　　 472\n32.2.1  创建存储例程　　472\n32.2.2  声明和设置变量　　 474\n32.2.3  执行存储例程　　 475\n32.2.4  创建和使用多语句存储例程 　　476\n32.2.5  从另一个例程中调用例程　　 481\n32.2.6  修改存储例程　　482\n32.2.7  删除存储例程　　482\n32.2.8  查看例程状态　　482\n32.2.9  查看例程的创建语法　　 483\n32.2.10  条件处理　　484\n32.3  将例程集成到Web 应用程序　　484\n32.3.1  创建员工奖金界面　　 484\n32.3.2  获取多条记录　　 485\n32.4  小结　　　485\n第33 章  MySQL 触发器　　 486\n33.1  介绍触发器　　486\n33.1.1  为什么使用触发器　　 486\n33.1.2  在事件前采取行动　　 487\n33.1.3  在事件后采取行动　　 487\n33.1.4  前触发器和后触发器　　 488\n33.2  MySQL 对触发器的支持　　 488\n33.2.1  创建触发器　　 488\n33.2.2  查看现有的触发器　　 490\n33.2.3  修改触发器　　 491\n33.2.4  删除触发器　　491\n33.3  将触发器集成到Web 应用程序　　 491\n33.4  小结　　 492\n第34 章  视图　　　493\n34.1  视图介绍　　　493\n34.2  MySQL 对视图的支持　　494\n34.2.1  创建和执行视图　　494\n34.2.2  查看视图信息　　498\n34.2.3  修改视图　　499\n34.2.4  删除视图　　499\n34.2.5  更新视图　　500\n34.3  将视图结合到Web 应用程序中　　 500\n34.4  小结　　501\n第35 章  实用数据库查询　　 502\n35.1  示例数据　　 502\n35.2  用PEAR 创建表格输出　　503\n35.2.1  安装HTML_Table　　 503\n35.2.2  创建简单表　　503\n35.2.3  创建更可读的行输出　　 505\n35.2.4  根据数据库数据创建表　　505\n35.3  排序输出　　506\n35.4  创建分页输出　　 507\n35.5  列出页码　　 509\n35.6  用子查询查询多个表　　 510\n35.6.1  用子查询完成比较　　 511\n35.6.2  用子查询确定存在性　　 511\n35.6.3  用子查询维护数据库　　 512\n35.6.4  在PHP 中使用子查询　　 512\n35.7  用游标迭代结果集　　513\n35.7.1  游标基础　　513\n35.7.2  创建游标　　513\n35.7.3  打开游标　　514\n35.7.4  使用游标　　514\n35.7.5  关闭游标　　515\n35.7.6  在PHP 中使用游标　　515\n35.8  小结　　515\n第36 章  索引和搜索　　516\n36.1  数据库索引　　　516\n36.1.1  主键索引　　　516\n36.1.2  唯一索引　　　517\n36.1.3  常规索引　　　518\n36.1.4  全文索引　　　519\n36.1.5  索引最佳实践　　　522\n36.2  基于表单的搜索　　　522\n36.2.1  执行简单搜索　　　523\n36.2.2  扩展搜索功能　　　524\n36.2.3  完成全文搜索　　　525\n36.3  小结　　526\n第37 章  事务　　527\n37.1  什么是事务　　　527\n37.2  MySQL 的事务功能　　　 528\n37.2.1  系统需求　　528\n37.2.2  表创建　　　 528\n37.3  示例项目　　　528\n37.3.1  创建表并添加示例数据　　 529\n37.3.2  执行示例事务　　529\n37.3.3  用法提示　　531\n37.4  用PHP 构建事务应用程序　　531\n37.5  小结　　 533\n第38 章  导入和导出数据　　 534\n38.1  示例表　　534\n38.2  使用数据定界　　　534\n38.3  导入数据　　　 535\n38.3.1  利用LOAD DATA INFILE导入数据　　　535\n38.3.2  用mysqlimport 导入数据　　 538\n38.3.3  用PHP 加载表数据　　540\n38.4  导出数据　　541\n38.5  小结　　 543",
      pages: "543",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6485296.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6485296.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6485296.jpg"
      },
      alt: "https://book.douban.com/subject/6516132/",
      id: "6516132",
      publisher: "人民邮电出版社",
      isbn10: "7115253528",
      isbn13: "9787115253521",
      title: "PHP与MySQL程序设计（第4版）",
      url: "https://api.douban.com/v2/book/6516132",
      alt_title: "Beginning PHP and MySQL, 4th Ed.",
      author_intro:
        "W. Jason Gilmore  世界知名软件技术专家，CodeMash技术大会创始人之一，MySQL全球技术大会顾问委员会成员。他曾负责Apress出版公司开源图书出版项目，开 发了大量PHP和MySQL应用程序，在各大专业媒体发表了众多有影响力的技术文章，并通过以其姓名命名的W.J. Gilmore公司为小型企业提供咨询和Web开发服务，其以往著作包括畅销书Easy PHP Websites with the Zend Framework和Easy PayPal with PHP。他的个人网站http://www.wjgilmore.com。",
      summary:
        "本书是全面讲述PHP 与MySQL 的经典之作，书中不但全面介绍了两种技术的核心特性，还讲解了如何高效地结合这两种技术构建健壮的数据驱动的应用程序。本书涵盖了两种技术新版本中出现的最新特性， 书中大量实际的示例和深入的分析均来自于作者在这方面多年的专业经验，可用于解决开发者在实际中所面临的各种挑战。\n本书内容全面深入，适合各层次PHP 和MySQL 开发人员阅读，既是优秀的学习教程，也可用作参考手册。",
      price: "89.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 10,
        average: "6.8",
        min: 0
      },
      subtitle: "Delivering the Best of PHP",
      author: ["Peter MacIntyre"],
      pubdate: "2010-04-26",
      tags: [
        {
          count: 7,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "programming",
          title: "programming"
        },
        {
          count: 3,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "英文版",
          title: "英文版"
        },
        {
          count: 1,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 1,
          name: "世界上最好的语言",
          title: "世界上最好的语言"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s4278847.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "176",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s4278847.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s4278847.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s4278847.jpg"
      },
      alt: "https://book.douban.com/subject/4759948/",
      id: "4759948",
      publisher: "O'Reilly Media",
      isbn10: "0596804377",
      isbn13: "9780596804374",
      title: "PHP: The Good Parts",
      url: "https://api.douban.com/v2/book/4759948",
      alt_title: "",
      author_intro:
        "Peter MacIntyre lives and works in Charlottetown, Prince Edward Island, Canada. He has over 20 years of experience in the information technology industry, primarily in the area of software development.\nPeter’s technical skill set includes several client/server tools and relational database systems such as PHP, PowerBuilder, Visual Basic, Active Server Pages, and CA-Visual Objects.\nPeter is certified by ZEND Corporation on PHP 4.x and has contributed writing material for Using Visual Objects (Que Corp.), Using PowerBuilder 5 (Que Corp.), ASP.NET Bible (Wiley Pub.), and Web Warrior Survey on Web Development Languages (Course Technology). Most recently he has co-authored the Zend Studio for Eclipse Developer’s Guide – Addison-Wesley.\nPeter is a former contributing editor and author to the on-line and in-print magazine called php|architect (www.phparch.com). He has also spoken several times at North American and International computer conferences including CA-World in New Orleans, USA; CA-TechniCon in Cologne, Germany; and CA-Expo in Melbourne, Australia.",
      summary:
        "Get past all the hype about PHP and dig into the real power of this language. This book explores the most useful features of PHP and how they can speed up the web development process, and explains why the most commonly used PHP elements are often misused or misapplied. You’ll learn which parts add strength to object-oriented programming, and how to use certain features to integrate your application with databases.\nWritten by a longtime member of the PHP community, PHP: The Good Parts is ideal for new PHP programmers, as well as web developers switching from other languages.\nBecome familiar with PHP’s basic syntax, variables, and datatypes\nLearn how to integrate the language with web pages\nUnderstand how to use strings, arrays, and PHP’s built-in functions\nDiscover the advantages of using PHP as an object-oriented language\nExplore how PHP interacts with databases, such as SQLite and MySQL\nLearn input- and output-handling best practices to prevent security breaches",
      price: "USD 29.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 81,
        average: "8.6",
        min: 0
      },
      subtitle: "",
      author: ["Lynn Beighley", "Michael Morrison"],
      pubdate: "2008-12-29",
      tags: [
        {
          count: 75,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 51,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 31,
          name: "HeadFirst",
          title: "HeadFirst"
        },
        {
          count: 19,
          name: "Web",
          title: "Web"
        },
        {
          count: 16,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 15,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 10,
          name: "软件开发",
          title: "软件开发"
        },
        {
          count: 9,
          name: "网页设计",
          title: "网页设计"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s8959264.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "816",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s8959264.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s8959264.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s8959264.jpg"
      },
      alt: "https://book.douban.com/subject/3253845/",
      id: "3253845",
      publisher: "O'Reilly Media",
      isbn10: "0596006306",
      isbn13: "9780596006303",
      title: "Head First PHP & MySQL",
      url: "https://api.douban.com/v2/book/3253845",
      alt_title: "",
      author_intro:
        "Lynn Beighley is a fiction writer stuck in a technical book writer's body. Upon discovering that technical book writing actually paid real money, she learned to accept and enjoy it. After going back to school to get a Masters in Computer Science, she worked for the acronyms NRL and LANL. Then she discovered Flash, and wrote her first bestseller. A victim of bad timing, she moved to Silicon Valley just before the great crash. She spent several years working for Yahoo! and writing other books and training courses. Finally giving in to her creative writing bent, she moved to the New York area to get an MFA in Creative Writing. Her Head First-style thesis was delivered to a packed room of professors and fellow students. It was extremely well received, and she finished her degree, finished Head First SQL, and can't wait to begin her next book.\nLynn loves traveling, cooking, and making up elaborate background stories about complete strangers. She's a little scared of clowns.\nMichael Morrison is a writer, developer, toy inventor, and author of books on Java, Web scripting, game development, and mobile devices. An instructor of Web-based courses, Michael is also the founder of Stalefish Labs (www.stalefishlabs.com), a company specializing in games, toys, and interactive media.",
      summary:
        "If you're ready to create web pages more complex than those you can build with HTML and CSS, Head First PHP & MySQL is the ultimate learning guide to building dynamic, database-driven websites using PHP and MySQL. Packed with real-world examples, this book teaches you all the essentials of server-side programming, from the fundamentals of PHP and MySQL coding to advanced topics such as form validation, session IDs, cookies, database queries and joins, file I/O operations, content management, and more.\nHead First PHP & MySQL offers the same visually rich format that's turned every title in the Head First series into a bestseller, with plenty of exercises, quizzes, puzzles, and other interactive features to help you retain what you've learned.",
      price: "USD 44.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 40,
        average: "6.9",
        min: 0
      },
      subtitle: "",
      author: ["[加拿大] Lee Babin"],
      pubdate: "2007-09-01",
      tags: [
        {
          count: 36,
          name: "php",
          title: "php"
        },
        {
          count: 35,
          name: "ajax",
          title: "ajax"
        },
        {
          count: 11,
          name: "编程",
          title: "编程"
        },
        {
          count: 11,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 5,
          name: "javascript",
          title: "javascript"
        },
        {
          count: 4,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 3,
          name: "程序设计",
          title: "程序设计"
        }
      ],
      origin_title: "Beginning Ajax with PHP",
      image: "https://img3.doubanio.com/view/subject/m/public/s2690445.jpg",
      binding: "平装",
      translator: ["徐锋", "陈绍继"],
      catalog:
        "第1章 ajax概述\n1.1 从cgi到flash再到dhtml\n1.2 当前web应用稃序环境的优缺点\n1.2.1 走近ajax\n1.2.2 ajax的必要条件\n1.3 小结\n第2章 ajax基础\n2.1 http请求和响应基础\n2.2 xmlhttprequest对象\n2.2.1 xmlhttprequest方法\n2.2.2 xmlhttprequest属性\n2.2.3 跨浏览器用法\n2.2.4 向服务器发送请求\n2.2.5 一个简单的ajax示例\n2.3 小结\n第3章 php和ajax\n3.1 为什么选择php和ajax\n3.2 客户端驱动通信，服务器端完成处理\n3.3 简单示例\n3.3.1 内容缩放\n.　　3.3.2 自动完成\n3.3.3 表单验证\n3.3.4 工具提示\n3.4 小结\n第4章 数据库驱动的ajax\n4.1 mysql简介\n4.2 连接到mysql\n4.3 查询mysql数据库\n4.4 mysql技巧和警告\n4.5 将幕于ajax的数据库查询应用到工作中\n4.6 更完善的自动完成功能\n4.7 载入日历\n4.8 小结\n第5章 表单\n5.1 引入ajax：get与post\n5.2 值的传递\n5.3 表单验证\n5.4 小结\n第6章 图像\n6.1 图像上传\n6.2 图像显示\n6.3 图像载入\n6.4 略缩图动态生成\n6.5 小结\n第7章 一个真实的ajax应用程序\n7.1 程序代码\n7.2 应用程序的界面外观\n7.3 工作原理\n7.4 小结\n第8章 人性化的显示\n8.1 何时使用ajax\n8.1.1 后退按钮问题\n8.1.2 ajax导航\n8.1.3 隐藏与显示\n8.2 pear简介\n8.3 html-table\n8.4 小结\n第9章 web服务\n第10章 包含空间信息的web应用\n第11章 跨浏览器问题\n第12章 安全\n第13章 测试与调试\n第14章 dom",
      pages: "192",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s2690445.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s2690445.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s2690445.jpg"
      },
      alt: "https://book.douban.com/subject/2208576/",
      id: "2208576",
      publisher: "人民邮电出版社图灵程序设计丛书",
      isbn10: "7115162522",
      isbn13: "9787115162526",
      title: "Ajax与PHP基础教程",
      url: "https://api.douban.com/v2/book/2208576",
      alt_title: "Beginning Ajax with PHP",
      author_intro:
        "Lee Babin是加拿大code shoppe公司的首席程序员，拥有丰富的web开发经验，尤其擅长开发复杂的web驱动应用程序。他是业界知名的php专家，除本书外，他还与人合著了名著php 5 recipes一书（中文版即将由人民邮电出版社出版）。",
      summary:
        "《Ajax与PHP基础教程》通过大量实例，充分展现了如何将二者结合起来创建下一代网络应用。《Ajax与PHP基础教程》内容完备，不仅讲述了一般会遇到的日常Web应用程序开发任务，如验证表单、文件上传、自动完成、工具提示、图片上传和显示等，完整演示了最常见也最实用的数据库驱动应用、Web服务、Google Maps集成应用、网上图片库的搭建，也涵盖了许多全局性的问题，如安全、测试和调试、Ajax应用场合以及跨浏览器等。",
      price: "39.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 30,
        average: "5.7",
        min: 0
      },
      subtitle: "",
      author: ["PHP China"],
      pubdate: "2008-01-01",
      tags: [
        {
          count: 10,
          name: "php",
          title: "php"
        },
        {
          count: 8,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 5,
          name: "PHP&MySQL",
          title: "PHP&MySQL"
        },
        {
          count: 3,
          name: "要学习的",
          title: "要学习的"
        },
        {
          count: 3,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 2,
          name: "编程",
          title: "编程"
        },
        {
          count: 2,
          name: "web",
          title: "web"
        },
        {
          count: 1,
          name: "管理",
          title: "管理"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s5868021.jpg",
      binding: "",
      translator: [],
      catalog:
        "第1章　互联网基础知识\n1.1　网络的历史\n1.1.1　Internet的发展历史\n1.1.2　Web 1.0与Web 2.0\n1.1.3　Web 2.0与PHP\n1.2　C/S与B/S结构\n1.3　TCP/IP协议\n1.3.1　通信协议\n1.3.2　分组交换\n1.3.3　TCP/IP介绍\n1.3.4　TCP/IP的结构\n1.3.5　TCP与UDP的比较\n本章总结\n第2章　LINUX系统\n2.1　Linux概述\n2.2　LAMP开源构架\n2.3　LAMP安装准备\n本章总结\n第3章　搭建WEB服务器\n3.1　Apache服务器概述\n3.2　安装Apache服务器\n3.3　配置Apache服务器\n3.3.1　HTTP守护进程的运行参数\n3.3.2　Apache服务器的模块化\n3.3.3　虚拟主机的设置\n本章总结\n第4章　安装MYSQL数据库\n4.1　MySQL数据库概述\n4.2　安装MySQL数据库\n4.3　MySQL数据库的基本管理\n4.3.1　启动与停止\n4.3.2　登录MySQL\n4.3.3　用户管理\n4.3.4　MySQL常用操作\n4.3.5　备份与恢复\n4.3.6　更改MySQL目录\n4.4　PHPMyAdmin概述\n4.4.1　快速安装\n4.2.2　配置\n4.4.3　常见问题\n4.4.4　安全性设置\n本章总结\n第5章　安装PHP环境\n5.1　安装PHP\n5.2　配置PHP\n5.3　在Apache中配置PHP\n5.4　在IIS中配置PHP\n5.4.1　Windows平台下PHP的基本配置\n5.4.2　IIS中配置PHP\n本章总结\n第6章　集成安装包\n6.1　XAMPP\n6.2　其他安装包\n本章总结\n第7章　ZEND开发环境\n7.1　Zend公司简介\n7.2　Zend Studio集成开发环境\n7.2.1　编辑文件\n7.2.2　使用项目功能\n7.2.3　Zend Studio代码补全\n7.2.4　Studio的PHP的调试\n7.2.5　断点跟踪\n7.2.6　堆栈与输出缓冲\n7.2.7　跳入与跳出\n7.2.8　Studio的版本控制\n7.3　Zend Optimizer优化器\n7.4　Zend Platform集成管理平台\n7.4.1　概述\n7.4.2　快速使用说明\n7.4.3　如何用Zend Platform实现\n7.4.3　Session跨服务器\n7.4.4　用Zend Platform做缓存处理\n7.5　Zend Guard安全卫士\n本章总结\n第8章　HTML语言\n8.1　HTTP\n8.1.1　HTTP简介\n8.1.2　RFC简介\n8.1.3　HTTP服务器与PHP\n8.2　HTML基础\n8.2.1　HTML简介\n8.2.2　W3C简介\n8.3　HTML元素\n8.3.1　基本元素\n8.3.2　格式元素\n8.3.3　图像元素与链接元素\n8.3.4　表格元素\n8.3.5　框架元素\n8.4　XHTML介绍\n8.5　表单元素\n本章总结\n第9章　PHP语言基础\n9.1　PHP简介\n9.2　变量与常量\n9.3　数据类型\n9.4　操作符\n9.5　循环\n9.6　判断\n9.7　函数\n9.8　面向对象\n9.8.1　面向对象简介\n9.8.2　类的结构成员\n9.8.3　构造函数与类的实例化\n9.8.4　实现继承\n9.8.5　成员控制\n9.8.6　重载\n9.8.7　抽象类\n9.8.8　接口\n9.8.9　常用的函数\n9.8.10　比较对象\n9.8.11　魔术方法\n9.8.12　常用的两个设计模式\n9.8.13　对象遍历\n本章总结\n第10章　常用函数\n10.1　字符串\n10.1.1　比较\n10.1.2　查找替换\n10.1.3　其他处理函数\n10.2　正则表达式\n10.2.1　正则表达式简介\n10.2.2　基本匹配模式\n10.2.3　正则表达式函数\n10.3　数组\n10.3.1　概念\n10.3.2　数组的分类\n10.3.3　数组的操作\n10.4　文件\n10.4.1　文件操作函数\n10.4.2　典型应用\n10.5　图像\n本章总结\n第11章　WEB开发\n11.1　表单处理\n11.2　会话控制\n11.2.1　会话机制\n11.2.2　Cookie介绍\n11.2.3　Session介绍\n11.3　数据库操作\n11.3.1　PHP关于MySQL的配置\n11.3.2　建立一个连接\n11.3.3　选择使用的数据库\n11.3.4　断开数据库连接\n11.3.5　从查询结果中提取数据\n11.3.6　将新信息插入数据库\n11.3.7　分页显示\n11.4　XML基础\n11.4.1　XML简介\n11.4.2　PHP如何解析XML\n11.5　JavaScript基础\n11.5.1　JavaScript简介\n11.5.2　JavaScript与其他语言的比较\n11.5.3　JavaScript程序设计\n11.5.4　JavaScript函数\n11.6　Ajax技术\n11.6.1　Ajax基础\n11.6.2　XMLHttpRequest对象\n11.6.3　Ajax中的请求/响应\n11.6.4　Ajax实例分析\n11.7　安全性设置\n本章总结\n第12章　留言板\n12.1　项目简介\n12.2　功能模块\n12.2.1　系统设计思想\n12.2.2　系统功能模块划分\n12.2.3　系统流程分析\n12.2.4　系统功能效果图预览\n12.3　数据库设计\n12.4　系统实现\n12.4.1　连接数据库\n12.4.2　头文件\n12.4.3　首页\n12.4.4　签写留言\n12.4.5　查看留言列表\n12.4.6　显示留言详细内容\n12.4.7　回复留言\n12.4.8　搜索留言模块\n12.4.9　管理员登录\n12.4.10　管理员浏览留言\n12.4.11　删除同主题留言\n12.4.12　管理留言内容\n12.4.13　修改留言内容\n12.4.14　删除留言内容\n12.4.15　注销登录模块\n本章小结\n第13章　投票系统\n13.1　项目简介\n13.2　功能模块\n13.2.1　功能分析\n13.2.2　系统运行效果预览\n13.2.3　功能文件\n13.3　数据库设计\n13.4　系统实现\n13.4.1　创建数据库及数据库表\n13.4.2　现管理员功能\n13.4.3　实现客户端投票功能\n13.4.4　显示投票结果\n13.4.5　系统中的公共函数\n13.5　基于文件的投票系统\n13.5.1　系统整体设计\n13.5.2　数据的存储形式\n13.5.3　投票系统的基类\n13.5.3　Support Functions\n13.5.4　投票系统的实现类TSvote\n13.5.5　实现客户投票功能\n本章总结\n第14章　CMS内容管理系统\n14.1　项目简介\n14.1.1　什么是CMS系统\n14.1.2　MS系统应用\n14.1.3　CMS系统关键组件\n14.2　功能模块\n14.3　数据库设计\n14.4　系统实现\n14.4.1　公共文件\n14.4.2　模板文件\n14.4.3　内容显示\n14.4.4　用户管理\n14.4.5　内容管理\n本章总结\n附录A\n附录B　DISCUZ！的安装与简单使用\n附录C　安装SUPESITE/X-SPACE\n附录D　安装WIKI\n附录E　DISCUZ！编码规范\n附录F　模拟自测题\n模拟题参考答案",
      pages: "397",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s5868021.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s5868021.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s5868021.jpg"
      },
      alt: "https://book.douban.com/subject/2980837/",
      id: "2980837",
      publisher: "电子工业出版社",
      isbn10: "7121054140",
      isbn13: "9787121054143",
      title: "PHP 5项目开发实战详解",
      url: "https://api.douban.com/v2/book/2980837",
      alt_title: "",
      author_intro: "",
      summary:
        "本书是一本为PHP初学者量身定制的秘籍。\n本书由浅入深地介绍了PHP语言，通过对书中的留言版、投票系统和CMS内容管理系统这些项目开发的详细讲解，深度了解学习项目开发中的数据库设计等各个细节，使从来没有开发经历的朋友得到锻炼。所包含的对于Zend产品和集成安装包的介绍将为你的学习带来更多的方便，提高和加深你对PHP的认识和了解。\n本书作为PCTI认证（PHPChina Training——Improving）的指定参考教材，由多位Zend中国区技术支持工程师、Comsenz项目经理、PHPChina技术工程师联合编写。对于PHP初学者来说，本书可以作为教材和参考书，对于有丰富经验的PHP高手，本书也是一本很好的参考资料。",
      price: "49.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 44,
        average: "6.8",
        min: 0
      },
      subtitle: "",
      author: ["达里"],
      pubdate: "2007-04-01",
      tags: [
        {
          count: 38,
          name: "ajax",
          title: "ajax"
        },
        {
          count: 31,
          name: "php",
          title: "php"
        },
        {
          count: 22,
          name: "Ajax与PHPWeb开发",
          title: "Ajax与PHPWeb开发"
        },
        {
          count: 10,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 9,
          name: "JavaScript",
          title: "JavaScript"
        },
        {
          count: 8,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 8,
          name: "web",
          title: "web"
        },
        {
          count: 5,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "AJAX and PHP: Building Responsive Web Applications",
      image: "https://img3.doubanio.com/view/subject/m/public/s2373575.jpg",
      binding: "平装",
      translator: ["王德民", "王新颖", "刘昕"],
      catalog:
        "第1章　Ajax与未来的Web应用程序\n1.1　通过Web发布的功能\n1.2　20世纪90年代开始出现网站\n1.2.1　HTTP与HTML\n1.2.2　PHP及其他服务器端技术\n1.2.3　JavaScript及其他客户端技术\n1.2.4　缺少的是什么\n1.3　理解Ajax\n1.4　使用Ajax和PHP建立一个简单应用程序\n1.5　小结\n第2章　JavaScript下灵活的客户端技术\n2.1　JavaScript和Document Object Model\n2.2　JavaScript事件和DOM\n2.3　关于DOM的进一步介绍\n2.4　JavaScript、DOM和CSS\n2.5　使用XMLHttpRequest对象\n2.5.1　创建XMLHttpRequest对象\n2.5.2　使用XMLHttpRequest初始化服务器请求\n2.5.3　服务器响应处理\n2.6　使用XML结构\n2.6.1　处理更多的错误和抛出异常\n2.6.2　建立XML结构\n2.7　小结\n第3章　使用PHP和MySQL实现服务器端技术\n3.1　PHP与DOM\n3.2　参数传递与PHP错误处理\n3.3　连接远程服务器与JavaScript的安全性\n3.4　使用代理服务器脚本\n3.5　重复异步请求框架\n3.6　使用MySQL\n3.6.1　创建数据库表\n3.6.2　数据操作\n3.6.3　连接数据库并执行查询操作\n3.7　程序封装与程序结构\n3.8　小结\n第4章　Ajax表单验证\n4.1　实现Ajax表单验证\n4.2　小结\n第5章　Ajax聊天\n5.1　Ajax聊天简介\n5.2　实现Ajax聊天\n5.3　小结\n第6章　Ajax建议和自动完成\n6.1　Ajax建议和自动完成简介\n6.2　实现Ajax建议和自动完成\n6.3　小结\n第7章　使用SVG实现Ajax实时绘制图表\n7.1　使用Ajax和SVG实现实时图表\n7.2　小结\n第8章　Ajax数据表格\n8.1　使用客户端XSLT实现Ajax数据表格\n8.2　小结\n第9章　Ajax RSS阅读器\n9.1　使用RSS\n9.1.1　RSS文档结构\n9.1.2　Google Reader\n9.2　实现基于Ajax的RSS阅读器\n9.3　小结\n第10章　Ajax的拖放功能\n10.1　在Web上使用拖放功能\n10.1.1　购物车\n10.1.2　分类列表\n10.2　创建Ajax拖放分类列表应用\n10.3　小结\n附录A　环境配置\nA.1　Windows下的环境配置\nA.1.1　安装Apache\nA.1.2　安装MySQL\nA.1.3　安装PHP\nA.2　*nix下的环境配置\nA.2.1　安装Apache\nA.2.2　安装MySQL\nA.2.3　安装PHP\nA.3　安装phpMyAdmin\nA.4　配置Ajax数据库",
      pages: "306",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s2373575.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s2373575.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s2373575.jpg"
      },
      alt: "https://book.douban.com/subject/2029980/",
      id: "2029980",
      publisher: "人民邮电出版社",
      isbn10: "7115157855",
      isbn13: "9787115157850",
      title: "Ajax与PHP Web开发",
      url: "https://api.douban.com/v2/book/2029980",
      alt_title: "AJAX and PHP: Building Responsive Web Applications",
      author_intro:
        "本书的4位作者均为有多年开发经验的程序员。其中Cristian Darie也是一为资深作者，其作品包括畅销系列“Beginning E-Commerce”。",
      summary:
        "本书指导读者使用Ajax、PHP及其他相关技术建立快速响应的网页。本书不仅从Ajax的客户端和服务器端技术两个方面指导读者逐步掌握Ajax基础应用，还通过实例详细演示了Ajax表单验证、Ajax聊天室、Ajax Suggest、使用SVG实现的Ajax实时绘图程序、Ajax Grid、Ajax RSS阅读器和Ajax拖放等的实现过程。同时还介绍了在Windows和UNIX系统下的应用程序环境配置和相关名词解释。\n本书适合已经掌握PHP、XML、JavaScript和MySQL基础知识，并想要了解Ajax核心和工作原理的读者阅读。",
      price: "39.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 81,
        average: "8.9",
        min: 0
      },
      subtitle: "",
      author: ["Josh Lockhart"],
      pubdate: "2015-09-01",
      tags: [
        {
          count: 130,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 31,
          name: "现代化PHP开发",
          title: "现代化PHP开发"
        },
        {
          count: 30,
          name: "编程语言",
          title: "编程语言"
        },
        {
          count: 20,
          name: "web",
          title: "web"
        },
        {
          count: 17,
          name: "编程",
          title: "编程"
        },
        {
          count: 15,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 14,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 11,
          name: "非常不错的一本书",
          title: "非常不错的一本书"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s28310875.jpg",
      binding: "平装",
      translator: ["安道"],
      catalog:
        "前言\n第一部分语言特性\n第1章新时代的PHP\n回顾过去\n审视现在\n展望未来\n第2章特性\n命名空间\n使用接口\n性状\n生成器\n闭包\nZend OPCaChe\n内置的HTTP服务器\n启动这个服务器\n配置这个服务器\n查明使用的是否为内置的服务器\n接下来\n第二部分良好实践\n第3章标准\n打破旧局面的PHP—FIG\n框架的互操作性\nPSR是什么？\nPSR—1：基本的代码风格\nPSR—2：严格的代码风格\nPSR—3：日志记录器接口\nPSR—4：自动加载器\n第4章组件\n为什么使用组件？\n组件是什么？\n组件和框架对比\n查找组件\n使用PHP组件\n第5章良好实践\n过滤、验证和转义\n密码\n日期、时间和时区\n数据库\n多字节字符串\n流\n错误和异常\n第三部分部署、测试和调优\n第6章主机\n共享服务器\n虚拟私有服务器\n专用服务器\nPaaS\n选择主机方案\n第7章配置\n我们的目标\n设置服务器\nSSH密钥对认证\nPHP—FPM\n自动配置服务器\n委托别人配置服务器\n延伸阅读\n接下来\n第8章调优\nphp.ini文件\n内存\nZend OPCaChe\n文件上传\n最长执行时间\n处理会话\n缓冲输出\n真实路径缓存\n接下来\n第9章部署\n版本控制\n自动部署\nCapistrano\n延伸阅读\n接下来\n第10章测试\n为什么测试？\n何时测试？\n测试什么？\n如何测试？\nPHPUnit\n使用Travis CI持续测试\n延伸阅读\n接下来\n第11章分析\n什么时候使用分析器\n分析器的种类\nXdebUg\nXHProf\nXHGUI\nNew Relic的分析器\nBlackfire分析器\n延伸阅读\n接下来\n第12章HHVM和Hack\nHHVM\nHack语言\n延伸阅读\n第13章社区\n本地PHP用户组\n会议\n辅导\n与时俱进\n附录A安装PHP\n附录B本地开发环境",
      pages: "219",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s28310875.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s28310875.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s28310875.jpg"
      },
      alt: "https://book.douban.com/subject/26635862/",
      id: "26635862",
      publisher: "中国电力出版社",
      isbn10: "7512380933",
      isbn13: "9787512380936",
      title: "Modern PHP（中文版）",
      url: "https://api.douban.com/v2/book/26635862",
      alt_title: "",
      author_intro:
        "Josh Lockhart开发了Slim框架，这是一个PHP微型框架，适合快速开发Web应用和API。他还是“PHP之道”的发起人和当前的维护者。“PHP之道”在PHP社区中很受欢迎，目的在于鼓励全世界的PHP开发者使用一些良好实践，传播一些高质量的资源。他是New Media Campaigns的开发者，这个机构位于北卡罗来纳州卡勃罗市。",
      summary:
        "PHP正在重生，不过所有PHP在线教程都过时了，很难体现这一点。通过这本实用的指南，你会发现，借助面向对象、命名空间和不断增多的可重用的组件库，PHP已经成为一门功能完善的成熟语言。\n本书作者Josh Lockhart是“PHP之道”的发起人，这是个受欢迎的新方案，鼓励开发者使用PHP最佳实践。Josh通过实践揭示了PHP语言的这些新特性。你会学到关于应用架构、规划、数据库、安全、测试、调试和部署方面的最佳实践。如果你具有PHP基础知识，想提高自己的技能，绝对不能错过这本书。\n• 学习现代的PHP特性，例如命名空间、性状、生成器和闭包。\n• 探索如何查找、使用和创建PHP组件。\n• 遵从应用安全方面的最佳实践，将其运用在数据库、错误和异常处理等方面。\n• 学习部署、调优、测试和分析PHP应用的工具和技术。\n• 探索Facebook开发的HHVM和Hack语言。\n• 搭建与生产服务器高度一致的本地开发环境。",
      price: "39"
    },
    {
      rating: {
        max: 10,
        numRaters: 48,
        average: "7.6",
        min: 0
      },
      subtitle: "",
      author: ["Jono Bacom"],
      pubdate: "2008-06-01",
      tags: [
        {
          count: 27,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 12,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 9,
          name: "PHP+SQL",
          title: "PHP+SQL"
        },
        {
          count: 4,
          name: "web",
          title: "web"
        },
        {
          count: 4,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 3,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 3,
          name: "好书",
          title: "好书"
        },
        {
          count: 2,
          name: "网站建设",
          title: "网站建设"
        }
      ],
      origin_title: "Practical PHP and MySQL",
      image: "https://img1.doubanio.com/view/subject/m/public/s3176948.jpg",
      binding: "16开",
      translator: ["吴连河", "李剑"],
      catalog:
        "前言\n作者简介\n致谢\n绪言\n独辟蹊径\n阅读本书时的准备\n约定\n展望\n第1章 通过实战学编程\n1.1 技术\n1.2 动态Web的工作方式\n1.3 总结\n第2章 初识PHP和MySQL\n2.1 安装PHP和MySQL\n2.2 PHP入门\n2.3 走进MySQL\n2.4 在PHP申连接MySQL\n2.5 总结\n第3章 运行项目\n3.1 关于随书光盘\n3.2 运行程序\n3.3 使用XAMPP\n3.4 总结\n第4章 建立博客\n4.1 项目概况：Blogtasdc用例\n4.2 建立数据库\n4.3 开始编码\n4.4 查看指定文章\n4.5 创建分类浏览\n4.6 不要让任何人都能登录\n4.7 添加自己的分类\n4.8 创建新文章\n4.9 更新文章\n4.10 总结\n第5章 构建论坛\n5.1 论坛揭密\n5.2 创建自己的论坛\n5.3 动手之前\n5.4 创建数据库\n5.5 创建网站的方案\n5.6 显示板决\n5.7 管理用户登录\n5.8 发帖和回帖\n5.9 建立管理员专用页面\n5.10 总结\n第6章 创建购物车程序\n6.1 项目概述\n6.2 建立数据库\n6.3 开始编码\n6.4 管理用户登录\n6.5 显示商品与选择商品\n6.6 结账\n6.7 管理员页面\n6.8 总结\n第7章 构建在线拍卖网站\n7.1 项目概述\n7.2 建立数据库\n7.3 开始编码\n7.4 显示拍卖商品\n7.5 处理用户\n7.6 添加商品\n7.7 处理拍卖\n7.8 定时运行页面\n7.9 总结\n第8章 创建Web日历\n8.1 项目概述\n8.2 建立数据库\n8.3 开始编码\n8.4 查看活动\n8.5 总结\n第9章　FAQ内容管理系统\n9.1 项目概述\n9.2 建立数据库\n9.3 开始编码\n9.4 显示问题\n9.5 处理登录\n9.6 问题的添加与审核\n9.7 管理科目\n9.8 管理主题\n9.9 科目的所有权\n9.10 总结\n第10章 构建可重用项目\n10.1 项目概述\n10.2 建立数据库\n10.3 巧妙地使用目录\n10.4 开始编码：构建主干\n10.5 下载发行版\n10.6 查看屏幕截图\n10.7 可用项目查看程序\n10.8 管理项目\n10.9 更改常规设置\n10.10 管理下载（发行版）\n10.11 删除发行版\n10.12 管理屏幕截图\n10.13 删除图像\n10.14 添加新项目\n10.15 部署应用程序\n10.16 总结\n第11章 构建新闻网站\n11.1 项目概述\n11.2 安装PEAR软件包\n11.3 建立数据库\n11.4 开始编码\n11.5 处理用户登录\n11.6 查看新闻与新闻评级\n11.7 管理新闻\n11.8 管理类别\n11.9 创建自己的搜索引擎\n11.10 总结\n附录A 网站的设计\n项目概述\n布置网站\n开始编码\n开始建立样式表\n设定主要<div>的格式\n创建“关于”页\n创建“常见问题”页\n设定表格的格式\n总结\n索引",
      pages: "512",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s3176948.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s3176948.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s3176948.jpg"
      },
      alt: "https://book.douban.com/subject/3142173/",
      id: "3142173",
      publisher: "电子工业出版社",
      isbn10: "7121066475",
      isbn13: "9787121066474",
      title: "PHP+MySQL八大动态Web应用实战",
      url: "https://api.douban.com/v2/book/3142173",
      alt_title: "Practical PHP and MySQL",
      author_intro:
        "Jobo Bacon就职于Canonical，任Ubuntu的社区管理者，是开源社区的一位常设发言人(established speaker)、作者和正式成员(regular contributor)。作为作者，Bacon与人合作创作了《Linux Desktop Hacks》和《The Official Ubuntu Book》，并在超过14种出版物上发表过400多篇文章。作为专栏作家，Bacon不仅为Linux Format、Linux User&Developer和PC Plus撰稿，同时还是O'reilly Network的博客作者。",
      summary:
        "本书详细介绍了利用PHP+MySQL开发常见类型Web应用程序的完整设计和编码技术，并对整体设计与关键代码给予了细致、深入的剖析。其内容注重实践，提供了翔实完整的实战代码；思路独树一帜，突破过多描述语言细节的窠臼；行文风趣幽默，轻松调侃中将项目的完整设计过程分析得一清二楚。书中的示例项目完整而实用，读者甚至无需任何改动即可在实际中加以运用。.\n本书适合对PHP／MySQL有初步了解但缺乏完整项目开发经验的用户，对从以其他技术开发Web应用的阵营中转过来的用户提供了有利的武器，对于所有喜爱PHP+MySQL的读者均是一本不可多得的出色参考书。",
      price: "68.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle:
        "Creating Blogs, Forums, Portals, and Community Websites: How to setup, configure and customise this powerful PHP/MySQL based Open Source CMS",
      author: ["David Mercer"],
      pubdate: "2006-05-11",
      tags: [
        {
          count: 1,
          name: "drupal",
          title: "drupal"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s4099808.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "284",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s4099808.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s4099808.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s4099808.jpg"
      },
      alt: "https://book.douban.com/subject/1796117/",
      id: "1796117",
      publisher: "Packt Publishing",
      isbn10: "1904811809",
      isbn13: "9781904811800",
      title: "Drupal",
      url: "https://api.douban.com/v2/book/1796117",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 4,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP-Based Content Management Made Easy",
      author: [
        "Kevin Potts",
        "Robert Sable",
        "Nathan Smith",
        "Cody Lindley",
        "Mary Fredborg"
      ],
      pubdate: "May 21, 2007",
      tags: [
        {
          count: 8,
          name: "Textpattern",
          title: "Textpattern"
        },
        {
          count: 8,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 5,
          name: "CMS",
          title: "CMS"
        },
        {
          count: 2,
          name: "互联网",
          title: "互联网"
        },
        {
          count: 2,
          name: "web",
          title: "web"
        },
        {
          count: 2,
          name: "friends_of_ED",
          title: "friends_of_ED"
        },
        {
          count: 1,
          name: "设计",
          title: "设计"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s4542748.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "450",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s4542748.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s4542748.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s4542748.jpg"
      },
      alt: "https://book.douban.com/subject/2137049/",
      id: "2137049",
      publisher: "friends of ED",
      isbn10: "1590598326",
      isbn13: "9781590598320",
      title: "Textpattern Solutions",
      url: "https://api.douban.com/v2/book/2137049",
      alt_title: "",
      author_intro:
        "About the Author\nKevin has been working on the web for almost ten years, having started his career designing his first employer\\'s website with Netscape and Notepad. He has spent the bulk of his design career working in-house as both a graphic designer and internal web developer. Coupled with years of freelance and agency work, Kevin has created dozens of websites for businesses of all sizes in an array of industries. Robert has over 10 years of experience designing and developing web-based applications for small businesses up to Fortune 50 companies. From its early gamma releases, Rob recognized the power and flexibility of Textpattern. He has published over 20 Textpattern plugins and numerous tutorials. He also provides custom software development services using Textpattern as a development framework.\nHe lives with his wife Joci in Copley, Ohio, which is located between Akron and Cleveland. Rob and Joci love to travel together and continue to find new and exciting places to visit. Rob was born and raised in the Cleveland area and continues to be a painfully dedicated Cleveland sports fan. Nathan Smith is a goofy guy who enjoys practicing and preaching web standards. By day, he works as an Information Architect / Interface Designer at Geniant.com. By night, he is finishing up a Master of Divinity degree via online classes from Asbury Theological Seminary. In 2005, he started Godbit.com as a resource to help the Church better understand how to utilize web standards, and blogs about design semi-regularly at his site SonSpring.com. He has been described by family and friends as mildly amusing, but is really quite dull. Cody is a web producer for a technology company located in Boise, Idaho. When he is not working with client side technologies, Flash or interaction design, he spends time with his wife and son, enjoying a simple lifestyle in the Northwest. Cody has a passion for Christian theology and takes great pleasure in learning and studying God\\'s word. His work and ongoing ramblings can be found at codylindley.com Mary Fredborg is a member of the Textpattern development team (team.textpattern.com). For more than ten years she\\'s been involved in various aspects of web development and remains keenly interested in learning new methods and technologies, as well as refining her existing knowledge and skills. These days you can often find Mary working on Textpattern itself, creating new plugins for it and providing technical support for users of varying levels of experience. She lives in Alberta, Canada with her amusingly crazy dog, who also happens to think the same of Mary.",
      summary:
        "Book Description\nTextpattern is a powerful, PHP-based content management system that allows you to build pretty much any kind of data-driven website quickly and easily. It is very popular among designers and developers alike, and has an active community of users. Sound good? Well, you're in luckthe book you're holding now shows you how to use every aspect of Textpattern to a professional standard. Textpattern (and this book) appeals to two main groups of people: Firstly, the web designer who has mastered the fundamentals of XHTML and CSS and wants to create sites that have fresh and dynamically changing information, but is not familiar with server-side coding and databases. Never fearTextpattern enables you to integrate your XHTML knowledge, inserting dynamic aspects into your already solid site design. Secondly, PHP developers who are looking for a content management system upon which to build additional functionality and want a hand with the design aspects of their site. Again, Textpattern fills in those holes. The book leaves no stone unturned. It starts by introducing you to Textpattern and guiding you through its very simple installation process. After the core features of the administrative interface are explored, the book dives into building sites with TXP, using CSS, articles, forms, pages, and more to create fully customized templates. Development follows next, looking at installing plugins and building your own custom plugins to further enhance your Textpattern-based site. The book concludes with several case studies to provide ideas and inspiration, including a weblog, an e-commerce site, and an online review directory.\nIn this book you will:\n* Learn to develop websites quickly using Textpattern's intuitive templating language.\n* Learn to use Textpattern to build e-commerce websites, including customer feedback and reviews.\n* Learn to use Textpattern and web standards to create blogs and community sites with dynamically driven content.\n* Learn how to integrate your own style of coding and design with a content management system that catalyses, rather than hinders, your creativity.\n* Learn how to use PHP to create Textpattern plugins, adding custom functionality and features to uniquely suit the needs of your website.\nSummary of Contents\n* PART ONE: GETTING STARTED\no Chapter 1: Setting the Stage\no Chapter 2: Installing Textpattern\n* PART TWO: THE TEXTPATTERN INTERFACE\no Chapter 3: Site Administration\no Chapter 4: Basic Content Manipulation\no Chapter 5: Presentation\n* PART THREE: CUSTOMIZING TEXTPATTERN\no Chapter 6: The Textpattern Model\no Chapter 7: Creating the Content: Categories and Articles\no Chapter 8: Customizing the Presentation: Sections, Pages, Forms, and Style\no Chapter 9: Tying Content and Structure Together\no Chapter 10: Comments\no Chapter 11: Beyond the Basics\n* PART FOUR: EXTENDING TEXTPATTERN\no Chapter 12: Custom Fields\no Chapter 13: Using Plugins\no Chapter 14: Writing Plugins\n* PART FIVE: TEXTPATTERN SITE EXAMPLES\no Chapter 15: Multiauthor Weblog\no Chapter 16: Case Study: PopularWeddingFavors.com\no Chapter 17: Case Study: BoiseCityEats.com\n* PART SIX: APPENDIXES\no Appendix A: Tag Reference\no Appendix B: Plugin Developer Resources",
      price: "$39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 5,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP开发实战权威指南",
      author: ["张恩民"],
      pubdate: "2012-03-01",
      tags: [
        {
          count: 8,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 2,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 2,
          name: "php",
          title: "php"
        },
        {
          count: 1,
          name: "自学",
          title: "自学"
        },
        {
          count: 1,
          name: "网页设计",
          title: "网页设计"
        },
        {
          count: 1,
          name: "技",
          title: "技"
        },
        {
          count: 1,
          name: "【站长】",
          title: "【站长】"
        },
        {
          count: 1,
          name: "【GB】【章鱼】",
          title: "【GB】【章鱼】"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s9115944.jpg",
      binding: "平装",
      translator: [],
      catalog:
        "目  录\n\n第1章  PHP基础知识与XHTML\t1\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n1.1  PHP的发展与特点\t1\n1.1.1  PHP语言的发展和特点\t1\n1.1.2  PHP 5.3之后的新特性\t3\n1.1.3  PHP程序员应具备的知识\t4\n1.1.4  B/S结构软件开发特点\t5\n1.1.5  PHP与其他脚本语言的比较\t6\n1.2  XHTML基础知识\t7\n1.2.1  XHTML基础介绍\t7\n1.2.2  XHTML语言的语法\t7\n1.2.3  文件的主体结构\t8\n1.2.4  XHTML文字、图像、视频、动画\n的处理\t9\n1.2.5  XHTML中表单的处理\t16\n1.2.6  XHTML中框架的处理\t18\n1.2.7  XHTML中表格的处理\t21\n1.2.8  传统布局与CSS布局的介绍\t23\n1.2.9  CSS语法与写作规范\t24\n1.2.10  CSS文字、图像的处理\t26\n1.2.11  DIV与CSS组合\t27\n1.2.12  CSS兼容的处理\t31\n1.3  本章小结\t33\n第2章  PHP环境搭建与工具\t34\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n2.1  PHP环境介绍\t34\n2.1.1  WAMP环境介绍\t34\n2.1.2  LAMP环境介绍\t35\n2.1.3  WAMP与LAMP的差异\t35\n2.2  WAMP安装与配置\t36\n2.2.1  Apache的获取与安装\t36\n2.2.2  PHP的获取与安装\t39\n2.2.3  MySQL的获取与安装\t40\n2.2.4  环境配置与测试\t46\n2.3  LAMP安装与配置\t48\n2.3.1  Linux的获取与安装配置\t48\n2.3.2  Linux下Apache的安装\t50\n2.3.3  Linux下PHP的安装\t52\n2.3.4  Linux下MySQL的安装\t53\n2.4  环境组件配置\t54\n2.5  PHP开发相关工具\t54\n2.5.1  开发工具介绍\t54\n2.5.2  EclipsePHP Sudio\t56\n2.6  本章小结\t59\n第3章  PHP的基本语法\t61\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n3.1  PHP的基本语法\t61\n3.1.1  PHP语言标记\t62\n3.1.2  PHP语句分割符\t62\n3.1.3  PHP注释与语法标识符\t63\n3.2  变量\t64\n3.2.1  变量的声明与命名\t64\n3.2.2  可变变量与引用赋值\t64\n3.3  变量类型\t65\n3.3.1  字符串（String）\t65\n3.3.2  整型（integer）\t66\n3.3.3  浮点型（float或double）\t66\n3.3.4  布尔型（boolean）\t67\n3.3.5  数组（Array）\t67\n3.3.6  对象（Object）\t68\n3.3.7  资源类型（Resource）\t68\n3.3.8  类型的强制转换与应用\t68\n3.4  常量\t70\n3.4.1  系统常量\t70\n3.4.2  自定义常量\t70\n3.5  PHP中的运算符\t71\n3.5.1  算术运算符\t71\n3.5.2  字符串运算符\t72\n3.5.3  赋值运算符\t72\n3.5.4  位运算符\t73\n3.5.5  比较运算符\t74\n3.5.6  逻辑运算符\t74\n3.5.7  运算符的优先级\t75\n3.6  PHP流程控制\t76\n3.6.1  if else语句\t76\n3.6.2  switch语句\t78\n3.7  PHP循环结构\t79\n3.7.1  while语句\t80\n3.7.2  do while语句\t80\n3.7.3  for语句\t81\n3.7.4  break和continue语句\t82\n3.8  PHP的函数\t83\n3.8.1  PHP系统函数介绍\t83\n3.8.2  PHP自定义函数基础\t84\n3.8.3  PHP自定义函数参数\t86\n3.8.4  PHP自定义函数引用传递\t86\n3.8.5  PHP自定义函数递归与嵌套\t87\n3.9  本章小结\t88\n第4章  PHP中的数组\t89\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n4.1  PHP数组基础\t89\n4.1.1  什么是数组\t89\n4.1.2  PHP创建数组\t89\n4.1.3  一维数组和多维数组\t91\n4.1.4  数组函数的介绍\t93\n4.1.5  遍历数组\t101\n4.2  PHP系统全局数组\t104\n4.2.1  服务器数组$_SERVER\t105\n4.2.2  环境数组$_ENV\t106\n4.2.3  HTTP数组$_GET\t106\n4.2.4  HTTP数组$_POST\t106\n4.2.5  HTTP数组$_REQUEST\t107\n4.2.6  文件数组$_FILES\t107\n4.2.7  cookie数组 $_COOKIE\t107\n4.2.8  session 数组 $_SESSION\t107\n4.2.9  全局数组 $GLOBALS\t109\n4.3  本章小结\t109\n第5章  PHP面向对象编程\t109\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n5.1  面向对象的基础知识\t109\n5.1.1  什么是面向对象编程\t109\n5.1.2  PHP中类和对象介绍\t110\n5.1.3  PHP对象的应用和$this关键字\t113\n5.1.4  构造方法与析构方法\t114\n5.2  类的继承和重载\t116\n5.2.1  类的继承\t116\n5.2.2  类的重载\t118\n5.3  类的封装\t120\n5.3.1  设置封装public、protected、\nprivate\t120\n5.3.2  __set()、__get()、__isset()和\n__unset()\t124\n5.4  常用关键字\t128\n5.4.1  static关键字\t128\n5.4.2  final关键字\t129\n5.4.3  self关键字\t130\n5.4.4  const关键字\t131\n5.4.5  __toString()描述\t131\n5.4.6  __clone()克隆\t132\n5.4.7  __call() 吸错\t134\n5.4.8  __autoload() 自动加载\t135\n5.5  本章小结\t135\n第6章  字符串处理与正则表达式\t136\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n6.1  字符串的处理介绍\t136\n6.1.1  字符串的处理方式\t136\n6.1.2  字符串类型的特点\t136\n6.2  常用字符串函数解析\t136\n6.2.1  字符串的输出函数echo()\t138\n6.2.2  程序报错后终止继续运行的函数\t138\n6.2.3  打印函数print_r()\t139\n6.2.4  字符串分割函数explode()\t139\n6.2.5  数组元素组合成字符串的\n函数implode()\t140\n6.2.6  预定义字符串转换为HTML实体\n的函数htmlspecialchars()\t141\n6.2.7  过滤PHP和HTML标记函数\nstrip_tags()\t142\n6.2.8  去除字符串首尾连续空格的函数\t143\n6.2.9  将换行符替换成HTML的换行符\n<br/>的函数nl2br()\t144\n6.2.10  加密函数md5()\t145\n6.2.11  加密函数sha1()\t146\n6.2.12  字符串替换函数str_replace()\t147\n6.2.13  数字分组格式化函数number_\nformat()\t148\n6.2.14  字符串分割函数str_split()\t149\n6.2.15  字符串截取函数substr()\t150\n6.2.16  中文字符串截取函数icon()、\n编码转换函数iconv_substr()\t150\n6.3  日期函数的介绍\t151\n6.3.1  UNIX时间戳和获取当前的时间\t152\n6.3.2  时间和日期函数的介绍\t153\n6.3.3  修改PHP的默认时区\t156\n6.4  正则表达式\t157\n6.4.1  正则表达式简介\t157\n6.4.2  正则表达式的语法规则\t158\n6.4.3  正则表达式的优先级\t160\n6.4.4  PHP正则表达式函数（兼容Perl）\t160\n6.5  本章小结\t164\n第7章  PHP文件系统处理\t165\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n7.1  PHP中文件系统的介绍\t165\n7.1.1  文件系统概述\t165\n7.1.2  文件类型\t165\n7.1.3  文件属性\t166\n7.1.4  文件访问权限\t169\n7.1.5  路径处理\t170\n7.2  文件的基本操作\t171\n7.2.1  文件操作概述\t171\n7.2.2  打开与关闭\t171\n7.2.3  PHP读取内容\t172\n7.2.4  PHP写入内容\t174\n7.2.5  PHP删除文件\t175\n7.2.6  文件截取、远程读取操作\t176\n7.3  目录的基本操作\t181\n7.3.1  新建目录\t182\n7.3.2  删除目录和递归删除目录\t182\n7.3.3  复制和移动目录\t183\n7.3.4  遍历目录\t186\n7.4  文件的上传与安全\t187\n7.4.1  相关设置\t187\n7.4.2  单文件上传\t188\n7.4.3  多文件上传和安全\t189\n7.5  本章小结\t191\n第8章  MySQL数据库\t192\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n8.1  MySQL数据库介绍\t192\n8.2  MySQL数据库基础\t193\n8.2.1  下载MySQL数据库\t193\n8.2.2  安装MySQL数据库\t194\n8.3  MySQL数据库设计\t194\n8.3.1  MySQL数据库的关系\t194\n8.3.2  MySQL数据库中的数据类型\t194\n8.4  SQL语言\t195\n8.4.1  SQL简介\t195\n8.4.2  常用SQL语句的使用\t196\n8.5  MySQL数据库的备份与恢复\t200\n8.5.1  MySQL数据库的备份\t201\n8.5.2  MySQL数据库的恢复\t204\n8.6  PHP与MySQL编程\t206\n8.6.1  PHP连接MySQL数据库\t206\n8.6.2  PHP操作MySQL\t208\n8.7  PHP与mysqli编程\t211\n8.7.1  mysqli简介\t211\n8.7.2  PHP使用mysqli连接数据库\t211\n8.7.3  PHP使用mysqli操作MySQL\n数据库\t212\n8.8  小实例之留言反馈系统\t214\n8.8.1  需求分析\t214\n8.8.2  数据库设计\t215\n8.8.3  程序设计\t216\n第9章  数据库抽象层——PDO和\nADOdb\t223\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n9.1  PDO和ADOdb介绍\t223\n9.1.1  PDO简介\t223\n9.1.2  PDO的特点\t224\n9.1.3  PDO的开启\t224\n9.1.4  ADOdb介绍\t225\n9.1.5  ADOdb特点\t225\n9.1.6  ADOdb安装\t225\n9.2  创建PDO对象\t226\n9.2.1  连接和断开连接PDO\t226\n9.2.2  使用PDO::query()方法\t227\n9.2.3  预执行语句\t228\n9.2.4  PDO错误处理\t229\n9.3  PDO的事务处理\t231\n9.3.1  PDO数据库事务介绍\t231\n9.3.2  PDO事务处理\t231\n9.4  创建ADOdb对象\t233\n9.4.1  连接和断开连接ADOdb\t233\n9.4.2  ADOdb执行操作\t234\n9.4.3  预执行SQL语句\t237\n9.4.4  自动执行AutoExecute()方法\t237\n9.4.5  ADOdb其他的常用功能\t238\n9.5  ADOdb的事务处理\t241\n9.5.1  ADOdb开始事务\t241\n9.5.2  ADOdb事务提交\t241\n9.5.3  ADOdb回滚事务\t241\n9.5.4  ADOdb事务实例\t242\n9.6  传统模式与抽象层开发对比\t242\n9.7  本章小结\t247\n第10章  Cookie与Session\t248\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n10.1  会话机制介绍\t248\n10.1.1  什么是会话机制\t248\n10.1.2  会话的基本功能\t248\n10.2  Cookie机制的应用\t249\n10.2.1  了解Cookie\t249\n10.2.2  创建Cookie\t250\n10.2.3  读取Cookie\t251\n10.2.4  删除Cookie\t252\n10.2.5  Cookie的生命周期\t253\n10.2.6  Cookie的综合应用——使用\nCookie技术计算网站的月访问量\t253\n10.3  Session管理\t254\n10.3.1  了解Session\t254\n10.3.2  创建会话\t255\n10.3.3  Session的综合应用——通过\nSession用户身份验证\t257\n10.4  会话机制的安全\t261\n10.4.1  Cookie与Session的比较\t261\n10.4.2  Cookie与Session的安全性\t262\n10.5  会员系统的设计\t264\n10.6  本章小结\t267\n第11章  PHP的模板技术Smarty\t269\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n11.1  模板引擎技术简介\t269\n11.2  Smarty模板的创建\t270\n11.3  Smarty基础应用\t272\n11.4  Smarty内置函数\t273\n11.4.1  Smarty的使用\t273\n11.4.2  Smarty的循环\t273\n11.4.3  Smarty的if…elseif…else语法\t275\n11.4.4  Smarty循环配合if使用小实例\t276\n11.4.5  include的使用方法\t276\n11.5  Smarty缓存机制\t278\n11.5.1  lamp架构的缓存原理\t278\n11.5.2  Smarty缓存\t279\n11.6  小型新闻系统范例\t280\n11.7  本章小结\t283\n第12章  PHP图形处理及应用\t284\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n12.1  PHP GD库基础\t284\n12.1.1  PHP GD库简介\t284\n12.1.2  PHP GD库的使用\t285\n12.2  PHP GD库的应用\t286\n12.2.1  GD库函数库绘制基本图形\t286\n12.2.2  GD库制作图形验证码\t291\n12.2.3  GD库实现图片缩略与水印\t293\n12.3  JPGraph图表类\t295\n12.3.1  JPGraph图形库简介\t295\n12.3.2  JPGraph图形库的使用\t297\n12.4  本章小结\t298\n第13章  PHP与XML\t300\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n13.1  XML基础\t300\n13.1.1  XML的含义\t300\n13.1.2  XML的特性\t300\n13.1.3  XML文档的结构\t301\n13.2  PHP与XML Parser\t304\n13.2.1  XML Parse工作原理\t304\n13.2.2  新建一个解析器\t304\n13.2.3  创建事件处理程序\t304\n13.2.4  解析XML文档\t305\n13.2.5  处理解析错误\t306\n13.3  PHP DOMdocument\t308\n13.3.1  创建一个DOM对象并装载XML\n文档\t308\n13.3.2  使用DOM文档创建XML文档\t309\n13.3.3  使用DOM操作XML文档\t311\n13.4  RSS功能的实现\t313\n13.5  本章小结\t316\n第14章  PHP与cURL\t317\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n14.1  cURL简介\t317\n14.1.1  cURL的历史\t317\n14.1.2  cURL的定义\t317\n14.1.3  PHP与cURL的关系\t318\n14.2  cURL的基础与应用\t318\n14.2.1  cURL功能初始化\t318\n14.2.2  cURL功能设置与函数\t318\n14.2.3  cURL传输功能\t321\n14.2.4  cURL模拟功能\t323\n14.3  PHP实现模拟登录并获取数据\t323\n14.3.1  cURL模拟登录的流程\t323\n14.3.2  cURL模拟状态的保存\t323\n14.3.3  cURL远程采集数据\t324\n14.4  模拟登录PHP个人中心\t324\n14.5  本章小结\t326\n第15章  PHP功能模块的开发\t327\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n15.1  分页模块开发\t327\n15.1.1  分页模块的介绍\t327\n15.1.2  分页模块的原理\t327\n15.1.3  分页类的设计\t329\n15.2  无限分类模块开发\t334\n15.2.1  无限分类模块的介绍\t334\n15.2.2  无限分类的数据库存储\t334\n15.2.3  无限分类的实现与操作\t335\n15.3  批量上传模块开发\t340\n15.3.1  批量上传模块的介绍\t340\n15.3.2  批量上传模块的原理\t340\n15.3.3  批量上传类的设计\t341\n15.4  数据库备份模块开发\t347\n15.4.1  数据库备份模块的介绍\t347\n15.4.2  数据库备份模块的原理\t347\n15.5  在线支付——支付宝开发\t350\n15.5.1  在线支付概述\t350\n15.5.2  实现在线支付接口的原理和流程\t351\n15.5.3  支付宝接口即时到账开发和配置\t352\n15.5.4  在线支付案例——报名支付\t354\n15.6  本章小结\t363\n第16章  项目开发与设计\t364\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n16.1  项目开发与设计规范\t364\n16.1.1  程序设计规范\t364\n16.1.2  设计规范小结\t367\n16.1.3  项目开发的一般流程\t367\n16.2  Subversion版本控制器\t370\n16.2.1  SVN介绍\t370\n16.2.2  SVN安装与配置\t371\n16.2.3  客户端的安装\t373\n16.2.4  SVN的基本操作\t375\n16.3  Zend Debugger调试器\t377\n16.3.1  Zend Debugger安装与配置\t378\n16.3.2  Zend Debugger应用\t379\n16.4  本章小结\t379\n第17章  OA管理系统开发\t381\n（教学视频、PPT、必备手册、开发工具、精选源码、相关素材）\n17.1  需求分析\t381\n17.2  系统设计\t381\n17.2.1  系统目标\t381\n17.2.2  系统功能结构\t381\n17.2.3  系统流程图\t382\n17.2.4  开发环境\t383\n17.3  数据库与表的设计\t383\n17.4  Ease Template模板引擎简介\t385\n17.4.1  配置文件\t385\n17.4.2  模板中的变量\t387\n17.4.3  模板中的逻辑\t388\n17.5  代码设计概述\t391\n17.5.1  公共文件的设计\t391\n17.5.2  会员系统模块\t392\n17.5.3  工作计划模块\t399\n17.5.4  公告管理模块\t403\n17.5.5  消息中心模块\t406\n17.5.6  客户关系模块\t410\n17.6  程序的测试与发布\t412\n17.6.1  程序的测试\t413\n17.6.2  程序的发布\t413\n17.7  本章小结\t415\n第18章  附录\t416\n18.1  httpd.conf配置文件说明\t416\n18.2  php.ini配置文件说明\t426\n",
      pages: "442",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s9115944.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s9115944.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s9115944.jpg"
      },
      alt: "https://book.douban.com/subject/10564005/",
      id: "10564005",
      publisher: "清华大学",
      isbn10: "7302282064",
      isbn13: "9787302282068",
      title: "名师讲坛",
      url: "https://api.douban.com/v2/book/10564005",
      alt_title: "",
      author_intro: "",
      summary:
        "《名师讲坛:PHP开发实战权威指南》主要介绍了PHP 5编程的相关知识。主要内容包括PHP基础知识与XHTML、PHP环境搭建与工具、PHP的基本语法、PHP中的数组、PHP面向对象编程、字符串处理与正则表达式、PHP文件系统处理、MySQL数据库、数据库抽象层——PDO和ADOdb、Cookie和Session、PHP的模板技术Smarty、PHP图形处理及应用、PHP与XML、PHP与cURL、PHP功能模块的开发、项目开发与设计以及OA管理系统开发等。《名师讲坛:PHP开发实战权威指南》既适合作为PHP初中级学者的参考书，也适合作为高等院校相关专业、软件学院的教材。",
      price: "59.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 46,
        average: "8.0",
        min: 0
      },
      subtitle: "第3版",
      author: ["厄尔曼"],
      pubdate: "2010-01-01",
      tags: [
        {
          count: 77,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 28,
          name: "编程",
          title: "编程"
        },
        {
          count: 19,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 10,
          name: "入门",
          title: "入门"
        },
        {
          count: 9,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 9,
          name: "基础",
          title: "基础"
        },
        {
          count: 8,
          name: "网站开发",
          title: "网站开发"
        },
        {
          count: 6,
          name: "web",
          title: "web"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s6633933.jpg",
      binding: "平装",
      translator: ["贾菡", "刘彦博"],
      catalog:
        "第1章　php概述\n1.1　xhtml语法基础\n1.2　php语法基础\n1.3　测试脚本\n1.4　向浏览器发送文本\n1.5　向浏览器发送html\n1.6　使用空白\n1.7　为脚本添加注释\n1.8　调试的基本步骤\n第2章　变量\n2.1　什么是变量\n2.2　变量语法\n2.3　变量类型\n2.4　为变量赋值\n2.5　理解引号\n第3章　html表单和php\n3.1　创建一个简单的表单\n3.2　使用get或者post\n3.3　使用php接收表单数据\n3.4　显示错误\n3.5　错误报告\n3.6　向页面手动发送数据\n第4章　使用数值\n4.1　创建表单\n4.2　算术运算\n4.3　格式化数值\n4.4　理解优先级\n4.5　数值的自增和自减\n4.6　创建随机数\n第5章　使用字符串\n5.1　创建html表单\n5.2　连接字符串\n5.3　处理换行符\n5.4　html和php\n5.5　字符串的编码和解码\n5.6　查找子字符串\n5.7　替换局部字符串\n第6章　控制结构\n6.1　创建html表单\n6.2　if条件语句\n6.3　验证函数\n6.4　使用else\n6.5　更多运算符\n6.6　使用elseif\n6.7　switch条件语句\n6.8　for循环\n第7章　使用数组\n7.1　什么是数组\n7.2　创建数组\n7.3　向数组添加项\n7.4　访问数组元素\n7.5　创建多维数组\n7.6　对数组排序\n7.7　字符串和数组之间的转换\n7.8　在表单中创建数组\n第8章　创建web应用程序\n8.1　创建模板\n8.2　使用外部文件\n8.3　使用常量\n8.4　使用日期和时间\n8.5　再谈使用php处理html表单\n8.6　使表单更具粘性\n8.7　发送email\n8.8　输出缓冲\n8.9　处理http头\n第9章　cookie和session\n9.1　什么是cookie\n9.2　创建cookie\n9.3　读取cookie\n9.4　向cookie添加参数\n9.5　删除cookie\n9.6　什么是session\n9.7　创建session\n9.8　访问session变量\n9.9　删除session\n第10章　创建函数\n10.1　创建和使用简单函数\n10.2　创建和调用接受参数的函数\n10.3　设置参数默认值\n10.4　创建和使用带有返回值的函数\n10.5　理解变量作用域\n第11章　文件和目录\n11.1　文件权限\n11.2　写入文件\n11.3　锁定文件\n11.4　读取文件\n11.5　处理文件上传\n11.6　导航目录\n11.7　创建目录\n11.8　增量读取文件\n第12章　数据库介绍\n12.1　sql介绍\n12.2　连接mysql\n12.3　mysql错误处理\n12.4　创建和选择数据库\n12.5　创建表\n12.6　向数据库插入数据\n12.7　安全查询数据\n12.8　从数据库中检索数据\n12.9　删除数据库中的数据\n12.10　更新数据库中的数据\n第13章　正则表达式\n13.1　什么是正则表达式\n13.2　匹配模式\n13.3　使用字面值\n13.4　使用元字符\n13.5　使用限定符\n13.6　使用类\n13.7　匹配和替换模式\n附录a　安装和配置\n附录b　深入学习php的资源",
      pages: "374",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6633933.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6633933.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6633933.jpg"
      },
      alt: "https://book.douban.com/subject/4225166/",
      id: "4225166",
      publisher: "人民邮电出版社",
      isbn10: "7115216789",
      isbn13: "9787115216786",
      title: "PHP基础教程",
      url: "https://api.douban.com/v2/book/4225166",
      alt_title: "",
      author_intro:
        "Larry Ullman 国际知名的技术作家，拥有20多年编程经验，精通多种语言和技术。他是DMC Insights公司的总裁和数字媒体技术总监，曾担任朗讯和Oracle 等世界顶尖公司的顾问，并曾授课于加州大学伯克利分校、宾州大学等名校。除本书外，他撰写的多部图书都广受世界读者欢迎，享有极高声誉。",
      summary:
        "《PHP基础教程(第3版)》非常通俗易懂地向初学者介绍了PHP语言的基本概念、使用方法和注意事项。全书通过丰富的示例，引领读者逐步掌握这门流行的Web开发语言，使读者能够上手亲自编写适用于常用场景的PHP脚本。《PHP基础教程(第3版)》适合有基本的HTML经验的读者阅读。\n\n  点击链接进入新版：  Web开发系列:PHP基础教程(第4版)",
      price: "49.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle: "Linux, Apache, MySQL and PHP Web Development",
      author: [
        "Jason Gerner",
        "Morgan Owens",
        "Elizabeth Naramore",
        "Matt Warden",
        "Jeremy Stolz"
      ],
      pubdate: "2005-12-05",
      tags: [
        {
          count: 3,
          name: "LAMP",
          title: "LAMP"
        },
        {
          count: 1,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 1,
          name: "series:Professional",
          title: "series:Professional"
        },
        {
          count: 1,
          name: "opensource",
          title: "opensource"
        },
        {
          count: 1,
          name: "Professional",
          title: "Professional"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4188684.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "379",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4188684.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4188684.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4188684.jpg"
      },
      alt: "https://book.douban.com/subject/2357704/",
      id: "2357704",
      publisher: "Wrox",
      isbn10: "076459723X",
      isbn13: "9780764597237",
      title: "Professional LAMP",
      url: "https://api.douban.com/v2/book/2357704",
      alt_title: "",
      author_intro: "",
      summary:
        "The combination of Linux, Apache, MySQL, and PHP is popular because of interaction, flexibility, customization, and - most importantly - the cost effectiveness of its components. This title helps LAMP professionals take their skills to the next level with in-depth discussions of OOP; extensions of PHP such as PEAR, GD, XML, and CURL; improving site security; and, advanced tools available to the coder. Those proficient in other languages such as Java, C++, Perl and ASP will find this guide invaluable when transitioning to the LAMP environment. The Web site includes sample scripts created in the course of each chapter, and several applications that can be modified and reused.",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 5,
        average: "0.0",
        min: 0
      },
      subtitle: "Tuning PHP Web Projects for Maximum Performance",
      author: ["Armando Padilla", "Tim Hawkins", "Aaron Saray"],
      pubdate: "2011-01-01",
      tags: [
        {
          count: 2,
          name: "php",
          title: "php"
        },
        {
          count: 2,
          name: "performance",
          title: "performance"
        },
        {
          count: 2,
          name: "PHP性能",
          title: "PHP性能"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "专业",
          title: "专业"
        },
        {
          count: 1,
          name: "2013",
          title: "2013"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s5521120.jpg",
      binding: "平装",
      translator: [],
      catalog:
        "■Contents ................................................................................................................ v\n■About the Authors ............................................................................................... xii\n■About the Technical Reviewer ............................................................................ xiii\n■Acknowledgments .............................................................................................. xiv\n■Introduction ........................................................................................................ xv\n■Chapter 1: Benchmarking Techniques .................................................................. 1\n■Chapter 2: Improving Client Download and Rendering Performance .................. 25\n■Chapter 3: PHP Code Optimization ...................................................................... 55\n■Chapter 4: Opcode Caching ................................................................................. 83\n■Chapter 5: Variable Caching .............................................................................. 109\n■Chapter 6: Choosing the Right Web Server ....................................................... 131\n■Chapter 7: Web Server and Delivery Optimization ............................................ 165\n■Chapter 8: Database Optimization ..................................................................... 189\n■Appendix A: Installing Apache, MySQL, PHP, and PECL on Windows ................ 209\n■Appendix B: Installing Apache, MySQL, PHP, and PECL on Linux ..................... 227\n■Index ................................................................................................................. 233",
      pages: "264",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s5521120.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s5521120.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s5521120.jpg"
      },
      alt: "https://book.douban.com/subject/5908778/",
      id: "5908778",
      publisher: "Apress",
      isbn10: "1430228989",
      isbn13: "9781430228981",
      title: "Pro PHP Application Performance",
      url: "https://api.douban.com/v2/book/5908778",
      alt_title: "",
      author_intro:
        "■ Armando Padilla has worked within the web technology industry for 13 years,\nparticipating and leading every aspect of a LAMP-based web application. His\nPHP experience began in 1998, when he created a small PHP web page for Thomas\nJefferson High School (Los Angeles). Armando’s most recent work has been for Yahoo!\nas a senior engineer working on high-profile and high-traffic applications, such as the\nWinter 2010 Olympics, 2010 FIFA World Cup, and Yahoo News mobile applications.\nArmando now spends much of his time dabbling with new web technologies, reading\nPHP/Zend–related books, and being with his family.\n■ Tim Hawkins produced one of the world’s first online classifieds portals in 1993,\nloot.com, before moving on to run engineering for many of Yahoo EU’s non-mediabased\nproperties, such as Search, Local Search, Mail, Messenger, and its social\nnetworking products. He is currently managing a large offshore team for a major US\ne-tailer, developing and deploying next-generation e-commerce applications. He\nloves hats and hates complexity.\n■ Aaron Saray has been madly in love with PHP since 2001. As a Zend Certified\nEngineer, Milwaukee PHP users group organizer, author, and technical editor, Aaron\ncontinues to remain active in the PHP community. He continues to push out new\nopen source software as well as keep a web development blog on\nhttp://aaronsaray.com.",
      summary:
        "Pro PHP Application Performance will help you understand all the technologies and components which play a role in how well your applications run. When seconds can mean the difference between retaining a user and losing a user, it's important for all of us to have optimization as part of our project roadmap. But what components within your application should you analyze? How should you optimize? And how can you measure how well your application is performing? These are some of the questions that are answered in this book. Along the way you will also learn the \"why\" of optimizing. You'll discover why you should optimize a specific component, why selecting one function over another is beneficial, and how to find and use the optimization tools available to the open source community. You'll also learn how to deploy caching software as well as web server software. Pro PHP Application Performance will also teach you more advanced techniques, such as: Using Xdebug to profile functions that are not running as efficiently as possible. Comparing opcode executed by different PHP functions to narrow the search for functions that run efficiently.  Using strace to analyze Apache while your application is served to the user. Once you complete this book you will have a complete sense of where to start optimizing and, most importantly, have the tools which allow you to continue optimizing in other PHP applications going forward. What you'll learn * How to improve the performance of existing PHP applications * How to maximize the performance of existing operating systems and databases * How to refactor existing PHP code for better performance * How to identify and rectify bottlenecks in PHP code * How to take advantage of variable caching to increase performance * Strategies for selecting server hardware for best performance Who this book is for This book will appeal to established PHP developers who wish to write new, complex applications or want to rearchitect existing ones. Developers of other languages such as Ruby, Python, and VB.NET will also have an interest in the techniques for tuning the performance of web servers, databases, and operating systems.  Table of Contents * Benchmarking Techniques * Improving Client Download and Rendering Performance * PHP Code Optimization * Opcode Caching * Variable Caching * Choosing the Right Web Server * Web Server and Delivery Optimization * Database Optimization * Installing Apache, MySQL, PHP, and PECL on Windows * Installing Apache, MySQL, PHP, and PECL on Linux",
      price: "$ 56.49"
    },
    {
      rating: {
        max: 10,
        numRaters: 3,
        average: "0.0",
        min: 0
      },
      subtitle:
        "A Beginner's Guide to PHP Data Objects, Database Connection Abstraction Library for PHP 5",
      author: ["Dennis Popel"],
      pubdate: "2007-08-30",
      tags: [
        {
          count: 3,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 1,
          name: "祁杰",
          title: "祁杰"
        },
        {
          count: 1,
          name: "PDO",
          title: "PDO"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4139126.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "188",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4139126.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4139126.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4139126.jpg"
      },
      alt: "https://book.douban.com/subject/3113426/",
      id: "3113426",
      publisher: "Packt Publishing",
      isbn10: "1847192661",
      isbn13: "9781847192660",
      title: "Learning PHP Data Objects",
      url: "https://api.douban.com/v2/book/3113426",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 28,
        average: "9.0",
        min: 0
      },
      subtitle: "",
      author: ["Sara Golemon"],
      pubdate: "2006-6-9",
      tags: [
        {
          count: 44,
          name: "php",
          title: "php"
        },
        {
          count: 36,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 21,
          name: "深入了解php",
          title: "深入了解php"
        },
        {
          count: 17,
          name: "扩展",
          title: "扩展"
        },
        {
          count: 14,
          name: "技术提升",
          title: "技术提升"
        },
        {
          count: 12,
          name: "zend",
          title: "zend"
        },
        {
          count: 9,
          name: "编程",
          title: "编程"
        },
        {
          count: 7,
          name: "技术",
          title: "技术"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s1918674.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "456",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s1918674.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s1918674.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s1918674.jpg"
      },
      alt: "https://book.douban.com/subject/1922702/",
      id: "1922702",
      publisher: "Sams",
      isbn10: "067232704X",
      isbn13: "9780672327049",
      title: "Extending and Embedding PHP",
      url: "https://api.douban.com/v2/book/1922702",
      alt_title: "",
      author_intro: "",
      summary:
        "In just a few years PHP has rapidly evolved from a small niche language to a powerful web development tool. Now in use on over 14 million Web sites, PHP is more stable and extensible than ever. However, there is no documentation on how to extend PHP; developers seeking to build PHP extensions and increase the performance and functionality of their PHP applications are left to word of mouth and muddling through PHP internals without systematic, helpful guidance. Although the basics of extension writing are fairly easy to grasp, the more advanced features have a tougher learning curve that can be very difficult to overcome. This is common at any moderate to high-traffic site, forcing the company hire talented, and high-priced, developers to increase performance. With Extending and Embedding PHP, Sara Golemon makes writing extensions within the grasp of every PHP developer, while guiding the reader through the tricky internals of PHP.",
      price: "USD 54.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 47,
        average: "6.5",
        min: 0
      },
      subtitle: "",
      author: ["Peter MacIntyre"],
      pubdate: "2012-03-01",
      tags: [
        {
          count: 42,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 11,
          name: "编程",
          title: "编程"
        },
        {
          count: 8,
          name: "web",
          title: "web"
        },
        {
          count: 5,
          name: "programming",
          title: "programming"
        },
        {
          count: 4,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 4,
          name: "Web",
          title: "Web"
        },
        {
          count: 4,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 2,
          name: "计算机",
          title: "计算机"
        }
      ],
      origin_title: "PHP: The Good Parts",
      image: "https://img3.doubanio.com/view/subject/m/public/s8883470.jpg",
      binding: "平装",
      translator: ["刘涛"],
      catalog:
        "序\n第1章 精粹\n为什么是PHP\nPHP历史摘要\nPHP的地位\nPHP是什么\nPHP有哪些成就\nPHP基本设置\n第2章 “实地勘察”\n空白、注释和基本语法\n变量：数据类型、弱类型和作用域\n定义常量\n表达式\n判断、选择（流程控制）\nIf Else\nSwitch Case\nWhile\nFor\nWeb页面交互\n客户端 Cookie\nSessions\n$_GET\n$_POST\n$_REQUEST\n第3章 函数（代码复用）\n参数传递\n参数默认值\n传值和传引用\ninclude 和 require\n内置函数和用户定义函数\n第4章 字符串\n什么是字符串\n你能引用我\n字符串函数（精选）\n字符串截取\n管理字符的大小写\n字符串查找\n字符串编辑\n第5章 数组\n索引数组\n关联数组\n多维数组\n数组可以动态构建\n遍历数组\n数组函数精选\n数组排序\n数学类函数\n其他数组函数\n第6章 对象\n付诸实践\n魔术方法\n变量 $this\n对象实战\n公开的、保护的和私有的\nget和set访问器\n第7章 数据库交互\nMySQLi 对象接口\n取得数据并显示\nPHP数据对象（PDO）\nPDO 预处理对象\n低成本数据管理方案\nSQLite\n用文件替代数据库\n第8章 PHP周边\n电子邮件/短信生成\nPDF生成\n构造方法和基本选项\n添加页眉和页脚\n添加图片和链接\n添加水印\n显示动态 PDF 文件和表格\n图形报表生成\n饼图\n柱状图\n图形验证码\n第9章 PHP的安全性\n数据验证\n转义输出\n跨站脚本（XXS）和SQL注入\n密码加密安全\n安全技巧\n第10章 PHP 5 3 精粹\n命名空间\n闭包（匿名函数）\nNOWDOC\ngoto 操作符\nDateTime 和DateTimeZone类\n额外的5 3特征\n第11章 高级优势\n正则表达式\n字符串匹配\n字符串替换\n字符串分割\nSimpleXML\n集成开发环境\nKomodo by ActiveState\nZend Studio for Eclipse\nPhpED by NuSphere\n主要网站\nphp net\nzend com\ndevzone zend com\nphparch com\nPHP/Web 会议\n附录 缺点\n索引",
      pages: "163",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s8883470.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s8883470.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s8883470.jpg"
      },
      alt: "https://book.douban.com/subject/10517225/",
      id: "10517225",
      publisher: "电子工业出版社",
      isbn10: "7121153858",
      isbn13: "9787121153853",
      title: "PHP语言精粹",
      url: "https://api.douban.com/v2/book/10517225",
      alt_title: "PHP: The Good Parts",
      author_intro: "",
      summary:
        "《PHP语言精粹》是一本可以带你迈入PHP殿堂的书。PHP作为当今主流的服务器端开发语言，广泛应用于世界上各种排名比较靠前的网站，如Facebook、Flickr和Wikipedia等。其广泛的应用与其强大的功能相辅相成，密不可分。在《PHP语言精粹》中，你将看到PHP中最为精华的特征，包括类型系统、面向对象机制、数据库交互、安全性保证、内建函数库等。通过书中极为实用的代码，上述特征的学习和应用将被无缝连接在一起。作者Peter B. MacIntyre在软件开发领域已有超过20年的经验，曾是PHP|Architect杂志的特约编辑和作者。长期从事PHP相关的工作使作者对PHP的发展历程非常了解。这也使《PHP语言精粹》不单可以让人了解PHP当前是什么样子，也可以让人了解到它为什么是现在这个样子。",
      price: "39.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP必须知道的300个问题",
      author: [],
      pubdate: "2012-01-01",
      tags: [
        {
          count: 5,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 2,
          name: "php",
          title: "php"
        },
        {
          count: 1,
          name: "搞笑",
          title: "搞笑"
        },
        {
          count: 1,
          name: "图片",
          title: "图片"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s8938095.jpg",
      binding: "",
      translator: [],
      catalog:
        "第1章 PHP开发规范与入门要点\n问题1 如何在Windows下配置PHP开发环境？\n问题2 如何在Linux下配置PHP开发环境？\n问题3 如何搭建IIS+PHP+MySQL环境？\n问题4 PHP集成开发环境的特点有哪些？\n问题5 如何应用AppServ搭建PHP开发环境？\n问题6 如何通过XAMPP配置PHP开发环境？\n问题7 XAMPP-Linux版PHP集成化安装包\n问题8 Apache配置文件全解\n问题9 PHP.INI配置文件全解\n问题10 Apache不能处理PHP文件\n问题11 无法找到httpd.h文件\n问题12 Apache不能启动的解决方法\n问题13 如何解决Apache服务器端口冲突？\n问题14 如何配置Apache虚拟主机？\n问题15 如何动态加载扩展库？\n问题16 register globals（注册为全局变量）的开启与关闭\n问题17 为什么要设置时区？\n问题18 如何在Dreamweaver中创建站点？\n问题19 如何使用Dreamweaver开发PH程序？\n问题20 如何使用Dreamweaver识别phtml的模板文件？\n问题21 如何在Windows下安装和配置phpMyAdmiIl？\n问题22 如何在Linux下安装和配置phpMyAdmin？\n问题23 如何应用phpMyAdmin修改数据库的用户名和密码？\n问题24 如何应用phpMyAdmin创建数据库与数据表？\n问题25 如何应用phpMyAdmin导入和导出MySQL数据库脚本？\n问题26 如何打开magic quotes gpc来防止SQL注入？\n问题27 如何对错误提示信息进行控制？\n问题28 如何记录错误日志？\n问题29 如何解决使用MySQL函数导致Apache（IIS）崩溃的问题？\n问题30 HTTPApache错误代码都有哪些？分别代表什么含义？\n第2章 PHP基础\n问题31 提高编程效率的24招\n问题32 为什么页面之间无法传递变量？\n问题33 为什么Win32下Apache2用ge方法传递中文参数会出错？\n问题34 如何从文本中移除空白内容？\n问题35 如何获取上传文件的后缀？\n问题36 如何实现货币数据的格式化输出？\n问题37 如何解决用substr（）函数对中文字符串截取时的乱码？\n问题38 如何获取多个数组元素的键名？\n问题39 为什么$array[str]错了？\n问题40 如何设置PHP的错误级别？\n问题41 PHP有哪几种注释形式？\n问题42 如何使用empty（）函数判断文本框是否为空？\n问题43 如何使用strlen（）函数计算文本长度？\n问题44 如何使用copy（）函数对文件进行复制？\n问题45 如何在浏览器中直接输出图像？（fgetc（）函数）\n问题46 如何关闭危险函数？\n问题47 如何将数组中的元素合成字符串？\n问题48 如何解决使用empty检查函数返回结果时报错？\n问题49 如何使用mb substr函数截取中文字符串？\n问题50 如何解决PHP无法执行system函数的问题？\n问题51 如何对查询关键字进行描红？\n问题52 如何对字符串与HTML进行转换？\n问题53 如何屏蔽违禁词语？\n问题54 如何对字符串进行分割及连接？\n问题55 如何将lP地址转换成对应的数字？\n问题56 如何创建新型字符串？\n问题57 如何对字符串进行加密解密？\n问题58 如何比较字符串的大小？\n问题59 如何获取上传文件的扩展名？\n问题60 如何控制页面中输出字符串的长度？\n问题61 如何定义上传文件的名称？\n问题62 如何通过字符串截取控制图像验证码的输出？\n问题63 如何打乱字符串中字符的顺序？\n问题64 如何对字符串进行大小写转换？\n问题65 函数strstr（）、stristr（）、strpos（）、strrchr（）的区别是什么？\n问题66 if和switch语句有何区别？\n问题67 如何防止页面出现中文乱码？\n第3章 Web技术\n问题68 如何打印指定框架中的内容？\n问题69 如何使用框架嵌套技术居中显示框架页？\n问题70 如何为文本框设置只读属性？\n问题71 如何实现自动计算金额？\n问题72 如何实现复选框中的全选、反选和不选？\n问题73 如何对上传的图片进行预览？\n问题74 如何制作在页面右下角弹出渐显的广告窗口？\n问题75 判断表单动作的技巧有哪些？\n问题76 如何使用JS脚本获取、输出标签内容？\n问题77 如何控制客户端COOKIE？\n问题78 COOKIE应用的注意事项有哪些？\n问题79 SESSION和COOKIE的区别有哪些？\n问题80 如何使用SESSION？\n问题81 如何结束所有SESSION？\n问题82 如何阻止浏览器缓存页面？\n问题83 如何控制页面背景的打印？\n问题84 如何实现文字滑动效果？\n问题85 如何实现自动登录？\n问题86 如何统计用户在线时间？\n问题87 如何限制用户访问网站的时间？\n……\n第4章 数据库操作\n第5章 日期和时间处理\n第6章 图形图像处理\n第7章 文件与目录操作\n第8章 面向对象的程序设计\n第9章 数据库抽象层\n第10章 Ajax技术\n第11章 XML技术\n第12章 PDF技术\n第13章 PHP与多媒体技术\n第14章 Smarty模板\n第15章 ThinkPHP框架\n第16章 PHP项目开发技巧",
      pages: "499",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s8938095.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s8938095.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s8938095.jpg"
      },
      alt: "https://book.douban.com/subject/10519266/",
      id: "10519266",
      publisher: "",
      isbn10: "7302272042",
      isbn13: "9787302272045",
      title: "PHP必须知道的300个问题",
      url: "https://api.douban.com/v2/book/10519266",
      alt_title: "",
      author_intro: "",
      summary:
        "《PHP学习路线图•PHP必须知道的300个问题》以PHP基础知识结构为框架，讲解各部分知识所对应的常见开发疑难问题，并进行透彻地解析。内容包括PHP开发规范与入门要点、PHP基础、Web技术、数据库操作、日期和时间处理、图形图像处理、文件与目录操作、面向对象的程序设计、数据库抽象层、Ajax技术、XML技术、PDF技术、PHP与多媒体技术、Smarty模板、ThinkPHP框架和PHP项目开发技巧。\n《PHP学习路线图•PHP必须知道的300个问题》所涉及的疑难问题都是一线开发人员在实际项目中经常遇到的，针对这些问题给出了解决方案，并进行了技术上的解析。读者通过对《PHP学习路线图•PHP必须知道的300个问题》的学习，能够提高实际解决问题的能力。\n《PHP学习路线图•PHP必须知道的300个问题》提供了源程序、素材，提供了相关的模块库、案例库、素材库、题库等多种形式的辅助学习资料，还提供迅速及时的微博、QQ、论坛等技术支持。\n《PHP学习路线图•PHP必须知道的300个问题》内容详尽，实例丰富，非常适合作为零基础学习人员的学习用书和大中专院校师生的学习教材，也适合作为相关培训机构的师生和软件开发人员的参考资料。",
      series: {
        id: "15816",
        title: "PHP学习路线图"
      },
      price: "59.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle:
        "Practical PHP Mashups with Google Maps, Flickr, Amazon, YouTube, MSN Search, Yahoo!: Create practical mashups in PHP ... MSN Search, Yahoo!, Last.fm, and 411Sync.com",
      author: ["Shu-Wai Chow"],
      pubdate: "2007-9-13",
      tags: [
        {
          count: 1,
          name: "php",
          title: "php"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s26966638.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "304",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s26966638.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s26966638.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s26966638.jpg"
      },
      alt: "https://book.douban.com/subject/3426273/",
      id: "3426273",
      publisher: "Packt Publishing",
      isbn10: "184719088X",
      isbn13: "9781847190888",
      title: "PHP Web 2.0 Mashup Projects",
      url: "https://api.douban.com/v2/book/3426273",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 35,
        average: "7.5",
        min: 0
      },
      subtitle: "",
      author: [
        "Lee Babin",
        "Nathan A. Good",
        "Frank A. Kromann",
        "Joe Stephens"
      ],
      pubdate: "2008-05-01",
      tags: [
        {
          count: 35,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 5,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 5,
          name: "programming",
          title: "programming"
        },
        {
          count: 3,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 3,
          name: "PHP和MySQL",
          title: "PHP和MySQL"
        },
        {
          count: 3,
          name: "LAMP",
          title: "LAMP"
        },
        {
          count: 2,
          name: "PHP5",
          title: "PHP5"
        },
        {
          count: 2,
          name: "PHP+SQL",
          title: "PHP+SQL"
        }
      ],
      origin_title: "PHP 5 Recipes: A Problem-Solution Approach",
      image: "https://img1.doubanio.com/view/subject/m/public/s3173308.jpg",
      binding: "平装",
      translator: ["林琪", "荆涛"],
      catalog:
        "第1章  PHP数据类型与概念概述  1-1  变量  1-2  数值  1-3  数组  1-4  字符串  1-5  正则表达式  1-6  函数  1-7  项目：查找值的数据类型  1-8  项目：发现可用的变量、常量、函数、类和接口  1-9  获得当前脚本的信息  小结  下章预览第2章  类、对象和接口概述  基本概念  2-1  使用构造函数创建实例  2-2  使用默认构造函数  2-3  设置对象属性  2-4  控制对类成员的访问  2-5  使用静态成员和self关键字  2-6  使用类常量  2-7  扩展类  2-8  使用抽象类和方法  2-9  使用接口  2-10  使用类析构函数  2-11  使用异常  获得类和对象的信息  使用类和对象函数  2-12  使用class_exists()和interface_exists()检查类和接口是否存在  2-13  使用get_class_methods()列出方法和接口  2-14  获得变量名  2-15  确定对象是否是某个类的实例  2-16  列出当前加载的接口和类  使用类反射API  2-17  获得反射API的转储信息  2-18  完成动态类实例化  2-19  使用反射API分解Shape类  小结  下章预览第3章  数学运算  3-1  数值数据类型  3-2  随机数  3-3  对数和指数  3-4  三角函数  3-5  格式化数值数据  3-6  数学库  3-7  静态Math类  小结  下章预览第4章  数组处理第5章  日期和时间处理第6章  字符串处理第7章  文件与目录处理第8章  动态图像处理第9章  使用正则表达式第10章  变量处理第11章  使用函数第12章  Web基础第13章  创建和使用表单第14章  标记处理第15章  PHP 5中使用MySQL数据库第16章  与Internet服务通信索引",
      pages: "567",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s3173308.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s3173308.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s3173308.jpg"
      },
      alt: "https://book.douban.com/subject/3061676/",
      id: "3061676",
      publisher: "人民邮电出版社",
      isbn10: "711517539X",
      isbn13: "9787115175397",
      title: "PHP 5范例代码查询辞典",
      url: "https://api.douban.com/v2/book/3061676",
      alt_title: "PHP 5 Recipes: A Problem-Solution Approach",
      author_intro:
        "Lee Babin加拿大Code Shoppe公司的首席程序员，拥有丰富的Web开发经验。他是业界知名的PHP专家，除本书外，他著有(Ajax与PHP基础教程》一书(中文版已由人民邮电出版社出版)。\n    Nathan A.Good业界知名的PHP专家，有丰富的软件开发、系统管理和技术写作经验。除本书外，他还著有Regular Expression Recipes：A Problem．Solution Approach等多部畅销技术图书，并在PHP Magazine、IBM developerWorks等著名技术媒体上发表了大量文章。\n    Frank M.Kromann  intelleFLEET的高级软件工程师，主要负责软件的设计、开发和硬件集成。他为PHP开发了许多扩展，并参与了Windows版本的PHP-GTK的开发。",
      summary:
        "《PHP 5范例代码查询辞典》几乎在PHP5的所有重要方面都提供了有用的参考，不仅包括先前版本中已经非常成熟的原有特性，而且还包括PHP5中引入的新特性。比如，基本的PHP语法(数据类型、类、对象、接口、数组、数学运算)、日期和时间处理、字符串处理、文件与目录处理、动态图像处理、正则表达式、变量处理、标记处理、MySQLi数据库扩展、Web基础，等等。书中有大量的实例解决方案，包含大量实用的代码片段，你可以直接复制它们，然后粘贴到自己的应用程序中，从而大大节约编码时间。",
      series: {
        id: "660",
        title: "图灵程序设计丛书"
      },
      price: "79.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 4,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP5+MySQL网站开发实例精讲",
      author: ["黄炳强"],
      pubdate: "2007-07-01",
      tags: [
        {
          count: 5,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "海蚌",
          title: "海蚌"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s10130583.jpg",
      binding: "平装",
      translator: [],
      catalog: "",
      pages: "470",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s10130583.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s10130583.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s10130583.jpg"
      },
      alt: "https://book.douban.com/subject/2128359/",
      id: "2128359",
      publisher: "人民邮电出版社",
      isbn10: "7115161038",
      isbn13: "9787115161031",
      title: "PHP5+MySQL网站开发实例精讲",
      url: "https://api.douban.com/v2/book/2128359",
      alt_title: "",
      author_intro: "",
      summary: "PHP5+MySQL网站开发实例精讲，ISBN：9787115161031，作者：黄炳强",
      price: "49.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 28,
        average: "8.5",
        min: 0
      },
      subtitle: "",
      author: ["(美)厄尔曼"],
      pubdate: "2008-11-1",
      tags: [
        {
          count: 39,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 17,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 10,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 6,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 5,
          name: "编程",
          title: "编程"
        },
        {
          count: 4,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 4,
          name: "教材",
          title: "教材"
        },
        {
          count: 4,
          name: "msyql5",
          title: "msyql5"
        }
      ],
      origin_title: "PHP 6 and MySQL 5 for Dynamic Web Sites",
      image: "https://img1.doubanio.com/view/subject/m/public/s3408029.jpg",
      binding: "",
      translator: ["陈宗斌 等"],
      catalog: "",
      pages: "494",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s3408029.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s3408029.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s3408029.jpg"
      },
      alt: "https://book.douban.com/subject/3269865/",
      id: "3269865",
      publisher: "人民邮电出版社",
      isbn10: "7115188548",
      isbn13: "9787115188540",
      title: "PHP 6与MySQL 5基础教程",
      url: "https://api.douban.com/v2/book/3269865",
      alt_title: "PHP 6 and MySQL 5 for Dynamic Web Sites",
      author_intro:
        "Larry Ullman是国际知名的技术作家，拥有20多年的编程经验，精通多种语言和技术。他是DMC Insights公司的总裁，曾担任朗讯和Oracle等世界顶尖公司的倾向，并曾授课于加州大学伯克利分校、宾州大学等名校。除本书外，他撰写的多部图书都广受世界读者的欢迎，享有极高的声誉。",
      summary:
        "本书是一部经典的入门级著作，采用基于任务的方法来讲授PHP和MySQL，使用大量图片指导读者深入学习语言，并向读者展示了如何构造动态Web站点。书中用简洁、直观的步骤和讲解提供了学习任务和概念的最快方式。通过学习本书，读者可以快速、高效地掌握PHP和MySQL，成为一位构建Web站点的高手。\n本书适合初中级Web应用开发和设计人员阅读。\n本书是讲述PHP和MySQL技术的畅销书，以深入浅出、图文并茂而广受赞誉。书中通过大量来自实战的例子、屏幕图和详细的解释，循序渐进地介绍了开发人员最需要的知识点。\n由于采用任务导向的方式组织，本书同时也是一本很好的参考书。读者可以在遇到各种常见任务时。查询书中的内容．直接应用到实际工作中去。\n作者专门为本书开设了一个Web站点www.DMCinsights.com／phpmysq13／，其中包含书中的脚本、文本文件以及勘误表，另外还设有一个非常受欢迎的论坛。\n本书历经多个版本，深受读者喜爱。新版中，作者根据PHP 6和MySQL 5的最新特性对全书进行了全面修订。增加了phpMyAdmin、安全、Perl兼容正则表达式、Unicode等内容，使这部经典之作继续与时俱进。",
      price: "65.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 33,
        average: "7.4",
        min: 0
      },
      subtitle: "",
      author: ["Larry Ullman"],
      pubdate: "2011-10-01",
      tags: [
        {
          count: 38,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 16,
          name: "编程",
          title: "编程"
        },
        {
          count: 8,
          name: "编程基础-编程语言-PHP",
          title: "编程基础-编程语言-PHP"
        },
        {
          count: 5,
          name: "入门",
          title: "入门"
        },
        {
          count: 4,
          name: "网站",
          title: "网站"
        },
        {
          count: 4,
          name: "'编程基础-编程语言-PHP",
          title: "'编程基础-编程语言-PHP"
        },
        {
          count: 3,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 2,
          name: "动态",
          title: "动态"
        }
      ],
      origin_title: "PHP for the Web: Visual QuickStart Guide",
      image: "https://img3.doubanio.com/view/subject/m/public/s7642663.jpg",
      binding: "平装",
      translator: ["贾菡", "刘彦博"],
      catalog:
        "第1 章  PHP 概述　　 1\n1.1  HTML 语法基础　　 1\n1.2  PHP 语法基础　　6\n1.3  使用FTP 　 8\n1.4  测试脚本　　 9\n1.5  向浏览器发送文本　　 12\n1.6  使用PHP 手册　　14\n1.7  向浏览器发送HTML 　　16\n1.8  为脚本添加注释　　19\n1.9  调试的基本步骤　　21\n1.10  回顾和实践　　 22\n第2 章  变量　　 24\n2.1  什么是变量　　 24\n2.2  变量语法　　 27\n2.3  变量类型　　 29\n2.4  为变量赋值　　 32\n2.5  理解引号　　 34\n2.6  回顾和实践　　 37\n第3 章  HTML 表单和PHP 　　 38\n3.1  创建简单的表单　　 38\n3.2  选择表单的method　　 42\n3.3  使用PHP 接收表单数据　　 44\n3.4  显示错误　　 48\n3.5  错误报告　　 51\n3.6  向页面手动发送数据　　 53\n3.7  回顾和实践　　 58\n第4 章  使用数值　　 60\n4.1  创建表单　　 60\n4.2  算术运算　　 63\n4.3  格式化数值　　 67\n4.4  理解优先级　　 70\n4.5  数值的自增和自减　　 72\n4.6  创建随机数　　 75\n4.7  回顾和实践　　 77\n第5 章  使用字符串　　 78\n5.1  创建HTML 表单　　 78\n5.2  连接字符串　　 81\n5.3  处理换行符　　 84\n5.4  HTML 和PHP　　 85\n5.5  字符串的编码和解码　　89\n5.6  查找子字符串　　 92\n5.7  替换局部字符串　　 96\n5.8  回顾和实践　　 99\n第6 章  控制结构　　100\n6.1  创建HTML 表单　　 100\n6.2  if 条件语句　　 104\n6.3  验证函数　　 106\n6.4  使用else 　　110\n6.5  更多运算符　　112\n6.6  使用elseif　　 121\n6.7  switch 条件语句　　 125\n6.8  for 循环　　 130\n6.9  回顾和实践　　135\n第7 章  使用数组　　136\n7.1  什么是数组　　136\n7.2  创建数组　　138\n7.3  向数组添加项　　 141\n7.4  访问数组元素　　 144\n7.5  创建多维数组　　 148\n7.6  数组排序　　 152\n7.7  字符串和数组之间的转换　　156\n7.8  在表单中创建数组　　160\n7.9  回顾和实践　　165\n第8 章  创建Web 应用程序　　166\n8.1  创建模板　　 166\n8.2  使用外部文件　　 175\n8.3  使用常量　　180\n8.4  使用日期和时间　　 184\n8.5  再谈使用PHP 处理HTML 表单　　 188\n8.6  使表单更具粘性　　 194\n8.7  发送Email　　 201\n8.8  输出缓冲　　205\n8.9  处理HTTP 头　　 209\n8.10  回顾和实践　　 213\n第9 章  cookie 和session 　　214\n9.1  什么是cookie　　 214\n9.2  创建cookie　　 217\n9.3  读取cookie　　 223\n9.4  向cookie 添加参数　　 227\n9.5  删除cookie　　 230\n9.6  什么是session　　 233\n9.7  创建session　　234\n9.8  访问session 变量　　 237\n9.9  删除session　　239\n9.10  回顾和实践　　241\n第10 章  创建函数　　243\n10.1  创建和使用简单函数　　243\n10.2  创建和调用接受参数的函数　　248\n10.3  设置参数默认值　　 253\n10.4  创建和使用带有返回值的函数　　 255\n10.5  理解变量作用域　　 259\n10.6  回顾和实践　　 264\n第11 章  文件和目录　　265\n11.1  文件权限　　265\n11.2  写入文件　　270\n11.3  锁定文件　　276\n11.4  读取文件　　278\n11.5  处理文件上传　　 281\n11.6  导航目录　　288\n11.7  创建目录　　293\n11.8  增量读取文件　　298\n11.9  回顾和实践　　 303\n第12 章  数据库介绍　　305\n12.1  SQL 介绍　　 305\n12.2  连接MySQL 　307\n12.3  MySQL 错误处理　　311\n12.4  创建和选择数据库　　313\n12.5  创建表　　316\n12.6  向数据库插入数据　　320\n12.7  安全查询数据　　325\n12.8  从数据库中检索数据　　 328\n12.9  删除数据库中的数据　　 333\n12.10  更新数据库中的数据　　 338\n12.11  回顾和实践　　 343\n第13 章  将所有的组合在一起　　344\n13.1  准备开始　　 344\n13.2  连接数据库　　 346\n13.3  编写用户定义函数　　 347\n13.4  创建模板　　349\n13.5  登录　　 352\n13.6  登出　　 355\n13.7  添加名人名言　　 357\n13.8  列示名人名言　　 361\n13.9  编辑名人名言　　 364\n13.10  删除名人名言　　 370\n13.11  创建主页　　 374\n13.12  回顾和实践　　378\n附录A  安装和配置　　379\n附录B  深入学习PHP 的资源　　397",
      pages: "405",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s7642663.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s7642663.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s7642663.jpg"
      },
      alt: "https://book.douban.com/subject/6823545/",
      id: "6823545",
      publisher: "人民邮电出版社",
      isbn10: "7115260931",
      isbn13: "9787115260932",
      title: "PHP基础教程（第4版）",
      url: "https://api.douban.com/v2/book/6823545",
      alt_title: "PHP for the Web: Visual QuickStart Guide",
      author_intro:
        "Brian Halligan  市场营销软件开发公司HubSpot创始人兼CEO，致力于帮助其他企业“被目标客户找到”。他也是一位眼光超前的风险投资家、经验丰富的销售及营销主管，常应邀去MIT以及哈佛商学院举办讲座。\nDharmesh Shah  HubSpot公司创始人兼CTO，天使投资人，撰写的博客OnStartups.com拥有大量粉丝。他还屡次应邀就市场营销以及企业家精神这类主题发表演说。\n侯德杰  北京邮电大学英语专业，后取得北京交通大学项目管理硕士学位。目前就职于北京全路通信信号研究设计院，全职翻译和审核文档，曾翻译出版《网络营销实训》，对网络营销有较深入的研究。",
      summary:
        "由贾菡等编译的《PHP基础教程(第4版)》以通俗易懂的语言向初学者介绍了PHP语言的基本概念、使用方法和注意事项。全书通过丰富的示例，引领读者逐步掌握这门流行的Web开发语言，使读者能够上手编写适用于常用场景的PHP脚本。\n    《PHP基础教程(第4版)》适合有基本HTML经验的读者阅读。",
      price: "65.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle:
        "A practical tutorial for creating your first Drupal 6 modules with PHP",
      author: ["Matt Butcher"],
      pubdate: "2008-5-8",
      tags: [
        {
          count: 4,
          name: "drupal",
          title: "drupal"
        },
        {
          count: 2,
          name: "develop",
          title: "develop"
        },
        {
          count: 2,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 1,
          name: "tangrui9105的计算机科学",
          title: "tangrui9105的计算机科学"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4687402.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "328",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4687402.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4687402.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4687402.jpg"
      },
      alt: "https://book.douban.com/subject/3082033/",
      id: "3082033",
      publisher: "Packt Publishing",
      isbn10: "1847194443",
      isbn13: "9781847194442",
      title: "Learning Drupal 6 Module Development",
      url: "https://api.douban.com/v2/book/3082033",
      alt_title: "",
      author_intro: "",
      summary:
        "A practical tutorial for creating your first Drupal 6 modules with PHP\nSpecifically written for Drupal 6 development\nProgram your own Drupal modules\nNo experience of Drupal development required\nKnow Drupal 5? Learn what's new in Drupal 6\nIntegrate AJAX functionality with the jQuery library",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP项目案例分析",
      author: [],
      pubdate: "2012-01-01",
      tags: [
        {
          count: 1,
          name: "的",
          title: "的"
        },
        {
          count: 1,
          name: "php项目",
          title: "php项目"
        },
        {
          count: 1,
          name: "11111111111",
          title: "11111111111"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s8938085.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "445",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s8938085.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s8938085.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s8938085.jpg"
      },
      alt: "https://book.douban.com/subject/10519257/",
      id: "10519257",
      publisher: "",
      isbn10: "7302272034",
      isbn13: "9787302272038",
      title: "PHP项目案例分析",
      url: "https://api.douban.com/v2/book/10519257",
      alt_title: "",
      author_intro: "",
      summary:
        "《PHP学习路线图•PHP项目案例分析》系统完整地介绍了6个实用项目和2个毕业设计，实用项目包括图书信息管理系统、俊羽会议管理系统、梦幻网络日记、企业网站系统、明日网上书店和问鼎办公自动化系统的设计；毕业设计包括图书馆管理系统和电子商务网站的设计。\n《PHP学习路线图•PHP项目案例分析》从web项目开发的角度出发，按照项目的开发顺序，系统、全面地介绍了php项目开发的流程。从项目概述、数据库设计、公共类设计到主要模块设计，每一过程都进行了详细的介绍。\n《PHP学习路线图•PHP项目案例分析》提供了大量的自学视频、源程序、素材，提供了相关的模块库、案例库、素材库、题库等多种形式的辅助学习资料，还提供迅速及时的微博、qq、论坛等技术支持。\n《PHP学习路线图•PHP项目案例分析》内容详尽，实例丰富，非常适合作为零基础学习人员的学习用书和大中专院校、相关培训机构师生的学习教材，也适合作为软件开发人员的参考资料。",
      series: {
        id: "15816",
        title: "PHP学习路线图"
      },
      price: "49.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 63,
        average: "7.1",
        min: 0
      },
      subtitle: "中文版",
      author: [],
      pubdate: "2007-06-01",
      tags: [
        {
          count: 48,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 35,
          name: "mysql",
          title: "mysql"
        },
        {
          count: 20,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 11,
          name: "编程",
          title: "编程"
        },
        {
          count: 9,
          name: "入门",
          title: "入门"
        },
        {
          count: 6,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 6,
          name: "web",
          title: "web"
        },
        {
          count: 6,
          name: "programming",
          title: "programming"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s10423499.jpg",
      binding: "",
      translator: ["车立红"],
      catalog: "",
      pages: "355",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s10423499.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s10423499.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s10423499.jpg"
      },
      alt: "https://book.douban.com/subject/2128062/",
      id: "2128062",
      publisher: "中国电力出版社",
      isbn10: "7508353803",
      isbn13: "9787508353807",
      title: "Learning PHP & MySQL中文版",
      url: "https://api.douban.com/v2/book/2128062",
      alt_title: "",
      author_intro: "",
      summary:
        "《Learning PHP & MySQL中文版》将介绍程序、模板和数据库的工作原理，讲述如何应对其中的挑战，并彻底地探索这些技术。",
      price: "36.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 31,
        average: "7.1",
        min: 0
      },
      subtitle: "",
      author: ["Hugb E. Williams", "David Lane"],
      pubdate: "2003-05-01",
      tags: [
        {
          count: 23,
          name: "php",
          title: "php"
        },
        {
          count: 12,
          name: "mysql",
          title: "mysql"
        },
        {
          count: 5,
          name: "O'Reilly",
          title: "O'Reilly"
        },
        {
          count: 4,
          name: "programming",
          title: "programming"
        },
        {
          count: 3,
          name: "web",
          title: "web"
        },
        {
          count: 2,
          name: "网络编程",
          title: "网络编程"
        },
        {
          count: 2,
          name: "oreilly",
          title: "oreilly"
        },
        {
          count: 2,
          name: "book",
          title: "book"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s10001678.jpg",
      binding: "平装",
      translator: ["谢君英"],
      catalog:
        "前言\n第一章 数据库应用程序与Web\n第二章 PHP\n第三章 MySQL和SQL\n第四章 查询Web数据库\n第五章 用户驱动的查询\n第六章 向Web数据库写数据\n第七章 服务器端和客户端验证\n第八章 会话\n第九章 认证与安全\n第十章 winestore顾客管理\n第十一章 winestore购物车\n第十二章 winestore上的订货和发货\n第十三章 相关主题\n附录一 安装指南\n……\n词汇表\n",
      pages: "616",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s10001678.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s10001678.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s10001678.jpg"
      },
      alt: "https://book.douban.com/subject/1265680/",
      id: "1265680",
      publisher: "中国电力出版社",
      isbn10: "750831316X",
      isbn13: "9787508313160",
      title: "PHP&MySQL Web数据库应用开发指南",
      url: "https://api.douban.com/v2/book/1265680",
      alt_title: "",
      author_intro: "",
      summary: "\n      ",
      price: "69.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle:
        "Expert insight and practical guidance to creating an efficient, flexible, and robust framework for a PHP 5-based content management system",
      author: ["Martin Brampton"],
      pubdate: "2008-6-6",
      tags: [
        {
          count: 1,
          name: "PHP",
          title: "PHP"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s28917140.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "348",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s28917140.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s28917140.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s28917140.jpg"
      },
      alt: "https://book.douban.com/subject/3227925/",
      id: "3227925",
      publisher: "Packt Publishing",
      isbn10: "1847193579",
      isbn13: "9781847193575",
      title: "PHP 5 CMS Framework Development",
      url: "https://api.douban.com/v2/book/3227925",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 49.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 3,
        average: "0.0",
        min: 0
      },
      subtitle: "A Framework for Building Modern PHP Apps",
      author: ["Matt Stauffer"],
      pubdate: "2016-8-25",
      tags: [
        {
          count: 7,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 5,
          name: "laravel",
          title: "laravel"
        },
        {
          count: 2,
          name: "php",
          title: "php"
        },
        {
          count: 2,
          name: "Laravel",
          title: "Laravel"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "2018-laravel",
          title: "2018-laravel"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s28750271.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "250",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s28750271.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s28750271.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s28750271.jpg"
      },
      alt: "https://book.douban.com/subject/26801718/",
      id: "26801718",
      publisher: "O'Reilly Media",
      isbn10: "1491936088",
      isbn13: "9781491936085",
      title: "Laravel: Up and Running",
      url: "https://api.douban.com/v2/book/26801718",
      alt_title: "",
      author_intro:
        "Matt Stauffer is a developer and a teacher. He is a partner and technical director at Tighten Co., blogs at mattstauffer.co, and hosts The Five-Minute Geek Show and the Laravel Podcast.",
      summary:
        "This practical book teaches Laravel piece by piece, starting from the ground up. It’s not a reference book; you'll work through creating usable, real-world tools and applications as a way to learn all of the pieces of the framework. The purpose of this book is to teach beginners the foundations necessary to quickly become proficient with Laravel.\nThis book is ideal for developers with experience in PHP or other C-family programming languages—especially those who don’t have the time or resources to sift through the multitude of training resources available online. This is your single resource to Laravel when you want to get up and running right away.",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 23,
        average: "7.6",
        min: 0
      },
      subtitle: "",
      author: ["Jesus Castagnetto"],
      pubdate: "2001-03-01",
      tags: [
        {
          count: 24,
          name: "php",
          title: "php"
        },
        {
          count: 11,
          name: "编程",
          title: "编程"
        },
        {
          count: 5,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 4,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 4,
          name: "web",
          title: "web"
        },
        {
          count: 2,
          name: "长大后..我就撒比西了",
          title: "长大后..我就撒比西了"
        },
        {
          count: 2,
          name: "series:Professional",
          title: "series:Professional"
        },
        {
          count: 1,
          name: "，计算机",
          title: "，计算机"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s1480684.jpg",
      binding: "",
      translator: [],
      catalog: "译者序作者介绍前言第1\n",
      pages: "",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s1480684.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s1480684.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s1480684.jpg"
      },
      alt: "https://book.douban.com/subject/1230410/",
      id: "1230410",
      publisher: "机械工业出版社",
      isbn10: "711108618X",
      isbn13: "9787111086185",
      title: "PHP高级编程",
      url: "https://api.douban.com/v2/book/1230410",
      alt_title: "",
      author_intro: "",
      summary: "本书介绍PHP的基本知识与高级特",
      price: "78.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 22,
        average: "8.1",
        min: 0
      },
      subtitle: "",
      author: ["Larry Ullman"],
      pubdate: "2013-01-01",
      tags: [
        {
          count: 21,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 16,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 12,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 6,
          name: "网站",
          title: "网站"
        },
        {
          count: 5,
          name: "网站开发",
          title: "网站开发"
        },
        {
          count: 3,
          name: "编程",
          title: "编程"
        },
        {
          count: 3,
          name: "数据库",
          title: "数据库"
        },
        {
          count: 3,
          name: "入门",
          title: "入门"
        }
      ],
      origin_title: "PHP and MySQL for Dynamic Web Sites:Visual QuickPro Guide",
      image: "https://img3.doubanio.com/view/subject/m/public/s25115465.jpg",
      binding: "平装",
      translator: ["杜凯", "陈宗斌"],
      catalog:
        "第1章 　PHP概述\n1.1 　基本语法\n1.2 　发送数据到Web浏览器\n1.3 　编写注释\n1.4 　什么是变量\n1.5 　介绍字符串\n1.6 　连接字符串\n1.7 　数字介绍\n1.8 　常量介绍\n1.9 　单引号与双引号\n1.10 　基本的调试步骤\n1.11 　回顾和实践\n1.11.1 　回顾\n1.11.2 　实践\n第2章 　PHP编程\n2.1 　创建HTML表单\n2.2 　处理HTML表单\n2.3 　条件语句和运算符\n2.4 　验证表单数据\n2.5 　介绍数组\n2.5.1 　创建数组\n2.5.2 　访问数组\n2.5.3 　多维数组\n2.5.4 　数组排序\n2.6 　for和while循环\n2.7 　回顾和实践\n2.7.1 　回顾\n2.7.2 　实践\n第3章 　创建动态Web站点\n3.1 　包含多个文件\n3.2 　再论处理HTML表单\n3.3 　建立黏性表单\n3.4 　创建自己的函数\n3.4.1 　创建带参数的函数\n3.4.2 　设置默认的参数值\n3.4.3 　从函数返回值\n3.7 　回顾和实践\n3.7.1 　回顾\n3.7.2 　实践\n第4章 　MySQL简介\n4.1 　命名数据库元素\n4.2 　选择列类型\n4.3 　选择其他的列属性\n4.4 　访问MySQL\n4.4.1 　使用MySQL客户端\n4.4.2 　使用phpMyAdmin\n4.5 　回顾和实践\n4.5.1 　回顾\n4.5.2 　实践\n第5章 　SQL简介\n5.1 　创建数据库和表\n5.2 　插入记录\n5.3 　选择数据\n5.4 　使用条件语句\n5.5 　使用LIKE和NOT LIKE\n5.6 　排序查询结果\n5.7 　限制查询结果\n5.8 　更新数据\n5.9 　删除数据\n5.10 　使用函数\n5.10.1 　文本函数\n5.10.2 　数字函数\n5.10.3 　日期和时间函数\n5.10.4 　格式化日期和时间\n5.11 　回顾和实践\n5.11.1 　回顾\n5.11.2 　实践\n第6章 　数据库设计\n6.1 　规范化\n6.1.1 　键\n6.1.2 　关系\n6.1.3 　第一范式\n6.1.4 　第二范式\n6.1.5 　第三范式\n6.1.6 　审查设计\n6.2 　创建索引\n6.3 　使用不同的表类型\n6.4 　语言和MySQL\n6.5 　时区和MySQL\n6.6 　外键约束\n6.7 　回顾和实践\n6.7.1 　回顾\n6.7.2 　实践\n第7章 　高级SQL和MySQL\n7.1 　执行联结\n7.1.1 　内联结\n7.1.2 　外联结\n7.1.3 　联结三个或更多表\n7.2 　分组选定的结果\n7.3 　高级选择\n7.4 　执行FULLTEXT查找\n7.4.1 　创建FULLTEXT索引\n7.4.2 　执行基本的FULLTEXT查找\n7.4.3 　执行布尔型FULLTEXT查找\n7.5 　查询优化\n7.6 　执行事务\n7.7 　数据库加密\n7.8 　回顾和实践\n7.8.1 　回顾\n7.8.2 　实践\n第8章 　错误处理和调试\n8.1 　错误类型与基本调试方法\n8.1.1 　基本调试步骤\n8.1.2 　调试HTML\n8.2 　显示PHP错误\n8.3 　调整PHP中的错误报告\n8.4 　创建自定义的错误处理程序\n8.5 　PHP调试技术\n8.6 　SQL和MySQL调试技术\n8.6.1 　调试SQL问题\n8.6.2 　调试访问问题\n8.7 　回顾和实践\n8.7.1 　回顾\n8.7.2 　实践\n第9章 　使用PHP和MySQL\n9.1 　修改模板\n9.2 　连接到MySQL\n9.3 　执行简单的查询\n9.4 　检索查询结果\n9.5 　确保SQL安全\n9.6 　统计返回的记录\n9.7 　利用PHP更新记录\n9.8 　回顾和实践\n9.8.1 　回顾\n9.8.2 　实践\n第10章 　常用编程技术\n10.1 　给脚本发送值\n10.2 　使用隐藏的表单输入框\n10.3 　编辑现有的记录\n10.4 　给查询结果标页码\n10.5 　建立可排序的显示结果\n10.6 　回顾和实践\n10.6.1 　回顾\n10.6.2 　实践\n第11章 　Web应用程序开发\n11.1 　发送电子邮件\n11.2 　处理文件上传\n11.2.1 　允许文件上传\n11.2.2 　利用PHP上传文件\n11.3 　PHP和JavaScript\n11.3.1 　创建JavaScript文件\n11.3.2 　创建PHP脚本\n11.4 　理解HTTP头部\n11.5 　日期和时间函数\n11.6 　回顾和实践\n11.6.1 　回顾\n11.6.2 　实践\n第12章 　cookie和会话\n12.1 　建立登录页面\n12.2 　创建登录函数\n12.3 　使用cookie\n12.3.1 　设置cookie\n12.3.2 　访问cookie\n12.3.3 　设置cookie参数\n12.3.4 　删除cookie\n12.4 　使用会话\n12.4.1 　设置会话变量\n12.4.2 　访问会话变量\n12.4.3 　删除会话变量\n12.5 　提高会话安全性\n12.6 　回顾和实践\n12.6.1 　回顾\n12.6.2 　实践\n第13章 　安全性方法\n13.1 　阻止垃圾邮件\n13.2 　通过类型验证数据\n13.3 　按类型验证文件\n13.4 　阻止XSS攻击\n13.5 　使用过滤器扩展\n13.6 　预防SQL注入攻击\n13.7 　回顾和实践\n13.7.1 　回顾\n13.7.2 　实践\n第14章 　Perl兼容的正则表达式\n14.1 　创建测试脚本\n14.2 　定义简单的模式\n14.3 　使用量词\n14.4 　使用字符类别\n14.5 　查找所有匹配\n14.6 　使用修饰符\n14.7 　匹配和替换模式\n14.8 　回顾和实践\n14.8.1 　回顾\n14.8.2 　实践\n第15章 　jQuery简介\n15.1 　jQuery是什么\n15.2 　包含jQuery\n15.3 　使用jQuery\n15.4 　选择页面元素\n15.5 　事件处理\n15.6 　DOM操作\n15.7 　使用Ajax\n15.7.1 　创建表单\n15.7.2 　创建服务器端脚本\n15.7.3 　处理Ajax请求\n15.7.4 　创建JavaScript\n15.8 　回顾和实践\n15.8.1 　回顾\n15.8.2 　实践\n第16章 　面向对象编程入门\n16.1 　基础知识和语法\n16.1.1 　面向对象的基础\n16.1.2 　PHP中的OOP语法\n16.2 　使用MySQL\n16.2.1 　创建连接\n16.2.2 　执行简单的查询\n16.2.3 　获取结果\n16.2.4 　预处理语句\n16.3 　DateTime类\n16.4 　回顾和实践\n16.4.1 　回顾\n16.4.2 　实践\n第17章 　示例--论坛\n17.1 　建立数据库\n17.2 　编写模板\n17.3 　创建索引页面\n17.4 　创建论坛页面\n17.5 　创建论点页面\n17.6 　发布消息\n17.6.1 　创建表单\n17.6.2 　处理表单\n17.7 　回顾和实践\n17.7.1 　回顾\n17.7.2 　实践\n第18章 　示例--用户注册\n18.1 　创建模板\n18.2 　编写配置脚本\n18.2.1 　建立配置文件\n18.2.2 　建立数据库脚本\n18.3 　创建主页\n18.4 　注册\n18.5 　激活账户\n18.6 　登录和注销\n18.7 　密码管理\n18.7.1 　重置密码\n18.7.2 　更改密码\n18.8 　回顾和实践\n18.8.1 　回顾\n18.8.2 　实践\n第19章 　示例--电子商务\n19.1 　创建数据库\n19.2 　管理端\n19.2.1 　添加艺术家\n19.2.2 　添加印刷品\n19.3 　创建公共模板\n19.4 　产品目录\n19.5 　购物车\n19.5.1 　添加项目\n19.5.2 　查看购物车\n19.6 　记录订单\n19.7 　回顾和实践\n19.7.1 　回顾\n19.7.2 　实践",
      pages: "638",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s25115465.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s25115465.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s25115465.jpg"
      },
      alt: "https://book.douban.com/subject/20445413/",
      id: "20445413",
      publisher: "人民邮电出版社",
      isbn10: "7115299404",
      isbn13: "9787115299406",
      title: "PHP与MySQL动态网站开发",
      url: "https://api.douban.com/v2/book/20445413",
      alt_title: "PHP and MySQL for Dynamic Web Sites:Visual QuickPro Guide",
      author_intro:
        "Larry Ullman，作家、Web和软件开发人员、培训师、教师、演说家和顾问。他已经著有20多本技术书籍。Larry最深受读者喜爱的一点在于，他往往可以将晦涩难懂的专业术语转换为大家耳熟能详的自然语言。",
      summary:
        "《PHP与MySQL动态网站开发(第4版)》(作者厄尔曼)采用基于任务的方法来讲授PHP和MySQL，使用大量图片指导读者深入学习语言，并向读者展示了如何构造Web站点。用简洁、直观的步骤和讲解提供了学习任务和概念的最快方式。通过《PHP与MySQL动态网站开发(第4版)》，读者可以快速、高效地学习PHP和MySQL，并可以立刻成为一位构建Web站点的高手！\n    《PHP与MySQL动态网站开发(第4版)》适用于Web应用开发人员，适合初、中层次读者。",
      price: "99.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle:
        "あなただけの「最強の一冊」の選び方・作り方 (PHPビジネス新書 42) (新書)",
      author: ["舘神 龍彦"],
      pubdate: "2007-01-01",
      tags: [],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s2753735.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s2753735.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s2753735.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s2753735.jpg"
      },
      alt: "https://book.douban.com/subject/2296113/",
      id: "2296113",
      publisher: "PHP研究所",
      isbn10: "4569694357",
      isbn13: "9784569694351",
      title: "手帳進化論",
      url: "https://api.douban.com/v2/book/2296113",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "104.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle: "Using PHP to Build Dynamic Web Sites (2nd Edition)",
      author: ["Leon Atkinson"],
      pubdate: "2000-08-03",
      tags: [
        {
          count: 6,
          name: "php",
          title: "php"
        },
        {
          count: 1,
          name: "core",
          title: "core"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s1656457.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s1656457.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s1656457.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s1656457.jpg"
      },
      alt: "https://book.douban.com/subject/1785147/",
      id: "1785147",
      publisher: "Pearson Education",
      isbn10: "0130893986",
      isbn13: "9780130893987",
      title: "Core PHP Programming",
      url: "https://api.douban.com/v2/book/1785147",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 44.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle: "Web Image Effects from the Command Line and PHP",
      author: ["Sohail Salehi"],
      pubdate: "2006-06-08",
      tags: [
        {
          count: 1,
          name: "tool",
          title: "tool"
        },
        {
          count: 1,
          name: "Visualization",
          title: "Visualization"
        },
        {
          count: 1,
          name: "IT",
          title: "IT"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s6894846.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "226",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6894846.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6894846.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6894846.jpg"
      },
      alt: "https://book.douban.com/subject/1859189/",
      id: "1859189",
      publisher: "Packt Publishing",
      isbn10: "1904811868",
      isbn13: "9781904811862",
      title: "ImageMagick Tricks",
      url: "https://api.douban.com/v2/book/1859189",
      alt_title: "",
      author_intro:
        'Sohail Salehi was born in Mashad, Iran, on March 18, 1975. He graduated in Software Engineering from Mashad University in 2000. In recent years, Sohail has contributed to over 20 books, mainly in programming and computer graphics. He has written frequent articles for "0 & 1 Magazine", an IT magazine from Ferdowsi University. You can find a complete list of his work at www.sohail2d.com. In the past he has worked as a Chairman in the IT department of various universities including Mashad, Ferdowsi, and the Industrial Management University. Currently he is working on the IT training standards for the Iranian "Work and Science Organisation" 2005-2006 period.',
      summary:
        "Unleash the power of ImageMagick with this fast, friendly guide. It's packed with examples of photo manipulations, logo creation, animations, and complete web projects. With this book up your sleeve, you'll be creating spellbinding images from code in no time.  ImageMagick is a free software suite to create, edit, and compose bitmap images using text-based commands. The commands can be issued from the command line, but more often will be included in web or desktop applications - carrying out complex image-manipulation tasks in response to the user's input. ImageMagick is a popular way for generating images on-the-fly in web pages, whether it's generating thumbnails from a large image, or creating complex combinations of images, text, and effects chosen by a visitor or the web site's creator.  Sohail Salehi is an experienced computer graphics artist, working with 2D, 3D, and video graphics. The book shows his techniques in action. This is no laborious walk through of ImageMagick, with one dull example after another. The chapters consist of workshops, each one applying a set of ImageMagick commands to produce surprising and exciting results.  As you read the book, you will learn the features of ImageMagick as well as getting lots of inspiration and ideas for how you can use it in your own projects. You'll be amazed by the creative results you can achieve using code.",
      price: "USD 34.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 39,
        average: "7.1",
        min: 0
      },
      subtitle: "",
      author: ["萨莱"],
      pubdate: "2010-06-01",
      tags: [
        {
          count: 45,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 35,
          name: "设计模式",
          title: "设计模式"
        },
        {
          count: 5,
          name: "面向对象",
          title: "面向对象"
        },
        {
          count: 4,
          name: "程序设计",
          title: "程序设计"
        },
        {
          count: 4,
          name: "php",
          title: "php"
        },
        {
          count: 3,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 2,
          name: "主题：设计模式",
          title: "主题：设计模式"
        },
        {
          count: 1,
          name: "美国",
          title: "美国"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s6180749.jpg",
      binding: "",
      translator: [],
      catalog:
        "第Ⅰ部分  初识设计模式与PHP第1章  理解设计模式  1.1  什么是设计模式    1.1.1  一个普通的示例    1.1.2  设计模式能够解决相同的问题    1.1.3  设计模式无所不在    1.1.4  设计模式的公共部分  1.2  设计模式未涵盖的内容    1.2.1  设计模式并非即插即用    1.2.2  设计模式是可维护的，但并非总是最有效的    1.2.3  设计模式是重构的必经之路，但不是最终目标  1.3  设计模式的相关论证  1.4  在PHP中使用设计模式的原因  1.5  本章小结第2章  使用现有的工具  2.1  已有架构中的模式    2.1.1  PEAR.中的设计模式    2.1.2  Zend Framework中的设计模式    2.1.3  Doctrine中的设计模式  2.2  PHP标准库    2.2.1  SPL Observer与SPL Subject    2.2.2  SPL迭代器  2.3  使用具有模式的Eclipse PDT  2.4  本章小结第Ⅱ部分  参考内容第3章  适配器模式  3.1  问题与解决方案  3.2  UML  3.3  代码示例第4章  建造者模式  4.1  问题与解决方案  4.2  UML  4.3  代码示例第5章  数据访问对象模式  5.1  问题与解决方案  5.2  UML  5.3  代码示例第6章  装饰器模式  6.1  问题与解决方案  6.2  UML  6.3  代码示例第7章  委托模式  7.1  问题与解决方案  7.2  UML  7.3  代码示例第8章  外观模式  8.1  问题与解决方案  8.2  UML  8.3  代码示例第9章  工厂模式  9.1  问题与解决方案  9.2  UML  9.3  代码示例第10章  解释器模式  10.1  问题与解决方案  10.2  UML  10.3  代码示例第11章  迭代器模式  11.1  问题与解决方案  11.2  UML  11.3  代码示例第12章  中介者模式  12.1  问题与解决方案  12.2  UML  12.3  代码示例第13章  观察者模式  13.1  问题与解决方案  13.2  UML  13.3  代码示例第14章  原型模式  14.1  问题与解决方案  14.2  UML  14.3  代码示例第15章  代理模式  15.1  问题与解决方案  15.2  UML  15.3  代码示例第16章  单元素模式  16.1  问题与解决方案  16.2  UML  16.3  代码示例第17章  策略模式  17.1  问题与解决方案  17.2  UML  17.3  代码示例第18章  模板模式  18.1  问题与解决方案  18.2  UML  18.3  代码示例第19章  访问者模式  19.1  问题与解决方案  19.2  UML  19.3  代码示例第Ⅲ第20章  需求分析  20.1  初始需求    20.1.1  执行纲要    20.1.2  作用域    20.1.3  假设邝艮制    20.1.4  详细需求  20.2  初始需求分析    20.2.1  大小／用户规模    20.2.2  联系方式信息的类型    20.2.3  应用程序访问    20.2.4  联系方式同步    20.2.5  用户证书  20.3  最新需求文档    20.3.1  执行纲要    20.3.2  假设/限制    20.3.3  详细需求  20.4  对最新需求的讨论  20.5  本章小结第21章  选择设计模式与计划  21.1  设计核心  21.2  设计用户交互    21.2.1  身份验证和授权    21.2.2  创建、编辑和删除用户    21.2.3  提供对所有用户的管理访问  21.3  设计联系方式管理    21.3.1  处理联系方式与信息    21.3.2  联系方式信息关系    21.3.3  导入联系方式    21.3.4  查看联系方式  21.4  本章小结第22章  应用程序编程  22.1  信息准备  22.2  应用程序编程    22.2.1  应用程序核心的编程    22.2.2  用户交互与管理的编程    22.2.3  联系方式管理的编程  22.3  本章小结第23章  使用更多设计模式进行改进  23.1  处理联系方式的导入    23.1.1  Outlook联系方式适配器    23.1.2  构建联系方式数组  23.2  去除视图中的逻辑  23.3  尽力实现设计模式    23.3.1  设计模式和错误检查    23.3.2  设计模式和联系方式管理    23.3.3  设计模式和视图类型    23.3.4  设计模式和删除对象    23.3.5  分享您的设计模式完善工作  23.4  本章小结",
      pages: "256",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s6180749.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s6180749.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s6180749.jpg"
      },
      alt: "https://book.douban.com/subject/4865086/",
      id: "4865086",
      publisher: "清华大学出版社",
      isbn10: "7302228434",
      isbn13: "9787302228431",
      title: "PHP设计模式",
      url: "https://api.douban.com/v2/book/4865086",
      alt_title: "",
      author_intro:
        "在Aaron Saray 8岁的时候，他接触到一台没有永久存储器的二手Commodore 64家用计算机，这使他开始着迷于计算机科学，并且了解了许多不同的语言和计算机。在2001年，Aaron最终决定选择使用PHP语言。从那时开始，他坚持学习其他多种Web语言（如HTML、CSS和JavaScript），同时不断充实自己的PHP专业知识。在其从业过程中，Aaron曾经为Internet Service Provider（ISP）设计和维护过各种Web站点工具，为一家大型牙科保险公司的客户创建过基于Web的账户管理工具，还为基于Internet连接的Point of Sales系统开发过后台管理Web站点。在成为Zend认证工程师后，Aaron开始应用Web开放源代码软件来创办运营自己的Web开发公司。",
      summary:
        "《PHP设计模式》内容简介：PHP通常被视为构建灵活和功能丰富的web应用程序的基石。由于学习相对简单，因此初级编程人员能够方便地采用PHP从头开始创建应用程序。然而，考虑到这些应用程序的规模，其维护工作令人畏惧。幸运的是，成熟的编程社区已经提供了包括设计模式在内的一些解决方案。这些针对相同问题的可重复解决方案已在其他编程语言中应用了多年。《PHP设计模式》的目标是：通过将经过实践检验的设计式应用于PHP应用程序，将PHP与早期的编程语言联系在一起。《PHP设计模式》首先介绍了设计模式，讲述了设计模式的使用及重要性，并且详细说明了应用设计模式的场合。接下来，《PHP设计模式》通过代码示例介绍了许多设计模式。最后，《PHP设计模式》通过全面深入的案例分析说明了如何使用设计模式来计划新的应用程序，如何采用PHP语言编写这些模式，以及如何使用书中介绍的设计模式修正和重构已有的代码块。作者采用专业的、便于使用的格式来介绍相关的概念，自学成才的编程人员与经过更多正规培训的编程人员都会非常熟悉这种格式。\n主要内容\n设计模式的含义及其在PHP中的重要性\n建立设计模式的PHP库的常规用法\n使用设计模式(如建造者、外观、原型和模板模式)更快速、更有效地创建对象\n使用数据访问对象和代理设计模式分离体系结构\n使用委托、工厂和单元素设计模式改善代码流和控制\n在不修改对象核心的情况下实现访问者和装饰器设计模式以增强对象\n全面的、使用观察者设计模式的插入式创建技术\n使用设计模式计划应用程序体系结构\n使用基于设计模式的编码方式从头至尾地完成一个web站点编程的案例分析\n在已有应用程序中发现设计模式的体系结构优势\n通过案例分析介绍进一步增强代码的方法\n\n  点击链接进入英文版： \n Professional PHP Design Patterns",
      price: "36.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 32,
        average: "8.0",
        min: 0
      },
      subtitle: "第2版",
      author: ["高洛峰"],
      pubdate: "2012-10-01",
      tags: [
        {
          count: 45,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 17,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 17,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 15,
          name: "编程",
          title: "编程"
        },
        {
          count: 13,
          name: "Web",
          title: "Web"
        },
        {
          count: 11,
          name: "互联网",
          title: "互联网"
        },
        {
          count: 8,
          name: "mysql",
          title: "mysql"
        },
        {
          count: 8,
          name: "PHP入门经典升级版",
          title: "PHP入门经典升级版"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s25136948.jpg",
      binding: "",
      translator: [],
      catalog:
        "第1部分 web开发入门篇\n第1章 lamp网站构建\n1.1 介绍网站给你认识\n1.1.1 web应用的优势\n1.1.2 web 2.0时代的互联网\n1.1.3 web开发标准\n1.1.4 认识脚本语言\n1.1.5 了解http协议\n1.2 动态网站开发所需的web构件\n1.2.1 客户端浏览器\n1.2.2 超文本标记语言html\n1.2.3 层叠样式表css\n1.2.4 客户端脚本编程语言javascript\n1.2.5 web服务器\n1.2.6 服务器端编程语言\n1.2.7 数据库管理系统\n1.3 几种主流的web应用程序平台\n1.3.1 web应用程序开发平台对比分析\n1.3.2 动态网站开发平台技术比较\n1.4 web的工作原理\n1.4.1 情景1：服务器不带应用程序服务器和数据库\n1.4.2 情景2：带应用程序服务器的web服务器\n1.4.3 情景3：浏览器访问服务器端的数据库\n1.5 lamp网站开发组合概述\n1.5.1 linux操作系统\n1.5.2 web服务器apache\n1.5.3 mysql数据库管理系统\n1.5.4 php后台脚本编程语言\n1.5.5 lamp发展趋势\n1.6 学php需要学习什么内容\n1.6.1 学php之前的准备\n1.6.2 学php时需要了解或掌握的内容\n1.6.3 优秀的web程序员是怎样练成的\n1.7 小结\n本章必须掌握的知识点\n本章需要了解的内容\n第2章 html的设计与应用\n2.1 网页制作概述\n2.1.1 html基础\n2.1.2 简单html实例制作\n2.2 html语言的语法\n2.2.1 html标签和元素\n2.2.2 html语法不区分字母大小写\n2.2.3 html标签属性\n2.2.4 html颜色值的设置\n2.2.5 html文档注释\n2.2.6 html代码格式\n2.2.7 html字符实体\n2.3 html文件的主体结构\n2.4 html文档头部元素[head]\n2.4.1 [title]元素\n2.4.2 [base]元素\n2.4.3 [link]元素\n2.4.4 [meta]元素\n2.5 html文档主体标记\n2.6 文字版面的编辑\n2.6.1 格式标签\n2.6.2 文本标签\n2.7 创建图像和链接\n2.7.1 插入图片\n2.7.2 建立锚点和超链接\n2.8 使用html表格\n2.9 html框架结构\n2.10 html表单设计\n2.11 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n本章的学习建议\n第3章 层叠样式表css\n3.1 css简介\n3.2 css规则的组成\n3.2.1 css注释\n3.2.2 长度单位\n3.2.3 颜色单位和url值\n3.3 在html文档中放置css的几种方式\n3.3.1 内联样式表\n3.3.2 嵌入一个样式表\n3.3.3 连接到一个外部的样式表\n3.4 css选择器\n3.4.1 html选择器\n3.4.2 类选择器\n3.4.3 id选择器\n3.4.4 关联选择器\n3.4.5 组合选择器\n3.4.6 伪元素选择器\n3.5 css常见的样式属性和值\n3.5.1 字体属性\n3.5.2 颜色属性\n3.5.3 背景属性\n3.5.4 文本属性\n3.5.5 边框属性\n3.5.6 鼠标光标属性\n3.5.7 列表属性\n3.5.8 综合示例\n3.6 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n本章的学习建议\n第4章 div+css网页标准化布局\n4.1 div+css对页面布局的优势\n4.2 “无意义”的html元素div和span\n4.3 w3c盒子模型\n4.4 和页面布局有关的css属性\n4.5 盒子区块框的定位\n4.5.1 相对定位\n4.5.2 绝对定位\n4.6 使用盒子模型的浮动布局\n4.6.1 设置浮动\n4.6.2 行框和清理\n4.7 div+css的兼容性问题\n4.7.1 不同浏览器解释盒子模型的差异\n4.7.2 设置浏览器去遵循w3c标准\n4.8 使用盒子模型设计页面布局\n4.8.1 居中设计\n4.8.2 设置两列浮动的布局\n4.8.3 设置三列浮动的布局\n4.8.4 设置多列浮动的布局\n4.9 div+css网站首页面布局实例\n4.9.1 html文件的设计\n4.9.2 css文件设计\n4.10 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n本章的学习建议\n第2部分 php基础篇\n第5章 从搭建你的php开发环境开始\n5.1 几种常见的php环境安装方式\n5.1.1 linux系统下源代码包方式安装环境\n5.1.2 在windows系统上安装web工作环境\n5.1.3 搭建学习型的php工作环境\n5.2 环境安装对操作系统的选择\n5.2.1 选择网站运营的操作系统\n5.2.2 选择网站开发的操作系统\n5.3 安装集成php开发环境\n5.3.1 安装前准备\n5.3.2 安装步骤\n5.3.3 环境测试\n5.4 phpmyadmin的配置与应用\n5.4.1 http身份验证模式\n5.4.2 cookie身份验证模式\n5.4.3 config身份验证模式\n5.5 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第6章 php的基本语法\n6.1 php在web开发中的应用\n6.1.1 就从认识php开始吧\n6.1.2 php都能做什么\n6.2 第一个php脚本程序\n6.3 php语言标记\n6.3.1 将php代码嵌入html中的位置\n6.3.2 解读开始和结束标记\n6.4 指令分隔符“分号”\n6.5 程序注释\n6.6 在程序中使用空白的处理\n6.7 变量\n6.7.1 变量的声明\n6.7.2 变量的命名\n6.7.3 可变变量\n6.7.4 变量的引用赋值\n6.8 变量的类型\n6.8.1 类型介绍\n6.8.2 布尔型（boolean）\n6.8.3 整型（integer）\n6.8.4 浮点型（float或double）\n6.8.5 字符串（string）\n6.8.6 数组（array）\n6.8.7 对象（object）\n6.8.8 资源类型（resource）\n6.8.9 null类型\n6.8.10 伪类型介绍\n6.9 数据类型之间相互转换\n6.9.1 自动类型转换\n6.9.2 强制类型转换\n6.9.3 类型转换细节\n6.9.4 变量类型的测试函数\n6.10 常量\n6.10.1 常量的定义和使用\n6.10.2 常量和变量\n6.10.3 系统中的预定义常量\n6.10.4 php中的魔术常量\n6.11 php中的运算符\n6.11.1 算术运算符\n6.11.2 字符串运算符\n6.11.3 赋值运算符\n6.11.4 比较运算符\n6.11.5 逻辑运算符\n6.11.6 位运算符\n6.11.7 其他运算符\n6.11.8 运算符的优先级\n6.12 表达式\n6.13 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第7章 php的流程控制结构\n7.1 分支结构\n7.1.1 单一条件分支结构（if）\n7.1.2 双向条件分支结构（else从句）\n7.1.3 多向条件分支结构（elseif子句）\n7.1.4 多向条件分支结构（switch语句）\n7.1.5 巢状条件分支结构\n7.1.6 条件分支结构实例应用（简单计算器）\n7.2 循环结构\n7.2.1 while语句\n7.2.2 do…while循环\n7.2.3 for语句\n7.3 特殊的流程控制语句\n7.3.1 break语句\n7.3.2 continue语句\n7.3.3 exit语句\n7.4 小结\n本章必须掌握的知识点\n本章需要了解的内容\n第8章 php的函数应用\n8.1 函数的定义\n8.2 自定义函数\n8.2.1 函数的声明\n8.2.2 函数的调用\n8.2.3 函数的参数\n8.2.4 函数的返回值\n8.3 函数的工作原理和结构化编程\n8.4 php变量的范围\n8.4.1 局部变量\n8.4.2 全局变量\n8.4.3 静态变量\n8.5 声明及应用各种形式的php函数\n8.5.1 常规参数的函数\n8.5.2 伪类型参数的函数\n8.5.3 引用参数的函数\n8.5.4 默认参数的函数\n8.5.5 可变个数参数的函数\n8.5.6 回调函数\n8.6 递归函数\n8.7 使用自定义函数库\n8.8 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第9章 php中的数组与数据结构\n9.1 数组的分类\n9.2 数组的定义\n9.2.1 直接赋值的方式声明数组\n9.2.2 使用array（）语言结构新建数组\n9.2.3 多维数组的声明\n9.3 数组的遍历\n9.3.1 使用for语句循环遍历数组\n9.3.2 使用foreach语句遍历数组\n9.3.3 联合使用list（ ）、each（ ）和while循环遍历数组\n9.3.4 使用数组的内部指针控制函数遍历数组\n9.4 预定义数组\n9.4.1 服务器变量：$_server\n9.4.2 环境变量：$_env\n9.4.3 url get变量：$_get\n9.4.4 http post变量：$_post\n9.4.5 request变量：$_request\n9.4.6 http文件上传变量：$_files\n9.4.7 http cookies：$_cookie\n9.4.8 session变量：$_session\n9.4.9 global变量：$globals\n9.5 数组的相关处理函数\n9.5.1 数组的键/值操作函数\n9.5.2 统计数组元素的个数和唯一性\n9.5.3 使用回调函数处理数组的函数\n9.5.4 数组的排序函数\n9.5.5 拆分、合并、分解和接合数组\n9.5.6 数组与数据结构\n9.5.7 其他有用的数组处理函数\n9.6 操作php数组需要注意的一些细节\n9.6.1 数组运算符号\n9.6.2 删除数组中的元素操作\n9.6.3 关于数组下标的注意事项\n9.7 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第10章 php面向对象的程序设计\n10.1 面向对象的介绍\n10.1.1 类和对象之间的关系\n10.1.2 面向对象的程序设计\n10.2 如何抽象一个类\n10.2.1 类的声明\n10.2.2 成员属性\n10.2.3 成员方法\n10.3 通过类实例化对象\n10.3.1 实例化对象\n10.3.2 对象类型在内存中的分配\n10.3.3 对象中成员的访问\n10.3.4 特殊的对象引用“$this”\n10.3.5 构造方法与析构方法\n10.4 封装性\n10.4.1 设置私有成员\n10.4.2 私有成员的访问\n10.4.3 __set（）、__get（）、__isset（）和__unset（）四个方法\n10.5 继承性\n10.5.1 类继承的应用\n10.5.2 访问类型控制\n10.5.3 子类中重载父类的方法\n10.6 常见的关键字和魔术方法\n10.6.1 final关键字的应用\n10.6.2 static关键字的使用\n10.6.3 单态设计模式\n10.6.4 const关键字\n10.6.5 instanceof关键字\n10.6.6 克隆对象\n10.6.7 类中通用的方法__tostring（）\n10.6.8 __call（）方法的应用\n10.6.9 自动加载类\n10.6.10 对象串行化\n10.7 抽象类与接口\n10.7.1 抽象类\n10.7.2 接口技术\n10.8 多态性的应用\n10.9 面向对象版图形计算器\n10.9.1 需求分析\n10.9.2 功能设计及实现\n10.9.3 类的组织架构\n10.10 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第11章 字符串处理\n11.1 字符串的处理介绍\n11.1.1 字符串的处理方式\n11.1.2 字符串类型的特点\n11.1.3 双引号中变量解析总结\n11.2 常用的字符串输出函数\n11.3 常用的字符串格式化函数\n11.3.1 去除空格和字符串填补函数\n11.3.2 字符串大小写的转换\n11.3.3 和html标签相关的字符串格式化\n11.3.4 其他字符串格式化函数\n11.4 字符串比较函数\n11.4.1 按字节顺序进行字符串比较\n11.4.2 按自然排序进行字符串比较\n11.5 小结\n本章必须掌握的知识点\n本章需要拓展的内容\n第12章 正则表达式\n12.1 正则表达式简介\n12.1.1 选择php正则表达式的处理函数库\n12.2 正则表达式的语法规则\n12.2.1 定界符\n12.2.2 原子\n12.2.3 元字符\n12.2.4 模式修正符\n12.3 与perl兼容的正则表达式函数\n12.3.1 字符串的匹配与查找\n12.3.2 字符串的替换\n12.3.3 字符串的分割和连接\n12.4 文章发布操作示例\n12.5 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要扩展的内容\n第3部分 php常用功能模块篇\n第13章 php的错误和异常处理\n13.1 错误处理\n13.1.1 错误报告级别\n13.1.2 调整错误报告级别\n13.1.3 使用trigger_error（）函数来替代die（）\n13.1.4 自定义错误处理\n13.1.5 写错误日志\n13.2 异常处理\n13.2.1 异常处理实现\n13.2.2 扩展php内置的异常处理类\n13.2.3 捕获多个异常\n13.3 小结\n本章必须掌握的知识点\n本章需要了解的内容\n第14章 php的日期和时间\n14.1 unix时间戳\n14.1.1 将日期和时间转变成unix时间戳\n14.1.2 日期的计算\n14.2 在php中获取日期和时间\n14.2.1 调用getdate（）函数取得日期/时间信息\n14.2.2 日期和时间格式化输出\n14.3 修改php的默认时区\n14.4 使用微秒计算php脚本执行时间\n14.5 日历类\n14.6 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n本章的学习建议\n第15章 文件系统处理\n15.1 文件系统概述\n15.1.1 文件类型\n15.1.2 文件的属性\n15.2 目录的基本操作\n15.2.1 解析目录路径\n15.2.2 遍历目录\n15.2.3 统计目录大小\n15.2.4 建立和删除目录\n15.2.5 复制目录\n15.3 文件的基本操作\n15.3.1 文件的打开与关闭\n15.3.2 写入文件\n15.3.3 读取文件内容\n15.3.4 访问远程文件\n15.3.5 移动文件指针\n15.3.6 文件的锁定机制\n15.3.7 文件的一些基本操作函数\n15.4 文件的上传与下载\n15.4.1 文件上传\n15.4.2 处理多个文件上传\n15.4.3 文件下载\n15.5 设计经典的文件上传类\n15.5.1 需求分析\n15.5.2 程序设计\n15.5.3 文件上传类代码实现\n15.5.4 文件上传类的应用过程\n15.6 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n本章的学习建议\n第16章 php动态图像处理\n16.1 php中gd库的使用\n16.1.1 画布管理\n16.1.2 设置颜色\n16.1.3 生成图像\n16.1.4 绘制图像\n16.1.5 在图像中绘制文字\n16.2 设计经典验证码类\n16.2.1 设计验证码类\n16.2.2 应用验证码类的实例对象\n16.2.3 表单中应用验证码\n16.2.4 实例演示\n16.3 php图片处理\n16.3.1 图片背景管理\n16.3.2 图片缩放\n16.3.3 图片裁剪\n16.3.4 添加图片水印\n16.3.5 图片旋转和翻转\n16.4 设计经典的图像处理类\n16.4.1 需求分析\n16.4.2 程序设计\n16.4.3 图像处理类代码实现\n16.4.4 图像处理类的应用过程\n16.5 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第4部分 数据库开发篇\n第17章 mysql数据库概述\n17.1 数据库的应用\n17.1.1 数据库在web开发中的重要地位\n17.1.2 为什么php会选择mysql作为自己的黄金搭档\n17.1.3 php和mysql的合作方式\n17.1.4 结构化查询语言sql\n17.2 mysql数据库的常见操作\n17.2.1 mysql数据库的连接与关闭\n17.2.2 创建新用户并授权\n17.2.3 创建数据库\n17.2.4 创建数据表\n17.2.5 数据表内容的简单管理\n17.3 小结\n本章必须掌握的知识点\n第18章 mysql数据表的设计\n18.1 数据表（table）\n18.2 数据值和列类型\n18.2.1 数值类的数据列类型\n18.2.2 字符串类数据列类型\n18.2.3 日期和时间型数据列类型\n18.2.4 null值\n18.2.5 类型转换\n18.3 数据字段属性\n18.4 数据表对象管理\n18.4.1 创建表（create table）\n18.4.2 修改表（alter table）\n18.4.3 删除表（drop table）\n18.5 数据表的类型及存储位置\n18.5.1 myisam数据表\n18.5.2 innodb数据表\n18.5.3 如何选择innodb还是myisam表类型\n18.5.4 数据表的储存位置\n18.6 数据表的默认字符集\n18.6.1 字符集\n18.6.2 字符集支持原理\n18.6.3 创建数据对象时修改字符集\n18.7 创建索引\n18.7.1 主键索引（primary key）\n18.7.2 唯一索引（unique）\n18.7.3 常规索引（index）\n18.7.4 全文索引（fulltext）\n18.8 规范化\n18.8.1 起点\n18.8.2 第一范式\n18.8.3 第二范式\n18.8.4 第三范式\n18.8.5 规范化理论\n18.9 数据库的设计技巧\n18.9.1 数据库设计要求\n18.9.2 起名字的技巧\n18.9.3 数据库具体设计工作中的技巧\n18.10 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第19章 sql语句设计\n19.1 操作数据表中的数据记录（dml）\n19.1.1 使用insert语句向数据表中添加数据\n19.1.2 使用update语句更新数据表中已存在的数据\n19.1.3 使用delete语句删除数据表中不需要的数据记录\n19.2 通过dql命令查询数据表中的数据\n19.2.1 选择特定的字段\n19.2.2 使用as子句为字段取别名\n19.2.3 distinct关键字的使用\n19.2.4 在select语句中使用表达式的列\n19.2.5 使用where子句按条件检索\n19.2.6 根据空值（null）确定检索条件\n19.2.7 使用between and进行范围比较\n查询\n19.2.8 使用in进行范围比对查询\n19.2.9 使用like进行模糊查询\n19.2.10 多表查询（连接查询）\n19.2.11 嵌套查询（子查询）\n19.2.12 使用order by对查询结果排序\n19.2.13 使用limit限定结果行数\n19.2.14 使用统计函数\n19.2.15 使用group by对查询结果分组\n19.3 查询优化\n19.4 小结\n本章必须掌握的知识点\n本章需要拓展的内容\n本章的学习建议\n第20章 php访问mysql的扩展函数\n20.1 php访问mysql数据库服务器的流程\n20.2 在php脚本中连接mysql服务器\n20.2.1 在php程序中选择已创建的数据库\n20.2.2 执行sql命令\n20.2.3 在php脚本中处理select查询结果集\n20.3 设计完美分页类\n20.3.1 需求分析\n20.3.2 程序设计\n20.3.3 完美分页类的代码实现\n20.3.4 分页类的应用过程\n20.4 管理books表实例\n20.4.1 需求分析\n20.4.2 程序设计\n20.5 php的mysqli扩展介绍\n20.5.1 启用mysqli扩展模块\n20.5.2 mysqli扩展接口的应用概述\n20.6 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n本章的学习建议\n第21章 数据库抽象层pdo\n21.1 pdo所支持的数据库\n21.2 pdo的安装\n21.3 创建pdo对象\n21.3.1 以多种方式调用构造方法\n21.3.2 pdo对象中的成员方法\n21.4 使用pdo对象\n21.4.1 调整pdo的行为属性\n21.4.2 pdo处理php程序和数据库之间的\n数据类型转换\n21.4.3 pdo的错误处理模式\n21.4.4 使用pdo执行sql语句\n21.5 pdo对预处理语句的支持\n21.5.1 了解pdostatement对象\n21.5.2 准备语句\n21.5.3 绑定参数\n21.5.4 执行准备好的查询\n21.5.5 获取数据\n21.5.6 大数据对象的存取\n21.6 pdo的事务处理\n21.6.1 mysql的事务处理\n21.6.2 构建事务处理的应用程序\n21.7 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第5部分 php开发高级篇\n第22章 memcache管理与应用\n22.1 memcache概述\n22.1.1 初识memcache\n22.1.2 memcache在web中的应用\n22.2 memcached的安装及管理\n22.2.1 linux下安装memcache软件\n22.2.2 windows下安装memcached软件\n22.2.3 memcached服务器的管理\n22.3 使用telnet作为memcached的客户端管理\n22.3.1 连接memcached服务器\n22.3.2 基本的memcached客户端命令\n22.3.3 查看当前memcached服务器的运行状态信息\n22.3.4 数据管理指令\n22.4 php的memcached管理接口\n22.4.1 安装php中的memcache应用程序扩展接口\n22.4.2 memcache应用程序扩展接口\n22.4.3 memcache的实例应用\n22.5 memcached服务器的安全防护\n22.6 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第23章 会话控制\n23.1 为什么要使用会话控制\n23.2 会话跟踪的方式\n23.3 cookie的应用\n23.3.1 cookie概述\n23.3.2 向客户端计算机中设置cookie\n23.3.3 在php脚本中读取cookie的资料内容\n23.3.4 数组形态的cookie应用\n23.3.5 删除cookie\n23.3.6 基于cookie的用户登录模块\n23.4 session的应用\n23.4.1 session概述\n23.4.2 配置session\n23.4.3 session的声明与使用\n23.4.4 注册一个会话变量和读取session\n23.4.5 注销变量与销毁session\n23.4.6 session的自动回收机制\n23.4.7 传递session id\n23.5 一个简单的邮件系统实例\n23.5.1 为邮件系统准备数据\n23.5.2 编码实现邮件系统\n23.5.3 邮件系统执行说明\n23.6 自定义session处理方式\n23.6.1 自定义session的存储机制\n23.6.2 使用数据库处理session信息\n23.6.3 使用memcached处理session信息\n23.7 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第24章 php的模板引擎smarty\n24.1 什么是模板引擎\n24.2 自定义模板引擎\n24.2.1 自定义模板引擎类\n24.2.2 使用自己的模板引擎\n24.2.3 应用自定义模板引擎的示例分析\n24.3 选择smarty模板引擎\n24.4 安装smarty及初始化配置\n24.4.1 安装smarty\n24.4.2 初始化smarty类库的默认设置\n24.4.3 第一个smarty的简单示例\n24.5 smarty的基本应用\n24.5.1 php程序员常用和smarty相关的操作\n24.5.2 模板设计时美工的常用操作\n24.6 smarty模板设计的基本语法\n24.6.1 模板中的注释\n24.6.2 模板中的变量应用\n24.6.3 模板中的函数应用\n24.6.4 忽略smarty解析\n24.7 在smarty模板中的变量应用\n24.7.1 从配置文件中读取变量\n24.7.2 在模板中使用保留变量\n24.8 在smarty模板中的变量调解器\n24.8.1 变量调解器函数的使用方式\n24.8.2 smarty默认提供的变量调解器\n24.8.3 自定义变量调解器插件\n24.9 smarty模板中自定义函数\n24.9.1 为smarty模板扩充函数插件\n24.9.2 为smarty模板扩充块函数插件\n24.10 smarty模板中的内置函数\n24.10.1 变量声明\n24.10.2 流程控制\n24.10.3 声明和调用模板函数\n24.10.4 数组遍历\n24.10.5 smarty提供的其他内置函数\n24.11 smarty的模板继承特性\n24.11.1 使用{extends}函数实现模板继承\n24.11.2 在子模板中覆盖父模板中的部分内容区域\n24.11.3 合并子模板和父模板的{block}标签内容\n24.12 smarty的缓存控制\n24.12.1 在smarty中控制缓存\n24.12.2 每个模板多个缓存\n24.12.3 为缓存实例消除处理开销\n24.12.4 清除缓存\n24.12.5 关闭局部缓存\n24.13 小结\n本章必须掌握的知识点\n本章需要了解的内容\n本章需要拓展的内容\n第25章 mvc模式与php框架\n25.1 mvc模式在web中的应用\n25.1.1 mvc模式的工作原理\n25.1.2 mvc模式的优缺点\n25.2 php开发框架\n25.2.1 什么是框架\n25.2.2 为什么要用框架\n25.2.3 框架和mvc设计模式的关系\n25.2.4 比较流行的php框架\n25.3 划分模块和操作\n25.3.1 为项目划分模块\n25.3.2 为模块设置操作\n第26章 超轻量级php框架brophp\n26.1 brophp框架概述\n26.1.1 系统特点\n26.1.2 环境要求\n26.1.3 brophp框架源码的目录结构\n26.2 单一入口\n26.2.1 基于brophp框架的单一入口编写规则\n26.3 部署项目应用目录\n26.3.1 项目部署方式\n26.3.2 url访问\n26.4 brophp框架的基本设置\n26.4.1 默认开启\n26.4.2 配置文件\n26.4.3 内置函数\n26.5 声明控制器（control）\n26.5.1 控制器的声明（模块）\n26.5.2 操作的声明\n26.5.3 页面跳转\n26.5.4 重定向\n26.6 设计视图（view）\n26.6.1 视图与控制器之间的交互\n26.6.2 切换模板风格\n26.6.3 模板文件的声明规则\n26.6.4 display（）用新用法\n26.6.5 在模板中的几个常用变量应用\n26.6.6 在php程序中定义资源位置\n26.7 应用模型（model）\n26.7.1 brophp数据库操作接口的特性\n26.7.2 切换数据库驱动\n26.7.3 声明和实例化model\n26.7.4 数据库的统一操作接口\n26.8 自动验证\n26.9 缓存设置\n26.9.1 基于memcached缓存设置\n26.9.2 基于smarty的缓存机制\n26.10 调试模式\n26.11 内置扩展类库\n26.11.1 分页类page\n26.11.2 验证码类vcode\n26.11.3 图像处理类image\n26.11.4 文件上传类fileupload\n26.12 自定义功能扩展\n26.12.1 自定义扩展类库\n26.12.2 自定义扩展函数库\n26.13 小结\n本章必须掌握的知识点\n本章需要了解的内容\n第6部分 项目开发篇\n第27章 b/s结构软件开发流程\n27.1 软件开发过程的划分\n27.2 需求开发\n27.2.1 需求分析流程\n27.2.2 需求分析说明\n27.2.3 输出\n27.3 系统设计\n27.3.1 系统设计流程\n27.3.2 系统设计说明\n27.4 编码测试\n27.4.1 编码与测试流程\n27.4.2 编码说明\n27.4.3 结果测试说明\n27.5 试运行\n27.5.1 软件试运行流程\n27.5.2 软件试运行说明\n27.6 实施\n27.6.1 软件实施流程\n27.6.2 软件实施说明\n27.7 验收\n27.7.1 软件验收流程\n27.7.2 软件验收说明\n27.7.3 验收标准\n27.8 服务与维护\n27.8.1 责任人\n27.8.2 收集信息\n27.8.3 维护分析\n27.8.4 软件维护\n27.8.5 改进\n27.8.6 输出\n27.9 项目管理\n27.9.1 软件项目的计划\n27.9.2 软件项目的组织\n27.9.3 项目小组组织形式\n27.10 项目参考\n第28章 需求分析说明书\n28.1 文档介绍\n28.1.1 编写说明\n28.1.2 项目背景\n28.1.3 读者对象\n28.1.4 参考资料\n28.1.5 术语与缩写解释\n28.2 任务概述\n28.2.1 产品的描述\n28.2.2 系统目标\n28.2.3 系统功能结构\n28.2.4 系统流程图\n28.3 业务描述\n28.3.1 后台登录管理\n28.3.2 后台操作界面管理\n28.3.3 常规管理\n28.3.4 公告管理\n28.3.5 友情链接管理\n28.3.6 相册管理\n28.3.7 图片管理\n28.3.8 栏目管理\n28.3.9 文章管理\n28.3.10 幻灯片管理\n28.3.11 用户组管理\n28.3.12 用户管理\n28.3.13 前台首页管理\n28.3.14 栏目列表管理\n28.3.15 文章内容管理\n28.3.16 文章搜索管理\n28.3.17 登录注册管理\n28.3.18 个人空间管理\n28.3.19 消息管理\n28.3.20 动态管理\n28.4 系统运行环境\n28.4.1 硬件环境\n28.4.2 软件环境\n28.5 需求设计评审\n第29章 数据库设计说明书\n29.1 引言\n29.1.1 编写目的\n29.1.2 背景\n29.1.3 定义\n29.1.4 参考资料\n29.2 外部设计\n29.2.1 标识符和状态\n29.2.2 使用它的程序\n29.2.3 约定\n29.2.4 支持软件\n29.3 结构设计\n29.4 逻辑结构设计\n29.4.1 er图向关系模型的转化\n29.4.2 确定关系模式\n29.4.3 消除冗余\n29.5 物理结构设计\n29.5.1 设计数据表结构\n29.5.2 创建数据表\n29.5.3 数据表记录的输入\n29.6 安全保密设计\n29.6.1 完整性\n29.6.2 数据库设计的其他问题\n第30章 程序设计说明书\n30.1 引言\n30.1.1 编写目的\n30.1.2 背景\n30.1.3 定义\n30.1.4 使用技术\n30.1.5 参考资料\n30.2 系统的结构\n30.2.1 项目的目录结构\n30.2.2 模块结构\n30.2.3 程序结构\n30.3 用户管理模块设计说明\n30.3.1 功能\n30.3.2 流程逻辑\n30.3.3 接口\n30.3.4 存储分配\n30.3.5 注释设计\n30.3.6 限制条件\n30.3.7 测试计划\n30.3.8 尚未解决的问题\n30.3.9 获取添加用户的界面操作add（）\n30.3.10 用户数据入库的操作insert（）\n30.3.11 查询用户列表操作index（）\n30.3.12 获取修改用户的界面操作mod（）\n30.3.13 用户数据修改的操作update（）\n30.3.14 删除用户操作del（）\n附 录\n附录a 编码规范\na.1 绪论\na.1.1 适用范围\na.1.2 目标\na.1.3 开发工具\na.2 php的文件格式\na.2.1 php开始和结束标记\na.2.2 注释规范\na.2.3 空行和空白\na.2.4 字符串的使用\na.2.5 命名原则\na.2.6 语言结构\na.2.7 其他规范细节\na.3 mysql设计规范\na.3.1 数据表的设计\na.3.2 索引设计原则\na.3.3 sql语句设计\na.4 模板设计\n附录b php的安全和优化\nb.1 网站安全security\nb.1.1 安全配置php\nb.1.2 隐藏配置细节\nb.1.3 隐藏敏感数据\nb.1.4 清理用户数据\nb.1.5 数据加密\nb.2 网站优化optimize\nb.2.1 php脚本级优化\nb.2.2 使用代码优化工具\nb.2.3 缓存加速\nb.2.4 http加速\nb.2.5 启用gzip内容压缩\n附录c、附录d见本书光盘",
      pages: "810",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s25136948.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s25136948.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s25136948.jpg"
      },
      alt: "https://book.douban.com/subject/19986437/",
      id: "19986437",
      publisher: "电子工业出版社",
      isbn10: "7121185636",
      isbn13: "9787121185632",
      title: "细说PHP",
      url: "https://api.douban.com/v2/book/19986437",
      alt_title: "",
      author_intro: "",
      summary:
        "《细说PHP(第2版)》共六个部分，分为30个章节，每一章都是PHP独立知识点的总结。内容涵盖了动态网站开发的前台技术（HTML+CSS）、PHP编程语言的语法、PHP的常用功能模块和实用技巧、MySQL数据库的设计与应用、PHP面向对象的程序设计思想、数据库抽象层PDO、Smarty模板技术、Web开发的设计模式、自定义框架BroPHP、Web项目开发整个流程等目前PHP开发中最主流的技术。每一章中都有大量的实用示例，以及详尽的注释，加速读者的理解和学习，也为每章的技术点设置了大量的自测试题。最后以一个比较完整的、采用面向对象思想，以及通过MVC模式设计，并结合Smarty模板，基于BroPHP框架的CMS系统为案例，详细介绍了Web系统开发从设计到部署的各个细节，便于更好地进行开发实践。",
      price: "109.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle:
        "Fast-track your web application development using the new generation Yii PHP framework",
      author: ["Mark Safronov", "Jeffrey Winesett"],
      pubdate: "2014-9-25",
      tags: [
        {
          count: 5,
          name: "Yii",
          title: "Yii"
        },
        {
          count: 3,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 2,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "程序猿",
          title: "程序猿"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s27812745.jpg",
      binding: "平装",
      translator: [],
      catalog: "",
      pages: "360",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s27812745.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s27812745.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s27812745.jpg"
      },
      alt: "https://book.douban.com/subject/26260359/",
      id: "26260359",
      publisher: "",
      isbn10: "1783981881",
      isbn13: "9781783981885",
      title: "Web Application Development with Yii 2 and PHP",
      url: "https://api.douban.com/v2/book/26260359",
      alt_title: "",
      author_intro: "",
      summary:
        "This book is for professional PHP developers who wish to master the powerful Yii 2 application framework. It is assumed that you have knowledge of object-oriented programming. The previous version of the Yii framework is only briefly mentioned, but it'll be even easier to grasp Yii 2 with the knowledge of Yii 1.1.x.",
      price: ""
    },
    {
      rating: {
        max: 10,
        numRaters: 29,
        average: "8.8",
        min: 0
      },
      subtitle: "",
      author: ["Luke Welling", "Laura Thomson"],
      pubdate: "July 25, 2007",
      tags: [
        {
          count: 47,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 32,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 12,
          name: "web",
          title: "web"
        },
        {
          count: 10,
          name: "编程",
          title: "编程"
        },
        {
          count: 9,
          name: "互联网",
          title: "互联网"
        },
        {
          count: 7,
          name: "Development",
          title: "Development"
        },
        {
          count: 6,
          name: "计算机类",
          title: "计算机类"
        },
        {
          count: 6,
          name: "Programming",
          title: "Programming"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4084950.jpg",
      binding: "Hardcover",
      translator: [],
      catalog: "",
      pages: "1008",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4084950.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4084950.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4084950.jpg"
      },
      alt: "https://book.douban.com/subject/2118632/",
      id: "2118632",
      publisher: "Sams",
      isbn10: "0672329166",
      isbn13: "9780672329166",
      title: "PHP and MySQL Web Development",
      url: "https://api.douban.com/v2/book/2118632",
      alt_title: "",
      author_intro: "",
      summary:
        "Book Description\nPHP and MySQL Web Development teaches you to develop dynamic, secure, commerical Web sites. Using the same accessible, popular teaching style of the three previous editions, this book has been thoroughly updated to reflect the rapidly changing landscape of MySQL and PHP. This fourth edition incorporates changes in the 5.1 specs of PHP and MySQL, as well as reflecting new trends in Web development in general. Some new highlights include coverage of Ajax, social networking sites, security concerns, and the PEAR repository of PHP extensions and applications.",
      price: "$49.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 21,
        average: "7.7",
        min: 0
      },
      subtitle: "",
      author: ["Jason Lengstorf"],
      pubdate: "2011-09-01",
      tags: [
        {
          count: 34,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 27,
          name: "jQuery",
          title: "jQuery"
        },
        {
          count: 4,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 4,
          name: "jquery",
          title: "jquery"
        },
        {
          count: 2,
          name: "互联网",
          title: "互联网"
        },
        {
          count: 2,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 1,
          name: "魏忠",
          title: "魏忠"
        },
        {
          count: 1,
          name: "网站开发",
          title: "网站开发"
        }
      ],
      origin_title: "Pro PHP and jQuery",
      image: "https://img3.doubanio.com/view/subject/m/public/s6881526.jpg",
      binding: "平装",
      translator: ["魏忠"],
      catalog:
        "第一部分  享受jQuery\n第1 章  jQuery 简介　　2\n1.1  为什么选择jQuery 　　2\n1.1.1  了解JavaScript 库　　2\n1.1.2  jQuery 的优点　　3\n1.1.3  jQuery 的历史　　3\n1.2  创建测试环境　　3\n1.2.1  安装Firefox 　　3\n1.2.2  安装Firebug　　4\n1.3  加载jQuery　　6\n1.3.1  加载本地jQuery 　　6\n1.3.2  加载存放在Google 服务器上的jQuery 　　6\n1.3.3  使用 Google AJAX LibrariesAPI 加载jQuery　　6\n1.4  建立测试文件　　6\n1.4.1  jQuery 函数（$）　　7\n1.4.2  用CSS 语法选择DOM 元素　　8\n1.5  小结　　19\n第2 章  jQuery 常用功能及方法　　20\n2.1  理解jQuery 脚本的基本行为　　20\n2.2  理解jQuery 方法　　20\n2.2.1  遍历DOM 元素　　21\n2.2.2  创建元素并将其添加到DOM 　　28\n2.2.3  获取和修改CSS 及属性　　39\n2.2.4  处理结果集　　47\n2.2.5  使用动画和其他效果　　49\n2.2.6  处理事件　　54\n2.2.7  使用AJAX 控制函数　　60\n2.3  小结　　64\n第二部分  PHP 高级编程\n第3 章  面向对象编程　　66\n3.1  理解面向对象编程　　66\n3.2  认识对象和类　　66\n3.2.1  类与对象的差异　　66\n3.2.2  创建类　　67\n3.2.3  定义类的属性　　68\n3.2.4  定义类的方法　　69\n3.2.5  使用类继承　　76\n3.2.6  指定属性或方法的可见度　　80\n3.2.7  文档块注释　　87\n3.3  面向对象与面向过程的差异　　88\n3.3.1  容易实现　　89\n3.3.2  更好的组织　　92\n3.3.3  更容易维护　　93\n3.4  小结　　93\n第4 章  构建活动日程表　　94\n4.1  规划设计　　94\n4.1.1  定义数据库结构　　94\n4.1.2  创建类映射　　94\n4.1.3  规划项目的目录结构　　95\n4.1.4  修改开发环境　　96\n4.2  构建日历页面　　98\n4.2.1  创建数据库　　98\n4.2.2  使用类连接数据库　　99\n4.2.3  创建Calendar 类　　100\n4.2.4  添加属性　　101\n4.2.5  编写构造函数　　102\n4.2.6  获取活动数据　　109\n4.2.7  输出HTML 显示日历及活动　　115\n4.2.8  显示活动详情页面　　129\n4.3  小结　　134\n第5 章  新建、修改和删除活动　　135\n5.1  生成创建或修改活动的表单　　135\n5.1.1  给表单添加记号　　137\n5.1.2  创建文件显示表单　　139\n5.1.3  为管理界面添加样式　　140\n5.2  保存新活动到数据库　　143\n5.2.1  处理表单提交数据　　145\n5.2.2  在日历界面添加按钮以方便添加新活动　　148\n5.3  在活动界面添加修改按钮　　150\n5.3.1  修改显示活动详情的方法让它显示修改按钮　　152\n5.3.2  给活动详情页面添加admin.css样式　　153\n5.4  删除活动　　155\n5.4.1  生成删除按钮　　.155\n5.4.2  创建confirmDelete()方法　　156\n5.4.3  创建确认表单页面　　159\n5.5  小结　　161\n第6 章  用密码保护敏感行为和私密数据　　162\n6.1  创建users 表　　162\n6.2  显示登录表单　　163\n6.3  创建Admin 类　　164\n6.3.1  定义Admin 类　　164\n6.3.2  写一个函数验证登录信息　　165\n6.3.3  写一个方法创建加“盐”的散列值　　169\n6.3.4  处理用户登录　　175\n6.4  用户登出　　179\n6.4.1  在日历界面添加登出按钮　　179\n6.4.2  写一个方法处理登出　　180\n6.4.3  修改这个应用处理用户登出　　181\n6.5  只对管理员显示管理选项　　183\n6.5.1  针对管理员显示管理选项　　 184\n6.5.2  限制管理页面的访问　　187\n6.6  小结　　 190\n第三部分  用jQuery 增强PHP 应用\n第7 章  用jQuery 加强用户界面　　 192\n7.1  用jQuery 实现渐进增强　　192\n7.2  在日程表项目中包含jQuery 　　193\n7.2.1  创建JavaScript 初始化文件　　193\n7.2.2  为jQuery 创建的元素添加样式　　 194\n7.3  为活动信息创建模态窗口　　 196\n7.3.1  为活动标题绑定click 事件处理函数　　197\n7.3.2  阻止click 事件的默认行为及添加标识激活状态的class 　　197\n7.3.3  用正则表达式提取查询字符串　　198\n7.3.4  创建模态窗口　　199\n7.3.5  用AJAX 获取和显示活动信息　　 203\n7.3.6  添加关闭按钮　　 208\n7.3.7  为模态窗口的创建和销毁增加显示效果　　 210\n7.4  小结　　217\n第8 章  用jQuery 实现修改活动的AJAX 版本　　218\n8.1  显示活动创建表单　　218\n8.1.1  增加AJAX 调用载入表单　　 219\n8.1.2  修改AJAX 处理文件以便载入表单　　220\n8.1.3  给Cancel 链接添加AJAX 行为（类似前面的Close 按钮）　　223\n8.2  保存新的活动　　 223\n8.3  无刷新添加活动　　 227\n8.3.1  反序列化表单数据　　 228\n8.3.2  创建日期对象　　232\n8.3.3  把活动追加到日历中　　 237\n8.3.4  获取新活动的ID 　　240\n8.4  在模态窗口中修改活动　　243\n8.4.1  确定表单行为　　243\n8.4.2  若活动ID 存在则保存之　　244\n8.4.3  在模态窗口中删除活动数据　　246\n8.4.4  确保只有新建活动才被添加到日历　　248\n8.5  在模态窗口中确认是否删除　　250\n8.5.1  显示确认对话框　　250\n8.5.2  为删除操作配置表单提交事件处理函数　　252\n8.5.3  成功删除活动之后将活动从日历中删除　　256\n8.6  小结　　258\n第四部分  jQuery 和PHP 进阶\n第9 章  用正则表达式进行表单验证　　260\n9.1  享受正则表达式　　260\n9.1.1  理解基本的正则表达式语法　　260\n9.1.2  深入了解基本模式修饰符　　264\n9.1.3  迷上反向引用　　266\n9.1.4  匹配字符类　　268\n9.1.5  匹配单词边界　　271\n9.1.6  使用重复次数操作符　　271\n9.1.7  检测字符串开始和结束　　272\n9.1.8  使用替代　　272\n9.1.9  使用可选项　　　273\n9.1.10  综合使用以上技术　　273\n9.2  添加服务器端日期验证　　275\n9.2.1  定义用于验证日期的正则表达式模式　　275\n9.2.2  在Calendar 类中添加验证日期的方法　　279\n9.2.3  若日期无效则返回错误　　280\n9.3  添加客户端日期验证　　284\n9.3.1  创建一个新的JavaScript 脚本文件，验证日期字符串　　284\n9.3.2  在页尾包含valid-date.js　　284\n9.3.3  若验证失败则阻止表单提交　　285\n9.4  小结　　288\n第10 章  扩展jQuery 　　289\n10.1  为jQuery 添加函数　　289\n10.1.1  把日期验证函数添加到jQuery 　　289\n10.1.2  修改包含脚本的代码　　292\n10.1.3  修改init.js　　292\n10.2  为 jQuery 对象添加支持链式调用的方法　　294\n10.2.1  创建自己的插件　　294\n10.2.2  将插件投入实际应用　　300\n10.3  小结　　302",
      pages: "302",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6881526.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6881526.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6881526.jpg"
      },
      alt: "https://book.douban.com/subject/6801681/",
      id: "6801681",
      publisher: "人民邮电出版社",
      isbn10: "7115261792",
      isbn13: "9787115261793",
      title: "深入PHP与jQuery开发",
      url: "https://api.douban.com/v2/book/6801681",
      alt_title: "Pro PHP and jQuery",
      author_intro:
        "Jason Lengstorf  Web设计师、资深互联网开发者，擅长使用PHP、MySQL、AJAX和Web标准构建内容管理系统，另著有PHP for Absolute Beginners一书。他是Ennui Designhttp://ennuidesign.com）沙龙的创办者，Ennui Design沙龙是Web设计师和开发者的盛会，它的参与者来自世界各地，精通站点定制技术。他还利用业余时间经营着一家名为Humblecock的服装公司。此外，他酷爱高尔夫、旅行和生啤。",
      summary:
        "《深入PHP与jQuery开发》是PHP与jQuery结合的经典之作。书中首先概括了jQuery和PHP的经典特性，随后详细阐述了如何高效地结合两种技术为应用构建高度交互的用户界面。《深入PHP与jQuery开发》共讲述4部分内容，分别为jQuery基础服务、面向对象的PHP、用jQuery增强PHP应用，以及运用jQuery和PHP高级技术完善用户体验。书中提供了大量实用的参考代码，让每一位读者能够立即体验两种技术结合的强大威力，打造个性化应用。\n《深入PHP与jQuery开发》读者对象为具有PHP和jQuery基础的Web开发人员。",
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 22,
        average: "6.1",
        min: 0
      },
      subtitle: "",
      author: ["[美] Tricia Ballad", "William Ballad"],
      pubdate: "2010-01-01",
      tags: [
        {
          count: 31,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 21,
          name: "安全",
          title: "安全"
        },
        {
          count: 9,
          name: "编程",
          title: "编程"
        },
        {
          count: 5,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 4,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 4,
          name: "服务器",
          title: "服务器"
        },
        {
          count: 3,
          name: "运维",
          title: "运维"
        },
        {
          count: 2,
          name: "基础理论",
          title: "基础理论"
        }
      ],
      origin_title: "Securing PHP Web Applications",
      image: "https://img3.doubanio.com/view/subject/m/public/s6111641.jpg",
      binding: "",
      translator: ["姜燕梅", "罗云峰", "武欣"],
      catalog:
        "译者序\n第一篇 Web开发是血腥运动——不打无准备仗\n第1章 服务器安全问题以及其他高深问题\t1\n1.1 现实检查\t1\n1.2 服务器安全问题\t2\n1.2.1 黑客通过非安全应用程序获得控制权\t3\n1.2.2 编程人员可以提高应用程序的安全性\t4\n1.3 安全困惑\t4\n1.4 自身的会话管理提供安全性\t6\n1.5 “我的应用程序并不值得攻击”\t6\n1.6 “门卫”的典型表现\t6\n1.7 小结\t7\n第二篇 安全漏洞是否大到能开大卡车\n第2章 处理错误\t9\n2.1 留言板应用程序\t9\n2.1.1 程序总结\t9\n2.1.2 主要代码清单\t9\n2.2 用户执行过度操作\t10\n2.2.1 这些代码会产生什么结果\t10\n2.2.2 期待非期望输入\t13\n2.3 构建错误处理机制\t14\n2.3.1 测试非期望输入\t14\n2.3.2 决定如何处理错误数据\t17\n2.3.3 简化系统的使用\t18\n2.4 小结\t20\n第3章 系统调用\t21\n3.1 了解exec()、system()以及backtick的风险\t21\n3.1.1 通过SUID位和sudo使用系统命令\t22\n3.1.2 使用系统资源\t22\n3.2 使用escapeshellcmd()和escapeshellarg()保护系统调用\t23\n3.2.1 escapeshellcmd()\t23\n3.2.2 escapeshellarg()\t24\n3.3 创建能够处理所有系统调用的API\t24\n3.3.1 为什么不转义参数呢\t24\n3.3.2 验证用户输入\t25\n3.4 修补留言板应用程序\t25\n3.4.1 moveFile（）函数\t25\n3.4.2 修补应用程序\t26\n3.5 小结\t27\n第三篇 名称里的内涵，远多于你所期望的\n第4章 缓冲区溢出和变量整理\t29\n4.1 什么是缓冲区，什么是缓冲区溢出以及为什么要关注它\t29\n4.1.1 缓冲区、堆栈、堆和内存分配\t30\n4.1.2 缓冲区溢出的后果\t32\n4.1.3 内存分配和PHP\t32\n4.1.4 关注最新的安全警告\t34\n4.2 通过变量整理预防缓冲区溢出\t37\n4.2.1 前提：数据在证实为安全之前，都可能是有问题的，尤其是来自应用程序之外的数据\t37\n4.2.2 数据是从哪儿来的\t37\n4.2.3 如何整理数据以防止缓冲区溢出\t37\n4.3 为应用程序打补丁\t38\n4.3.1 验证是否为最新的稳定版本…\t38\n4.3.2 检查变量整理\t39\n4.4 小结\t40\n第5章 验证输入\t41\n5.1 新特性：允许用户对留言板留言签名\t41\n5.2 问题：用户提供了过多的数据\t42\n5.2.1 发送垃圾邮件\t42\n5.2.2 注入攻击\t42\n5.3 假设：你了解你的数据\t42\n5.3.1 数据库限制\t43\n5.3.2 逻辑限制\t43\n5.4 解决方法：验证输入的正则表达式\t44\n5.4.1 数据污损\t44\n5.4.2 正则表达式简介\t45\n5.4.3 正则表达式的贪婪模式和惰性模式\t47\n5.4.4 常见验证输入模式\t49\n5.5 小结\t51\n第6章 文件系统访问：访问文件系统的乐趣和益处\t52\n6.1 打开文件\t52\n6.1.1 本地文件系统访问\t52\n6.1.2 远程文件系统访问\t53\n6.1.3 防止远程文件系统漏洞\t54\n6.2 创建并存储文件\t55\n6.2.1 允许文件上传\t55\n6.2.2 安全地存储文件\t56\n6.3 安全地修改文件属性\t57\n6.3.1 修改UNIX/Linux/Mac OS X的文件权限\t57\n6.3.2 修改Windows文件权限\t58\n6.3.3 在PHP中修改文件权限\t63\n6.4 修补应用程序以便支持用户上传图像文件\t64\n6.4.1 修改API\t64\n6.4.2 创建上传表单\t66\n6.5 小结\t66\n第四篇 “噢，你可以信任我”\n第7章 身份验证\t67\n7.1 什么是用户身份验证\t67\n7.1.1 用户名和密码\t68\n7.1.2 图像识别\t70\n7.2 权限\t71\n7.3 验证用户的方法\t71\n7.3.1 基于字典的身份验证\t71\n7.3.2 用户数据库\t79\n7.4 保存用户名和密码\t80\n7.4.1 加密\t80\n7.4.2 密码强度\t80\n7.4.3 评估漏洞\t81\n7.5 修补应用程序以便增加用户身份验证\t82\n7.5.1 添加User数据库表和确认数据库的安全性\t82\n7.5.2 创建身份验证API\t83\n7.6 小结\t84\n第8章 加密\t85\n8.1 什么是加密\t85\n8.2 加密类型\t86\n8.2.1 算法能力\t87\n8.2.2 速度和安全性\t87\n8.2.3 数据的使用\t88\n8.3 密码的安全性\t88\n8.4 在应用程序中增加密码加密功能…\t88\n8.4.1 修改User表\t89\n8.4.2 创建加密和salt函数\t89\n8.4.3 修改密码验证系统\t89\n8.5 小结\t90\n第9章 会话安全性\t91\n9.1 什么是会话变量\t91\n9.2 会话攻击的主要类型\t91\n9.2.1 会话固化\t91\n9.2.2 会话劫持\t93\n9.2.3 会话毒化（注入）\t94\n9.3 修补应用程序代码以提高会话安全性\t94\n9.4 小结\t96\n第10章 跨站式脚本编程\t97\n10.1 什么是XSS\t97\n10.2 反射式XSS\t97\n10.3 存储式XSS\t97\n10.4 修补应用程序代码防范XSS攻击\t98\n10.5 小结\t99\n第五篇 夜晚得锁门\n第11章 保护Apache和MySQL\t101\n11.1 编程语言、Web服务器以及操作系统本身都是不安全的\t101\n11.2 提高UNIX、Linux或Mac OS X环境的安全性\t102\n11.3 保护Apache\t103\n11.3.1 升级或安装Apache最新的稳定版本\t104\n11.3.2 设置Apache专有的用户和组\t106\n11.3.3 隐藏版本号以及其他敏感信息\t107\n11.3.4 将Apache限制在自身的目录结构中\t107\n11.3.5 禁用任何不必要的选项\t109\n11.3.6 安装和启用ModSecurity\t109\n11.4 保护MySQL\t113\n11.4.1 升级或安装最新版本\t113\n11.4.2 禁用远程访问\t116\n11.4.3 修改管理员用户名和密码…\t116\n11.4.4 删除默认的数据库用户并为每个应用程序创建新账户…\t117\n11.4.5 删除示例数据库\t118\n11.5 小结\t118\n第12章 IIS和SQL Server的安全性…\t119\n12.1 Windows服务器环境的安全性…\t119\n12.2 IIS的安全性\t125\n12.2.1 减少服务器的开放点\t125\n12.2.2 Web Root的安全性\t126\n12.3 SQL Server的安全性\t131\n12.3.1 安装或升级到最新版本\t131\n12.3.2 Microsoft SQL Server的安全性\t138\n12.4 小结\t143\n第13章 服务器端PHP的安全性\t144\n13.1 使用最新版本的PHP\t144\n13.1.1 Zend框架和Zend优化器\t144\n13.1.2 找到最新版本的PHP\t148\n13.1.3 使用Suhosin补丁和扩展\t149\n13.2 使用PHP和Apache内置的安全特性\t149\n13.2.1 safe_mode\t149\n13.2.2 SuEXEC\t150\n13.3 使用ModSecurity\t150\n13.4 php.ini的安全性\t151\n13.5 小结\t153\n第14章 自动化测试介绍\t154\n14.1 为什么在关于安全的书籍中介绍测试\t154\n14.2 测试框架\t155\n14.3 测试类型\t156\n14.3.1 单元测试\t156\n14.3.2 系统测试\t157\n14.4 选择合适的测试数据\t157\n14.5 小结\t158\n第15章 探索性测试介绍\t159\n15.1 什么是探索性测试\t159\n15.2 Fuzz测试\t160\n15.2.1 安装和配置PowerFuzzer\t160\n15.2.2 使用PowerFuzzer\t162\n15.3 测试工具集\t165\n15.3.1 下载CAL\t9000166\n15.3.2 使用CAL\t9000167\n15.4 专有测试套件\t176\n15.4.1 专有测试套件的优点和特性\t176\n15.4.2 使用专有测试套件扫描你的应用程序\t176\n15.5 小结\t181\n第六篇 “不被攻击”并不是一个可行的安全策略\n第16章 计划A：从开始阶段设计安全的应用程序\t183\n16.1 在开始编写代码之前\t183\n16.1.1 概念总结\t183\n16.1.2 工作流和角色图\t185\n16.1.3 数据设计\t186\n16.1.4 框架函数\t189\n16.2 标识故障点\t190\n16.2.1 登录和登出\t190\n16.2.2 文件上载\t191\n16.2.3 用户输入\t192\n16.2.4 文件系统访问\t192\n16.3 小结\t192\n第17章 计划B：去除已有应用程序的安全漏洞\t193\n17.1 设置环境\t193\n17.1.1 使用三阶段部署\t193\n17.1.2 使用版本控制\t194\n17.2 提高应用程序安全的检查列表…\t195\n17.2.1 检查服务器安全性\t195\n17.2.2 找到代码漏洞\t195\n17.2.3 修复最明显的问题\t196\n17.2.4 同事间的代码评审\t197\n17.3 小结\t197\n第18章 安全是生活方式的选择：成为一个优秀的编程人员\t198\n18.1 避免过多特性\t198\n18.2 编写自文档化代码\t199\n18.3 使用适合工作的工具\t200\n18.4 执行同事间的代码评审\t201\n18.5 小结\t201\n附录 额外资源\t202\n术语表\t206",
      pages: "208",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s6111641.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s6111641.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s6111641.jpg"
      },
      alt: "https://book.douban.com/subject/4221586/",
      id: "4221586",
      publisher: "机械工业出版社",
      isbn10: "7111291816",
      isbn13: "9787111291817",
      title: "PHP应用程序安全编程",
      url: "https://api.douban.com/v2/book/4221586",
      alt_title: "Securing PHP Web Applications",
      author_intro:
        "Tricia Ballad 在成为专职技术写作人员之前，她花费了几年时间从事LAMP（Linux、Apache、MySQL和PHP/Perl）平台上的Web应用程序开发工作。目前她专门编写不同技术的在线课件。\nWilliam Ballad 曾经工作在信息技术领域的各个层面，从父母的ISP公司的硬件维护工程师到世界级大型公司的基于Windows和异构网络的架构师。他多年来一直活跃在IT安全领域，最近领导着一支专门抵御国际化黑客组织攻击OptionCart（一个广泛使用的电子商务系统）的团队。",
      summary:
        "《PHP应用程序安全编程》通过实际情景、示例代码深入浅出地介绍了经常困挠PHPWeb应用程序开发人员的常见安全问题。主要内容包括：去除应用程序安全漏洞，防御PHP攻击，提高运行PHP代码的服务器安全，实施严格的身份验证以及加密应用程序，预防跨站点脚本攻击，系统化测试应用程序安全性，解决第三方应用程序已有漏洞等。\n《PHP应用程序安全编程》内容丰富，理论和实践紧密结合。通过详细概念说明和完整实例代码，读者可以轻松将自己所学的理论知识付诸实践。《PHP应用程序安全编程》适用于各个阶段的Web应用程序开发人员。",
      series: {
        id: "28671",
        title: "开发人员专业技术丛书"
      },
      price: "42.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP程序设计案例教程",
      author: [],
      pubdate: "2012-07-01",
      tags: [
        {
          count: 1,
          name: "PHP教程",
          title: "PHP教程"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s11157128.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "439",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s11157128.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s11157128.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s11157128.jpg"
      },
      alt: "https://book.douban.com/subject/11026277/",
      id: "11026277",
      publisher: "",
      isbn10: "7111381890",
      isbn13: "9787111381891",
      title: "PHP程序设计案例教程",
      url: "https://api.douban.com/v2/book/11026277",
      alt_title: "",
      author_intro: "",
      summary: "PHP程序设计案例教程，ISBN：9787111381891，作者：陈建国 著",
      price: "53.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP快速入门及项目实战",
      author: [],
      pubdate: "2012-01-01",
      tags: [
        {
          count: 2,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "123",
          title: "123"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s8938089.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "424",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s8938089.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s8938089.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s8938089.jpg"
      },
      alt: "https://book.douban.com/subject/10519253/",
      id: "10519253",
      publisher: "",
      isbn10: "7302273073",
      isbn13: "9787302273073",
      title: "PHP快速入门及项目实战",
      url: "https://api.douban.com/v2/book/10519253",
      alt_title: "",
      author_intro: "",
      summary:
        "《PHP学习路线图•PHP快速入门及项目实战》系统、全面地讲解了使用php语言进行编程的各种技术，全书分为4篇18章，其中第1篇为基础篇（第1～8章），主要内容包括：php概述，php基础，php函数，php流程控制语句，php数组，web技术，mysql数据库和php数据库编程技术；第2篇为技能提高篇（第9～13章），主要内容包括字符串高级处理，日期和时间处理，图形图像处理，文件目录处理和面向对象编程；第3篇为高级应用篇（第14～17章），主要内容包括pdo数据库抽象层，smarty模板，thinkphp框架和php的字符编码；第4篇为实战项目篇（第18章），通过模拟hao123网站，开发明日导航网站，以此来巩固所学基础知识，掌握应用thinkphp框架开发web项目的精髓。\n《PHP学习路线图•PHP快速入门及项目实战》提供了大量的自学视频、源程序、素材，提供了相关的模块库、案例库、素材库、题库等多种形式的辅助学习资料，还提供迅速及时的微博、qq、论坛等技术支持。\n《PHP学习路线图•PHP快速入门及项目实战》内容详尽，实例丰富，非常适合作为零基础学习人员的学习用书和大中专院校师生的学习教材，也适合作为相关培训机构的师生和软件开发人员的参考资料。",
      series: {
        id: "15816",
        title: "PHP学习路线图"
      },
      price: "49.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP函数速查效率手册",
      author: [],
      pubdate: "2012-10-01",
      tags: [
        {
          count: 1,
          name: "技术",
          title: "技术"
        },
        {
          count: 1,
          name: "d d",
          title: "d d"
        },
        {
          count: 1,
          name: "PHP",
          title: "PHP"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s24224916.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "663",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s24224916.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s24224916.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s24224916.jpg"
      },
      alt: "https://book.douban.com/subject/20260926/",
      id: "20260926",
      publisher: "",
      isbn10: "7121185008",
      isbn13: "9787121185007",
      title: "脑动力",
      url: "https://api.douban.com/v2/book/20260926",
      alt_title: "",
      author_intro: "",
      summary:
        "《脑动力:PHP函数速查效率手册》内容简介：PHP是现在最流行的网站开发技术。PHP提供的内部函数功能强大，解决常见的各种PHP问题。但是PHP函数繁杂，参数众多，造成学习和使用的不便。为了方便读者学习和程序开发，《脑动力:PHP函数速查效率手册》全面介绍了各类PHP函数。《脑动力:PHP函数速查效率手册》共分21章，PHP函数所涉及的范围包括MySQL服务器、Apache服务器、ODBC、String字符串、Array数组、Variable函数、时间日期、Hash、正则表达式、Session、Math、Filesystem、Directories、Mail、HTTP、URL、FTP、Stream、Network、 Image、Exif。",
      price: "59.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 4,
        average: "0.0",
        min: 0
      },
      subtitle: "Creating Modules, Components, and Plug-ins with PHP",
      author: ["Joseph LeBlanc"],
      pubdate: "",
      tags: [
        {
          count: 3,
          name: "joomla",
          title: "joomla"
        },
        {
          count: 1,
          name: "扩展开发",
          title: "扩展开发"
        },
        {
          count: 1,
          name: "手册教程",
          title: "手册教程"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s3017595.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "176",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s3017595.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s3017595.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s3017595.jpg"
      },
      alt: "https://book.douban.com/subject/3035188/",
      id: "3035188",
      publisher: "",
      isbn10: "1847191304",
      isbn13: "9781847191304",
      title: "Learning Joomla! 1.5 Extension Development",
      url: "https://api.douban.com/v2/book/3035188",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "$34.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 3,
        average: "0.0",
        min: 0
      },
      subtitle: "HTML, CSS, JavaScript, Perl, Python, and PHP",
      author: ["Steven M.  Schafer"],
      pubdate: "2005-08-05",
      tags: [
        {
          count: 3,
          name: "css",
          title: "css"
        },
        {
          count: 1,
          name: "html",
          title: "html"
        },
        {
          count: 1,
          name: ",网页设计",
          title: ",网页设计"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s1464242.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "812",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s1464242.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s1464242.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s1464242.jpg"
      },
      alt: "https://book.douban.com/subject/1452126/",
      id: "1452126",
      publisher: "Wrox",
      isbn10: "0764588206",
      isbn13: "9780764588204",
      title: "Web Standards Programmer's Reference",
      url: "https://api.douban.com/v2/book/1452126",
      alt_title: "",
      author_intro: "",
      summary:
        "Web Standards HTML, CSS, JavaScript, ; Perl, Python, ; and PHP Serving as  both a \"how-to\" guide and a reference, this book is one-stop reading for  all the essential Web standards XHTML, CSS, JavaScript, CGI with Perl and  Python, and PHP. In today's web environment, professional web coders and  serious enthusiasts need to create documents and scripts that comply with  published standards so your content can be viewed on as many web-capable  platforms as possible. This book teaches the standards and technologies  necessary to achieve that desired result. Packed with examples for  learning each of these standard technologies and followed by detailed  references to each language, this book provides a total package for moving your web publishing to current standards-based coding. What you will learn from this book A solid background and understanding of HTML and applying  XHTML to format specific document elements Using CSS to select and format  text, margins, colors, and other elements and position them on the page  Applying JavaScript for client-side scripting and dynamic content delivery Using server scripts and CGI with the popular Perl and Python languages  Publishing rich, dynamic content using the PHP scripting language The  importance of following web standards to ensure compatibility with as many user agents as possible, including Internet Explorer, the increasingly  important and popular Firefox, and the latest crop of mobile platforms How to avoid browser-specific code and deprecated tags and attributes that  cause your documents to be unusable for many users Who this book is for  The book is for programmers and web coders who want to learn web  standards-compliant coding. Wrox Programmer's References are designed to  give the experienced developer straight facts on a technology, without  hype or unnecessary explanations. They deliver hard information with  plenty of practical examples to help you apply these tools to your  development projects today.  ",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle: "http://www.shuzhan.net/modules/article/articleinfo.php?id=9",
      pubdate: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4147034.jpg",
      binding: "",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4147034.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4147034.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4147034.jpg"
      },
      alt: "https://book.douban.com/subject/1773184/",
      id: "1773184",
      title: "西洋军事史",
      author_intro:
        "伸缩自如的爱\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=9\n娇女猎夫\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=10\n收藏一个彼得潘\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=8\n我的王妃是男人\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=7\n乘龙快婿-\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=6\n男按摩师日记\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=5\n女按摩师日记\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=4\n欲望归零\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=3\n皇后重生\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=1",
      tags: [
        {
          count: 1,
          name: "韩少功",
          title: "韩少功"
        },
        {
          count: 1,
          name: "纪实文学",
          title: "纪实文学"
        },
        {
          count: 1,
          name: "期刊",
          title: "期刊"
        },
        {
          count: 1,
          name: "文学史",
          title: "文学史"
        },
        {
          count: 1,
          name: "停刊",
          title: "停刊"
        },
        {
          count: 1,
          name: "2的6次方",
          title: "2的6次方"
        },
        {
          count: 1,
          name: "1980年代",
          title: "1980年代"
        }
      ],
      origin_title: "",
      price: "",
      translator: ["牛先钟"],
      catalog: "",
      pages: "",
      publisher: "",
      isbn10: "SH15235-120",
      alt_title: "译者译者",
      url: "https://api.douban.com/v2/book/1773184",
      author: ["韩少功"],
      summary:
        "伸缩自如的爱\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=9\n娇女猎夫\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=10\n收藏一个彼得潘\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=8\n我的王妃是男人\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=7\n乘龙快婿-\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=6\n男按摩师日记\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=5\n女按摩师日记\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=4\n欲望归零\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=3\n皇后重生\nhttp://www.shuzhan.net/modules/article/articleinfo.php?id=1"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP开发典型模块大全",
      author: ["刘欣"],
      pubdate: "2012-06-01",
      tags: [
        {
          count: 4,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 2,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "web",
          title: "web"
        },
        {
          count: 1,
          name: "IT-PHP模块和项目",
          title: "IT-PHP模块和项目"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s10413480.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "668",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s10413480.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s10413480.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s10413480.jpg"
      },
      alt: "https://book.douban.com/subject/10797702/",
      id: "10797702",
      publisher: "",
      isbn10: "7115280126",
      isbn13: "9787115280121",
      title: "PHP开发典型模块大全",
      url: "https://api.douban.com/v2/book/10797702",
      alt_title: "",
      author_intro: "",
      summary:
        "刘欣等编著的《PHP开发典型模块大全(第3版)》通过21个典型模块系统、全面地介绍了如何使用PHP进行各领域的网页开发。全书共分为26章。前4章介绍了PHP环境搭建、PHP基础、MySQL数据库基础和Smarty模板，第5～25章通过对注册及登录验证模块、上传下载模块、分页显示模块、网站计数分析模块、留言本模块、搜索引擎模块、投票系统模块、购物车模块、在线支付模块、聊天室模块、论坛模块、许愿墙模块、博客模块、网络象棋游戏模块、短信群发模块、电子邮件模块、播客模块、在线音乐模块、电子相册模块、RSS阅读器模块和天气预报模块等21个模块进行详细地介绍，使读者能够掌握图形图像处理、多媒体、数据库、网络通信等各领域的相关技术，为从事项目开发的人员提供相关解决方案；第26章介绍了网站发布，使初学者能够了解使用PHP进行编程的基本思路和方法。\n    《PHP开发典型模块大全(第3版)》附有配套光盘。光盘提供了书中所有案例的全部源代码，所有源代码都经过精心调试，在Windows XP、Windows 2000、Windows Server 2003和Linux系统下全部通过，保证能够正常运行。此外，光盘中还提供了编程词典试用版软件。\n    《PHP开发典型模块大全(第3版)》案例涉及行业广泛，实用性非常强。通过对本书的学习，读者可以了解各个行业的特点，能够针对某一行业进行网站开发，也可以通过光盘中提供的模块源代码进行二次开发，以减少开发系统所需要的时间。本书适合各级软件开发人员学习使用，也可供大、中专院校师生学习参考。",
      price: "89.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP经典编程265例",
      author: [],
      pubdate: "2012-01-01",
      tags: [
        {
          count: 3,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "mj123456",
          title: "mj123456"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s8935237.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "440",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s8935237.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s8935237.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s8935237.jpg"
      },
      alt: "https://book.douban.com/subject/10519238/",
      id: "10519238",
      publisher: "",
      isbn10: "7302273154",
      isbn13: "9787302273158",
      title: "PHP经典编程265例",
      url: "https://api.douban.com/v2/book/10519238",
      alt_title: "",
      author_intro: "",
      summary:
        "《PHP学习路线图:PHP经典编程265例》以基础知识为框架，介绍了各部分知识所对应的常用开发实例，并进行透彻地解析。内容包括PHP基础、函数、PHP流程控制语句、Web技术、MySQL数据库、PHP数据库编程、字符串高级处理、PHP数组应用、日期和时间的处理、图形图像处理、文件目录处理、面向对象编程、PDO数据库抽象层、Smarty模板、ThinkPHP框架和PHP的字符编码。\n《PHP学习路线图:PHP经典编程265例》所精选的实例都是一线开发人员在实际项目中的积累，对这些实例进行了技术上的解析，并给出了详细的实现过程。读者通过对《PHP学习路线图:PHP经典编程265例》的学习，能够提高开发能力，积累开发经验。\n《PHP学习路线图:PHP经典编程265例》提供了大量的源程序、素材，提供了相关的模块库、案例库、素材库、题库等多种形式辅助学习资料，还提供迅速及时的微博、QQ、论坛等技术支持。\n《PHP学习路线图:PHP经典编程265例》内容详尽，实例丰富，非常适合作为零基础学习人员的学习用书和大中专院校师生的学习教材，也适合作为相关培训机构的师生和软件开发人员的参考资料。",
      series: {
        id: "15816",
        title: "PHP学习路线图"
      },
      price: "49.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 4,
        average: "0.0",
        min: 0
      },
      subtitle: "Solutions & Examples for PHP Programmers",
      author: ["David Sklar", "Adam Trachtenberg"],
      pubdate: "2014-5-25",
      tags: [
        {
          count: 4,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 1,
          name: "电子书",
          title: "电子书"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s28100537.jpg",
      binding: "平装",
      translator: [],
      catalog: "",
      pages: "820",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s28100537.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s28100537.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s28100537.jpg"
      },
      alt: "https://book.douban.com/subject/26416518/",
      id: "26416518",
      publisher: "O'Reilly Media",
      isbn10: "144936375X",
      isbn13: "9781449363758",
      title: "PHP Cookbook",
      url: "https://api.douban.com/v2/book/26416518",
      alt_title: "",
      author_intro:
        "David Sklar is a Distinguished Engineer at Ning, part of Glam Media. Inaddition to PHP Cookbook, he is the author of Learning PHP 5 (O'Reilly), and Essential PHP Tools (Apress), and a scintillating blog:http://www.sklar.com/blog/. David lives in New York City and has adegree in Computer Science from Yale University.\nAdam Trachtenberg is the Director of Platform and Services for eBay and is the author of two O'Reilly books, Upgrading to PHP 5 and PHP Cookbook.\nAdam has an MBA from Columbia Business School. While there, he focused on general management and operations, with an emphasis on the field of technology. Adam also has a BA from Columbia University. As an undergraduate he majored in mathematics, and his other studies included computer science and Chinese.",
      summary:
        "Want to understand a certain PHP programming technique? Or learn how to accomplish a particular task? This cookbook is the first place to look. With more than 350 code-rich recipes revised for PHP 5.4 and 5.5, this third edition provides updated solutions for generating dynamic web content—everything from using basic data types to querying databases, and from calling RESTful APIs to testing and securing your site.\nEach recipe includes code solutions that you can freely use, along with a discussion of how and why they work. Whether you’re an experienced PHP programmer or coming to PHP from another language, this book is an ideal on-the-job resource.\nYou’ll find recipes to help you with:\nBasic data types: strings, numbers, arrays, and dates and times\nProgram building blocks: variables, functions, classes, and objects\nWeb programming: cookies, forms, sessions, and authentication\nDatabase access using PDO, SQLite, and other extensions\nRESTful API clients and servers, including HTTP, XML, and OAuth\nKey concepts: email, regular expressions, and graphics creation\nDesigning robust applications: security and encryption, error handling, debugging and testing, and performance tuning\nFiles, directories, and PHP’s Command Line Interface\nLibraries and package managers such as Composer and PECL",
      price: "$59.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 6,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP Developer's Guide",
      author: ["Jamie Huskisson"],
      pubdate: "2010-01-01",
      tags: [
        {
          count: 2,
          name: "Magento",
          title: "Magento"
        },
        {
          count: 1,
          name: "php",
          title: "php"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4168401.jpg",
      binding: "paperback",
      translator: [],
      catalog: "",
      pages: "240",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4168401.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4168401.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4168401.jpg"
      },
      alt: "https://book.douban.com/subject/4280096/",
      id: "4280096",
      publisher: "Packt Publishing",
      isbn10: "1847197426",
      isbn13: "9781847197429",
      title: "Magento 1.3: PHP Developer's Guide",
      url: "https://api.douban.com/v2/book/4280096",
      alt_title: "",
      author_intro:
        "Design, develop, and deploy feature-rich Magento online stores with PHP coding\nExtend and customize the Magento e-commerce system using PHP code\nSet up your own data profile to import or export data in Magento\nBuild applications that interface with the customer, product, and order data using Magento's Core API\nPacked with examples for effective Magento Development\nIn Detail\nMagento is the most powerful e-commerce solution around and has gained popularity in a short period of time. You can create and manage online stores using the extensive suite of powerful tools it offers. However, because of its powerful features, developing with Magento can be easier said than done.\nThis book will show you how to develop better and do more with the Magento. You will be able to extend and customize modules for the Magento system without editing the core system code. It will show you how to create both basic and advanced functionality modules for your store and help you turn your ideas for extending Magento into reality by building modules from scratch.\nThis book starts by walking you through the server requirements for installing Magento making sure Magneto's installation and upgrade process can fit into your workflow and suit your hosting environment setup. Then it runs through the architecture behind Magento's system, covering the core file structure and how the template system works. You'll also learn how to build a basic shipping module, payment module, and a brand management module for Magento. As you delve deeper into the book you will learn how to integrate your favorite CMS into Magento for data portability.\nBy the end of the book you will be able to take your basic knowledge of Magento and turn it into something advanced that will help you develop turn your ideas for extending Magento into reality.\nWhat you will learn from this book\nInstall and upgrade Magento to get ready for development\nGet familiar with the architecture and internal structure of Magento\nLearn about the best modules available and what they can do for you out of the box\nBuild a Shipping module for your Magento store to give users options for receiving their items once they have paid for them\nCreate a payment method for Magento and the various aspects that go together to complete the payment process\nSpeed up your module creation process using the Module Creator script\nBuild a basic brand-management module for Magento to manage brands and display their details\nIntegrate your favorite CMS into Magento including a walkthrough of integrating Wordpress into Magento\nCreate, update, delete, and retrieve customer data from within Magento by implementing the customer API\nIntegrate Magento data into an existing external web application or script using the Magento Core API\nImport/export files to retrieve and store information from and to external sources using Excel Spreadsheet or CSV data\nChapter 1: Magento: Developer's Guide\nChapter 2: Installing/Upgrading Magento and Preparing for Development\nChapter 3: Magento's Architecture\nChapter 4: Building a Shipping Module for Magento\nChapter 5: Building a Payment Method for Magento\nChapter 6: Basic Modules to Extend Magento's Functionality\nChapter 7: Fully Featured Module with Administration Panel\nChapter 8: Integration of a Third-Party CMS\nChapter 9: Magento's Core API\nChapter 10: Importing and Exporting Data\nChapter 11: Appendix A - Resources for Further Learning\nApproach\nThis book is a practical tutorial, filled with examples, aimed at people with no experience of programming web sites using the Magento system.\nWho this book is written for\nIf you are a PHP developer who wants to understand the architecture of Magento, learn how to extend the system with PHP code, add new features, and integrate Magento with a third-party CMS, this book is for you.\nYou are expected to be a confident PHP 5 developer. No experience of Magento development is expected, although you should be familiar with the operation of Magento. No experience of the Zend framework is expected.\nAbout the Author\nJamie Huskisson\nA passionate 23-year old freelance developer from Nottingham, Jamie Huskisson has been working with Magento for the past two years since the very early Beta versions. His development client list features names such as the NHS, Volkswagen, and Nike building everything from web applications to e-commerce stores and small business sites. He also trains groups of developers and provides consulting on adopting open source technologies over closed systems for clients when required.",
      summary: "",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 3,
        average: "0.0",
        min: 0
      },
      subtitle:
        "100 Power Solutions: Simple Solutions to Practical PHP Problems",
      author: ["Robin Nixon"],
      pubdate: "2010-04-17",
      tags: [
        {
          count: 2,
          name: "php",
          title: "php"
        },
        {
          count: 1,
          name: "程序猿",
          title: "程序猿"
        },
        {
          count: 1,
          name: "祁杰",
          title: "祁杰"
        },
        {
          count: 1,
          name: "web",
          title: "web"
        },
        {
          count: 1,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 1,
          name: "PHP",
          title: "PHP"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s3955055.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "384",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s3955055.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s3955055.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s3955055.jpg"
      },
      alt: "https://book.douban.com/subject/4001888/",
      id: "4001888",
      publisher: "McGraw-Hill Osborne Media",
      isbn10: "0071666591",
      isbn13: "9780071666596",
      title: "Plug-In PHP",
      url: "https://api.douban.com/v2/book/4001888",
      alt_title: "",
      author_intro: "",
      summary:
        "This practical guide includes 100 power solutions to real-world problems. It gives you 100 ready-to-run PHP functions for solving most of the main problems you encounter when building a dynamic website with PHP. Every plug-in in the book offers a complete and working solution for a result you can achieve right away, using ready-made code you simply drop into your own program. And there's little or no learning curve, because each one is self-contained and thoroughly documented. \"Plug-in PHP\" is packed with programming tips and suggestions for further adapting the functions to your own needs, and even breaks down all the variables, arrays and functions used by each into at-a-glance tables, accompanied by a screen grab of every function in action. This makes the book extremely easy to use, even for complete beginners to PHP programming. A plug-in for every need. No matter what cookbook-style solutions you're looking for, you'll find the perfect functions in this book, and you can have them up and running in just a couple of minutes. For example, here's the complete list of plug-ins which, while comprehensive, simply doesn't do justice to the depth and breadth of help, information, and practical code provided in this book: Wrap Text; Caps Control; Friendly Text; Strip Whitespace; Word Selector; Count Tail; Text Truncate; Spell Check; Remove Accents; Shorten Text; Upload File; Resize Image; Make Thumbnail; Image Alter; Image Crop; Image Enlarge; Image Display; Image Convert; GIF Text; Image Watermark; Relative to Absolute URL; Get Links from URL; Check Links; Directory List; Query Highlight; Rolling Copyright; Embed YouTube Video; Create List; Hit Counter; Referer Log; Evaluate Expression; and, Validate Credit Card; Create Captcha; Check Captcha; Validate Text; Validate E-mail; and, Spam Catch. It also includes: Send E-mail; BB Code; Pound Code; Check Links; Get Title from URL; Auto Back Links; Create Short URL; Use Short URL; Simple Web Proxy; Page Updated?; HTML to RSS; RSS to HTML; HTML to Mobile; Users Online; Post to Guestbook; Get Guestbook; Post to Chat; View Chat; Send Tweet; Send Direct Tweet; Get Tweets; Replace Smileys; Replace SMS Talk; Add User to DB; Get User from DB; Verify User in DB; Sanitize String; Create Session; Open Session; Close Session; Secure Session; Manage Cookie; Block User by Cookie; Create Google Chart; Curl Get Contents; Fetch Wiki Page; Fetch Flickr Stream; Get Yahoo! Answers; Search Yahoo!; Get Yahoo! Stock News; Get Yahoo! News; Search Google Books; Convert Currency; Ajax Request; Post Ajax Request; Get Ajax Request; Protect E-mail; Toggle Text; Status Message; Slide Show; and Input Prompt; Words from Root; Predict Word; Get Country by IP; Bypass Captcha; Get Book from ISBN; Get Amazon Sales Rank. It also includes Pattern Match Word; Suggest Spelling; Google Translate; Corner GIF; Rounded Table; Display Bing Map Real world solutions Plug-in PHP has everything you need for processing text; image uploading and manipulation; content management; forms and user input; integrating your website with others; creating chat and messaging services; using MySQL; managing sessions and cookies; dealing with APIs; RSS; and, XML; integrating with JavaScript and Ajax; accessing geo-location; spell checking and language translation; and a great deal more. Written by PHP expert with many years of experience developing websites in PHP and writing about PHP development, this invaluable resource draws on the author's personal toolkit of solutions built up over the years. This means they are fast, tried-and-tested functions that have been proven to work in the real world, and they will work for you too.",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 27,
        average: "7.0",
        min: 0
      },
      subtitle: "",
      author: ["Rasmus Lerdorf", "Kevin Tatroe", "Peter MacIntyre"],
      pubdate: "2006-5-5",
      tags: [
        {
          count: 25,
          name: "php",
          title: "php"
        },
        {
          count: 9,
          name: "编程",
          title: "编程"
        },
        {
          count: 8,
          name: "web",
          title: "web"
        },
        {
          count: 8,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 7,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 4,
          name: "技术",
          title: "技术"
        },
        {
          count: 3,
          name: "英文",
          title: "英文"
        },
        {
          count: 3,
          name: "网络",
          title: "网络"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s9064505.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "542",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s9064505.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s9064505.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s9064505.jpg"
      },
      alt: "https://book.douban.com/subject/1777192/",
      id: "1777192",
      publisher: "O'Reilly Media",
      isbn10: "0596006810",
      isbn13: "9780596006815",
      title: "Programming PHP",
      url: "https://api.douban.com/v2/book/1777192",
      alt_title: "",
      author_intro: "",
      summary:
        'Programming PHP, 2nd Edition, is the authoritative guide to PHP 5 and is filled with the unique knowledge of the creator of PHP (Rasmus Lerdorf) and other PHP experts. When it comes to creating websites, the PHP scripting language is truly a red-hot property. In fact, PHP is currently used on more than 19 million websites, surpassing Microsoft\'s ASP .NET technology in popularity. Programmers love its flexibility and speed; designers love its accessibility and convenience. As the industry standard book on PHP, all of the essentials are covered in a clear and concise manner. Language syntax and programming techniques are coupled with numerous examples that illustrate both correct usage and common idioms. With style tips and practical programming advice, this book will help you become not just a PHP programmer, but a good PHP programmer. Programming PHP, Second Edition covers everything you need to know to create effective web applications with PHP. Contents include: * Detailed information on the basics of the PHP language, including data types, variables, operators, and flow control statements * Chapters outlining the basics of functions, strings, arrays, and objects * Coverage of common PHP web application techniques, such as form processing and validation, session tracking, and cookies * Material on interacting with relational databases, such as MySQL and Oracle, using the database-independent PEAR DB library and the new PDO Library * Chapters that show you how to generate dynamic images, create PDF files, and parse XML files with PHP * Advanced topics, such as creating secure scripts, error handling, performance tuning, and writing your own C language extensions to PHP * A handy quick reference to all the core functions in PHP and all the standard extensions that ship with PHP Praise for the first edition: "If you are just getting into the dynamic Web development world or you are considering migrating from another dynamic web product to PHP, Programming PHP is the book of choice to get you up, running, and productive in a short time." --Peter MacIntrye, eWeek "I think this is a great book for programmers who want to start developing dynamic websites with PHP. It gives a detailed overview of PHP, lots of valuable tips, and a good sense of PHP\'s strengths." --David Dooling, Slashdot.org',
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 8,
        average: "0.0",
        min: 0
      },
      subtitle: "",
      author: ["[英] David Powers"],
      pubdate: "2012-07-01",
      tags: [
        {
          count: 14,
          name: "网页设计",
          title: "网页设计"
        },
        {
          count: 13,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "Web开发",
          title: "Web开发"
        },
        {
          count: 2,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "设计",
          title: "设计"
        },
        {
          count: 1,
          name: "参考资料",
          title: "参考资料"
        }
      ],
      origin_title: "PHP Solutions : Dynamic Web Design",
      image: "https://img3.doubanio.com/view/subject/m/public/s10307181.jpg",
      binding: "平装",
      translator: ["陈宝国", "盛海艳", "张冠楠"],
      catalog:
        "目　　录\n第1章　 PHP是什么——我为什么要关注它　　1\n1.1　 PHP的发展史　　2\n1.2　 PHP是如何使页面实现动态效果的　　2\n1.3　 使用和学习PHP有多难　　5\n1.3.1　 是否可以只复制和粘贴代码　　6\n1.3.2　 PHP的安全性　　6\n1.4　 用什么软件来编写PHP　　6\n1.5　 继续学习　　8\n第2章　 准备开始使用PHP　　9\n2.1　 检查网站是否支持PHP　　9\n2.2　 建立本地的测试环境需要什么条件　　10\n2.3　 在Windows上安装　　11\n2.3.1　 使Windows显示出文件扩展名　　11\n2.3.2　 选择Web服务器　　11\n2.3.3　 在Windows上安装XAMPP　　12\n2.3.4　 使用Microsoft Web PI安装PHP　　15\n2.4　 在Mac OS X上安装　　17\n2.4.1　 安装MAMP　　18\n2.4.2　 测试和配置MAMP　　18\n2.5　 检查PHP设置（Windows和Mac）　　19\n2.6　 去哪里找PHP文件　　23\n2.7　 下一步　　24\n第3章　 如何编写PHP脚本　　25\n3.1　 PHP概述　　25\n3.1.1　 通知服务器处理PHP　　26\n3.1.2　 在网页中嵌入PHP　　26\n3.1.3　 将PHP存储到外部文件中　　27\n3.1.4　 使用变量来表示变化的值　　27\n3.1.5　 用分号结束命令　　29\n3.1.6　 注释脚本　　30\n3.1.7　 使用数组存储多个值　　31\n3.1.8　 PHP内置的超全局数组　　32\n3.1.9　 了解何时使用引号　　32\n3.1.10　 做出判断　　35\n3.1.11　 进行比较　　36\n3.1.12　 为清晰起见，使用缩进和空格　　37\n3.1.13　 使用循环来执行重复性任务　　37\n3.1.14　 使用函数来执行预设置任务　　37\n3.1.15　 PHP的类和对象　　38\n3.1.16　 显示PHP输出　　39\n3.1.17　 了解PHP错误消息　　40\n3.2　 PHP：快速参考　　42\n3.2.1　 在现有的网站中使用PHP　　42\n3.2.2　 PHP中的数据类型　　42\n3.2.3　 使用PHP进行计算　　43\n3.2.4　 添加到现有的字符串　　45\n3.2.5　 引号及其他　　45\n3.2.6　 创建数组　　48\n3.2.7　 关于PHP的事实　　50\n3.2.8　 创建循环　　54\n3.2.9　 使用函数使代码模块化　　56\n3.3　 PHP快速查阅清单　　58\n第4章　 使用包含功能减轻工作负担　　60\n4.1　 包含来自外部文件的代码　　61\n4.1.1　 PHP include命令简介　　61\n4.1.2　 PHP在哪里查找包含文件　　62\n4.1.3　 为包含选择正确的文件扩展名　　65\n4.1.4　 创建具有可变内容的页面　　73\n4.1.5　 使用包含文件防止错误　　80\n4.1.6　 选择放置包含文件的位置　　85\n4.1.7　 调整include_path　　86\n4.1.8　 为什么不能使用相对于站点根目录的链接来包含文件　　88\n4.1.9　 使用包含时要考虑的安全因素　　88\n4.2　 小结　　89\n第5章　 表单的使用　　90\n5.1　 PHP如何收集来自表单的信息　　90\n5.1.1　 理解post和get之间的区别　　92\n5.1.2　 利用PHP的超全局保证安全　　94\n5.1.3　 删除表单输入中不需要的反斜杠　　95\n5.2　 处理和验证用户输入　　96\n5.2.1　 创建可重用的脚本　　97\n5.2.2　 当表单不完整时保存用户输入　　101\n5.2.3　 过滤潜在的攻击　　103\n5.3　 发送邮件　　106\n5.3.1　 安全地使用其他邮件头部　　106\n5.3.2　 阻止垃圾邮件　　113\n5.4　 处理多选表单元素　　116\n5.5　 小结　　122\n第6章　 上传文件　　123\n6.1　 PHP如何处理文件上传　　123\n6.1.1　 检查服务器是否支持上传　　124\n6.1.2　 将文件上传字段添加到表单中　　125\n6.1.3　 理解$_FILES数组　　126\n6.1.4　 建立一个上传目录　　127\n6.2　 上传文件　　129\n6.3　 创建PHP文件上传类　　131\n6.3.1　 定义PHP类　　132\n6.3.2　 检查上传错误　　137\n6.3.3　 修改受保护的属性　　140\n6.3.4　 显式修改数据类型　　144\n6.3.5　 防止文件被覆盖　　145\n6.4　 上传多个文件　　148\n6.5　 在PHP 5.3和更高版本中使用命名空间　　153\n6.6　 使用上传类　　154\n6.7　 文件上传中要注意的问题　　155\n6.8　 小结　　155\n第7章　 使用PHP来管理文件　　156\n7.1　 检查PHP是否具有打开文件的权限　　156\n7.1.1　 影响文件访问的配置设置　　157\n7.1.2　 为本地测试创建文件存储文件夹　　158\n7.2　 读取和写入文件　　158\n7.2.1　 在单个操作中读取文件　　158\n7.2.2　 为读/写操作打开和关闭文件　　164\n7.3　 研究文件系统　　170\n7.3.1　 使用scandir()检查文件夹　　171\n7.3.2　 使用DirectoryIterator检查文件夹的内容　　171\n7.3.3　 使用RegexIterator限制文件类型　　173\n7.4　 访问远程文件　　177\n7.4.1　 使用新闻和其他RSS源　　178\n7.4.2　 使用SimpleXML　　179\n7.5　 创建下载链接　　183\n7.6　 小结　　186\n第8章　 生成缩略图　　187\n8.1　 检查服务器的功能　　187\n8.2　 动态操作图像　　188\n8.3　 在上传时自动调整图像的大小　　204\n8.3.1　 扩展一个类　　204\n8.3.2　 使用Ps2_ThumbnailUpload类　　208\n8.4　 小结　　209\n第9章　 有记忆功能的页面：简单登录和多页表单　　210\n9.1　 会话是什么以及它们是如何运行的　　210\n9.1.1　 创建PHP会话　　212\n9.1.2　 创建和销毁会话变量　　213\n9.1.3　 销毁会话　　213\n9.1.4　 重新生成会话ID　　213\n9.1.5  “Headers already sent”错误　　214\n9.2　 使用会话来限制访问　　214\n9.2.1　 使用基于文件的身份验证　　218\n9.2.2　 使密码更安全　　224\n9.3　 为会话设置时间限制　　234\n9.4　 通过多页表单传递信息　　237\n9.5　 小结　　242\n第10章　 MySQL入门　　243\n10.1　 为什么选择MySQL　　243\n10.2　 数据库如何存储信息　　244\n10.2.1　 主键如何工作　　245\n10.2.2　 使用主键和外键链接表　　246\n10.2.3　 把信息分解成小块　　247\n10.2.4　 良好的数据库设计要点　　247\n10.3　 通过图形界面使用MySQL　　247\n10.4　 建立phpsols数据库　　250\n10.4.1　 MySQL的命名规则　　250\n10.4.2　 使用phpMyAdmin创建新数据库　　251\n10.4.3　 创建特定于数据库的用户账户　　251\n10.4.4　 创建数据库表　　253\n10.4.5　 将记录插入到表中　　256\n10.4.6　 创建用于备份和数据传输的SQL文件　　258\n10.5　 在MySQL中选择正确的数据类型　　260\n10.5.1　 存储文本　　261\n10.5.2　 存储数值　　261\n10.5.3　 存储日期和时间　　262\n10.5.4　 存储预定义列表　　262\n10.5.5　 存储二进制数据　　262\n10.6　 小结　　263\n第11章　 用PHP和SQL连接MySQL　　264\n11.1　 检查远程服务器设置　　264\n11.2　 PHP如何与MySQL通信　　265\n11.2.1　 使用MySQL Improved扩展连接MySQL　　266\n11.2.2　 使用PDO连接MySQL　　266\n11.2.3　 PHP解决方案11-1：创建可重用的数据库连接程序　　267\n11.2.4　 从查询中查看结果数　　268\n11.2.5　 显示查询结果　　271\n11.2.6　 MySQL连接对比表　　272\n11.3　 使用SQL与数据库进行交互　　273\n11.3.1　 编写SQL查询　　274\n11.3.2　 优化SELECT查询所检索到的数据　　275\n11.3.3　 SQL注入的危险性　　278\n11.4　 小结　　290\n第12章　 创建动态在线图片库　　292\n12.1　 为什么不在数据库中储存图像　　293\n12.2　 规划图库　　293\n12.3　 把图片库元素转换为PHP　　295\n12.4　 构建动态元素　　297\n12.4.1　 通过查询字符串传递信息　　298\n12.4.2　 创建一个多列表　　300\n12.4.3　 逐页浏览长的记录集　　302\n12.5　 小结　　308\n第13章　 管理内容　　309\n13.1　 建立内容管理系统　　309\n13.1.1　 创建blog数据库表　　310\n13.1.2　 创建基本插入和更新表单　　311\n13.1.3　 插入新记录　　312\n13.1.4　 链接到更新和删除页面　　316\n13.1.5　 更新记录　　318\n13.1.6　 删除记录　　326\n13.2　 回顾4个基本的SQL命令　　327\n13.2.1　 SELECT　　327\n13.2.2　 INSERT命令　　329\n13.2.3　 UPDATE命令　　330\n13.2.4　 DELETE命令　　330\n13.3　 安全性与错误消息　　331\n13.4　 小结　　331\n第14章　 格式化文本和日期　　333\n14.1　 显示文本节选　　333\n14.1.1　 提取固定数目的字符　　333\n14.1.2　 提取完整的单词　　334\n14.1.3　 提取第一段　　335\n14.1.4　 提取完整的句子　　337\n14.2　 使用日期　　339\n14.2.1　 MySQL如何处理日期　　340\n14.2.2　 在MySQL中插入日期　　343\n14.2.3　 在PHP中处理日期　　348\n14.3　 小结　　360\n第15章　 从多个表中提取数据　　362\n15.1　 理解表的关系　　362\n15.2　 将图像链接到文章　　364\n15.2.1　 修改现有表的结构　　364\n15.2.2　 在表中插入外键　　365\n15.2.3　 从多个表中选择记录　　368\n15.2.4　 找到没有匹配外键的记录　　372\n15.2.5　 创建智能链接　　374\n15.3　 小结　　374\n第16章　 管理多个数据库表　　375\n16.1　 维护引用完整性　　375\n16.2　 将记录插入到多个表中　　378\n16.2.1　 创建交叉引用表　　380\n16.2.2　 获取上传图像的文件名　　381\n16.2.3　 调整插入表单来处理多个表　　382\n16.3　 更新和删除多个表中的记录　　390\n16.3.1　 更新交叉引用表中的记录　　390\n16.3.2　 执行删除操作时保持引用完整性　　393\n16.3.3　 创建具有外键约束的删除脚本　　396\n16.3.4　 创建没有外键约束的删除脚本　　397\n16.4　 小结　　398\n第17章　 使用数据库验证用户身份　　399\n17.1　 选择一种加密方法　　399\n17.2　 使用单向加密　　400\n17.2.1　 创建一个用于存储用户详细信息的表　　400\n17.2.2　 在数据库中注册新用户　　400\n17.3　 使用双向加密　　408\n17.3.1　 创建表来存储用户详细信息　　408\n17.3.2　 注册新用户　　408\n17.3.3　 使用双向加密的用户身份验证　　409\n17.3.4　 解密密码　　410\n17.4　 更新用户详细信息　　411\n17.5　 延伸学习　　411",
      pages: "411",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s10307181.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s10307181.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s10307181.jpg"
      },
      alt: "https://book.douban.com/subject/10789511/",
      id: "10789511",
      publisher: "人民邮电出版社",
      isbn10: "711528430X",
      isbn13: "9787115284303",
      title: "PHP动态网页设计（第2版）",
      url: "https://api.douban.com/v2/book/10789511",
      alt_title: "PHP Solutions : Dynamic Web Design",
      author_intro:
        "作者简介：\nDavid Powers\nAdobe社区专家、Adobe认证Dreamweaver讲师。 2010年成为首批获得PHP 5.3 Zend认证工程师的人。有近20年的网站开发经验，曾是BBC电视台日语频道的编辑，在此期间，他从零开始手动编写了一个双语网站。这段经历点燃了他进行Web开发的热情，并一直延续至今。\n2004之后，他致力于技术写作和讲授Web开发。撰写了一系列十分畅销的PHP和Web。",
      summary:
        "内容简介：\n作为运行于服务器端并完全跨平台的嵌入式脚本编程语言，PHP吸取了众多编程语言的优点，成为众多网页设计人员制作动态网页的首选语言。\n本书作者是Web开发专家，深谙如何让只有很少甚至没有编程经验的Web开发人员获得自信，并通过研究和调整代码达到设计要求。作者在上一版的基础上进行了全面更新，介绍了最前沿的技术，提供了编写高效代码的最佳方法。这些代码可以轻松部署到多个网站。此外，本书还新增了两章内容，分别介绍了PHP 5.2和PHP 5.3的日期和时间类，以及MySQL 5.5的默认存储引擎InnoDB外键约束。\n本书代码示例丰富，但绝不是一系列现成可用脚本的罗列。它解释了每个代码段的作用，以及为什么需要按特定方式使用这些代码，帮助读者快速了解PHP和数据库设计基础。通过本书，你将能够顺利构建PHP类，执行上传文件、创建缩略图、检查密码强度等任务。\n本书语言清晰、重点突出，针对Web设计师和开发人员日常工作中遇到的难题给出了最实际的解决方案，将帮助PHP零基础的读者迅速入门、进阶。",
      price: "69.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 46,
        average: "7.1",
        min: 0
      },
      subtitle: "",
      author: ["戴维斯"],
      pubdate: "2008-08-01",
      tags: [
        {
          count: 28,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 22,
          name: "MySQL",
          title: "MySQL"
        },
        {
          count: 11,
          name: "Web",
          title: "Web"
        },
        {
          count: 9,
          name: "编程语言",
          title: "编程语言"
        },
        {
          count: 7,
          name: "编程",
          title: "编程"
        },
        {
          count: 5,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 5,
          name: "网页设计",
          title: "网页设计"
        },
        {
          count: 3,
          name: "O'Reilly",
          title: "O'Reilly"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s5933963.jpg",
      binding: "",
      translator: ["董晓虎"],
      catalog:
        "前言\n第1章 动态内容和web\nhttp和互联网\nphp和mysql在web开发中的位置\n一个php应用程序的组件\n整合多种信息源\n请求一个网页数据\n第1章练习题\n第2章 安装\n本地部署\n远程工作\n第2章问题\n第3章 php初探\nphp和html文本\n编程组件\n第3章问题\n第4章 php的条件判断\n表达式\n运算符的概念\n条件语句\n.循环\n第4章问题\n第5章 函数\n调用函数\n定义函数\n面向对象编程\n第5章问题\n第6章 数组\n数组入门\n第6章问题\n第7章 使用mysql\nmysql数据库\n管理数据库\n使用phpmyadmin\n数据库概念\n结构化查询语言\n第7章问题\n第8章 数据库实践\n数据库设计\n备份和恢复数据\n高级sql\n第8章问题\n第9章 通过php访问mysql\n步骤\n使用php函数查询数据库\n使用pear\n第9章问题\n第10章 使用表单\n创建表单\n模板template\n第10章问题\n第11章 php实践\n字符串函数\n日期和时间函数..\n文件操作\n调用系统调用\n第11章问题\n第12章 xhtml\n为什么要使用xhtml\nxhtml和xml命名空间\nxhtml版本\n使用php生成xhtml\n第12章问题\n第13章 修改mysql对象和php数据\n通过php改变数据库对象\n操作表数据\n使用嵌入链接显示结果\n在一个文件里显示增加表单和处理表单\n更新数据\n删除数据\n执行子查询\n第13章问题\n第14章 cookie、会话和访问控制\ncookie\nphp和http身份认证\n会话\n使用auth_http进行验证\n第14章问题\n第15章 安全\n限制对管理页面的访问\n会话安全\n第15章问题\n第16章 验证和错误处理\n使用javascript验证用户输入\n模式匹配\nphp验证失败后重新显示表单\n第16章问题\n第17章 一个完整的应用程序\n配置文件\n页面框架\n数据库\n显示文章概要\n显示文章和它的评论\n增加和修改文章\n增加和修改评论\n第17章问题\n第18章 结束语\nphp编程规范\npear\n框架\najax\nwiki\n在互联网上寻求帮助\n第18章问题\n附录 各章问题答案",
      pages: "386",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s5933963.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s5933963.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s5933963.jpg"
      },
      alt: "https://book.douban.com/subject/3194855/",
      id: "3194855",
      publisher: "机械工业出版社",
      isbn10: "7111240812",
      isbn13: "9787111240815",
      title: "学习PHP和MySQL",
      url: "https://api.douban.com/v2/book/3194855",
      alt_title: "",
      author_intro:
        "Michele E．Davis从1988年起，她就拥有一个技术写作和软件培训的公司。她编著并与人合著了超过11本书。",
      summary:
        "《学习PHP和MySQL》内容全面，既解释了各种基础概念，又讨论了实现各种特定功能的具体细节，并附有示例应用来演示如何综合使用这些技术构建高效快速的Web站点。如果你有Web或图形设计的背景，且对HTML有一定了解，那么《学习PHP和MySQL》就正是你学习创建动态Web页面所需要的读物。\n《学习PHP和MySQL》主要内容：\nPHP基础，包括数据类型、程序流程控制、变量、函数、数组和表单。\n在各种环境下安装PHP和IMySQL的步骤。\nMySQL基础，比如表和SQL语句。\n使用SQL操作数据库的简单介绍。\n新增一章，介绍如何在PHlP中和网站上使用XHTML。\n安全和访问控制，介绍常见的安全问题。\n错误处理、HTTP身份认证和其他更多内容。",
      price: "55.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 41,
        average: "6.0",
        min: 0
      },
      subtitle: "（配光盘）（软件开发视频大讲堂）",
      author: ["邹天思", "孙鹏"],
      pubdate: "2008-10-1",
      tags: [
        {
          count: 18,
          name: "php",
          title: "php"
        },
        {
          count: 10,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 8,
          name: "web",
          title: "web"
        },
        {
          count: 4,
          name: "编程语言",
          title: "编程语言"
        },
        {
          count: 3,
          name: "技术",
          title: "技术"
        },
        {
          count: 2,
          name: "计算机科学",
          title: "计算机科学"
        },
        {
          count: 1,
          name: "软件",
          title: "软件"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "",
      image: "https://img1.doubanio.com/view/subject/m/public/s3276437.jpg",
      binding: "平装",
      translator: [],
      catalog: "",
      pages: "557",
      images: {
        small: "https://img1.doubanio.com/view/subject/s/public/s3276437.jpg",
        large: "https://img1.doubanio.com/view/subject/l/public/s3276437.jpg",
        medium: "https://img1.doubanio.com/view/subject/m/public/s3276437.jpg"
      },
      alt: "https://book.douban.com/subject/3207005/",
      id: "3207005",
      publisher: "清华大学出版社",
      isbn10: "730217959X",
      isbn13: "9787302179597",
      title: "PHP从入门到精通",
      url: "https://api.douban.com/v2/book/3207005",
      alt_title: "",
      author_intro: "",
      summary:
        "DVD语音视频教学光盘，22小时教学视频录像，全程语音讲解，本书实例源程序、相关素材，本书特色：基础知识—核心技术—高级应用—项目实战，268个应用实例，41个典型应用，1个项目案例，内容极为详尽，实例典型丰富。",
      price: "68.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 25,
        average: "5.6",
        min: 0
      },
      subtitle: "高级技巧、面向对象与核心技术",
      author: ["[美] Larry Ullman"],
      pubdate: "2014-1-1",
      tags: [
        {
          count: 14,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 9,
          name: "php",
          title: "php"
        },
        {
          count: 5,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 4,
          name: "编程",
          title: "编程"
        },
        {
          count: 3,
          name: "深入PHP",
          title: "深入PHP"
        },
        {
          count: 2,
          name: "面向对象",
          title: "面向对象"
        },
        {
          count: 2,
          name: "软件开发",
          title: "软件开发"
        },
        {
          count: 2,
          name: "编程语言",
          title: "编程语言"
        }
      ],
      origin_title:
        "PHP Advanced and Object-Oriented Programming Visual QuickPro Guide",
      image: "https://img3.doubanio.com/view/subject/m/public/s27251341.jpg",
      binding: "平装",
      translator: ["季国飞", "朱佩德"],
      catalog:
        "译者序\n前　言\n第1章　高级PHP技巧\n1.1 多维数组\n1.1.1 多维数组排序\n1.1.2 数据库驱动的数组\n1.2 高级函数定义\n1.2.1 递归函数\n1.2.2 使用静态变量\n1.2.3 匿名函数\n1.3 原型文档语法\n1.4 使用printf()和sprintf()\n1.5 回顾和启示\n第2章　开发Web应用程序\n2.1 模块化一个Web网站\n2.1.1 创建配置文件\n2.1.2 创建HTML模板\n2.1.3 创建索引文件\n2.1.4 创建内容模块\n2.1.5 创建搜索模块\n2.2 使用mod_rewrite优化SEO\n2.2.1 允许.htaccess重写\n2.2.2 激活URL重写\n2.3 调整浏览器缓存\n2.4 回顾和启示\n第3章　高级数据库概念\n3.1 在数据库中保存会话\n3.1.1 创建会话表\n3.1.2 定义会话函数\n3.1.3 使用新会话处理程序\n3.2 处理美国的邮政编码\n3.2.1 创建邮政编码表\n3.2.2 创建stores表\n3.2.3 计算距离\n3.3 创建存储函数\n3.4 水平显示结果\n3.5 回顾和启示\n第4章　面向对象编程基础知识\n4.1 面向对象编程的理论\n4.2 定义一个类\n4.3 创建对象\n4.4 $this属性\n4.5 创建构造函数\n4.6 创建析构函数\n4.7 使用UML设计类\n4.8 使用phpDocumentor生成更好的文档\n4.9 回顾和启示\n第5章　高级面向对象编程技术\n5.1 高级理论\n5.2 继承类\n5.3 继承构造函数和析构函数\n5.4 方法的重写\n5.5 访问控制\n5.6 使用范围解析操作符\n5.7 创建静态成员\n5.8 回顾和启示\n第6章　再谈高级面向对象编程\n6.1 抽象类和方法\n6.2 接口\n6.3 traits\n6.4 类型提示\n6.5 命名空间\n6.6 回顾和启示\n第7章　设计模式\n7.1 理解设计模式\n7.2 单例模式\n7.3 工厂模式\n7.4 组合模式\n7.5 策略模式\n7.6 回顾和启示\n第8章　使用既有的类\n8.1 捕获异常\n8.2 扩展Exception类\n8.3 使用PDO\n8.3.1 连接数据库\n8.3.2 捕获异常\n8.3.3 执行简单查询\n8.3.4 执行select查询\n8.3.5 使用预定义语句\n8.4 使用PHP标准库\n8.4.1 文件处理\n8.4.2 迭代器\n8.4.3 数据结构\n8.4.4 自动加载类\n8.5 回顾与启示\n第9章　面向对象编程实践：CMS系统示例\n9.1 明确编程目标\n9.2 创建数据库\n9.3 制作网页模板\n9.4 编写工具类文件\n9.5 创建Error视图文件\n9.6 定义需要的类\n9.6.1 Page类\n9.6.2 User类\n9.7 创建主页\n9.8 显示页面\n9.9 使用HTML_QuickForm2\n9.9.1 创建表单\n9.9.2 过滤并验证表单数据\n9.9.3 处理表单数据\n9.10 注销登录\n9.11 添加页面\n9.12 回顾与启示\n第10章　PHP网络编程\n10.1 访问其他网站\n10.2 PHP socket编程\n10.3 使用IP进行地址查询\n10.4 使用cURL\n10.5 创建Web服务\n10.5.1 Web服务介绍\n10.5.2 返回多种类型的数据\n10.5.3 创建简单Web服务\n10.6 回顾与启示\n第11章　PHP与服务器\n11.1 文件压缩\n11.2 创建cron任务\n11.3 使用MCrypt\n11.3.1 数据加密\n11.3.2 数据解密\n11.4 回顾与启示\n第12章　PHP的命令行界面\n12.1 测试安装\n12.2 执行一段代码\n12.3 可交互的PHP命令行界面\n12.4 创建命令行脚本\n12.5 运行命令行脚本\n12.6 使用命令行参数\n12.7 接收输入\n12.8 内置服务器\n12.9 回顾和启示\n第13章　XML和PHP\n13.1 什么是XML\n13.2 XML语法\n13.3 属性、空元素及实体\n13.4 定义XML架构\n13.4.1 包含DTD\n13.4.2 定义元素\n13.4.3 定义属性\n13.4.4 使用XML架构\n13.4.5 合并XSD\n13.4.6 定义元素\n13.4.7 简单类型与复杂类型\n13.4.8 创建属性\n13.5 XML解析\n13.5.1 使用Expat解析XML\n13.5.2 使用SimpleXML\n13.6 创建RSS源\n13.7 回顾与启示\n第14章　PHP程序调试、测试与性能\n14.1 调试工具\n14.1.1 安装Xdebug\n14.1.2 使用Xdebug\n14.2 单元测试\n14.2.1 安装PHPUnit\n14.2.2 定义测试\n14.2.3 创建测试用例\n14.2.4 运行测试\n14.2.5 建立测试\n14.3 脚本运行分析\n14.4 提高性能\n14.5 回顾与启示",
      pages: "474",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s27251341.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s27251341.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s27251341.jpg"
      },
      alt: "https://book.douban.com/subject/25844767/",
      id: "25844767",
      publisher: "机械工业出版社",
      isbn10: "7111451198",
      isbn13: "9787111451198",
      title: "深入理解PHP",
      url: "https://api.douban.com/v2/book/25844767",
      alt_title:
        "PHP Advanced and Object-Oriented Programming Visual QuickPro Guide",
      author_intro:
        "Larry Ullman 资深Web开发技术专家，国际知名技术畅销书作家，同时他还是经验丰富的培训师、教师、演说家和顾问。他已经出版了20多本著作，被翻译为20多种文字在全球发行，还发表了大量的技术文章，深受读者欢迎。Larry最深受读者喜爱的一点在于，他往往可以将晦涩难懂的专业术语转换为大家耳熟能详的语言。\n季国飞 资深Web开发工程师，混迹互联网多年。著有《jQuery开发技术详解》，专注于Web开发技术，目前关注Web前端开发、jQuery和node.js。\n朱佩德 网络编程达人，现于华为公司从事驱动开发工作。",
      summary:
        "这是一本帮助中初级PHP程序员修炼成为高级PHP程序员的书，也是一本让PHP程序员能更快、更好地进行应用开发的书。国际知名Web开发专家和技术畅销书作家最新力作，是PHP领域经典著作之一。它从编程技巧（PHP与MySQL的高级技巧）、面向对象（系统的面向对象知识）和扩展（PHP与其他技术的结合使用）三个角度系统讲解和总结了成为中高级PHP程序员应该具备的技术和技能，包含大量实用案例，极具可操作性。\n本书共14章，逻辑上分为3个部分：第一部分（第1～3章）总结了PHP编程、Web应用开发和MySQL数据库相关的高级知识和技巧，大部分内容都是中初级程序员可能不熟悉但是又应该掌握的；第二部分（第4～9章）系统讲解了面向对象编程的知识，包含大量深层次话题和生动的实例；第三部分（第10～14章）讲解了PHP的扩展知识以及PHP技术与其他技术的结合使用，如PHP应用与服务器的通信、PHP的命令行界面、PHP中的XML应用，以及PHP应用的调试、测试与性能调优等。",
      series: {
        id: "31205",
        title: "Web开发技术丛书"
      },
      price: "89.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP典型模块精解",
      author: [],
      pubdate: "2012-01-01",
      tags: [
        {
          count: 1,
          name: "繁荣提供",
          title: "繁荣提供"
        },
        {
          count: 1,
          name: "第二章",
          title: "第二章"
        },
        {
          count: 1,
          name: "徐鹏",
          title: "徐鹏"
        },
        {
          count: 1,
          name: "aa",
          title: "aa"
        },
        {
          count: 1,
          name: "77",
          title: "77"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s8932034.jpg",
      binding: "",
      translator: [],
      catalog:
        "第1章 注册登录模块\n1.1 注册及登录验证概述\n1.1.1 用户注册流程\n1.1.2 用户登录流程\n1.1.3 找回密码流程\n1.1.4 程序预览\n1.2 数据库设计\n1.2.1 数据库设计概述\n1.2.2 封装数据库连接、操作类\n1.3 用户注册\n1.3.1 用户注册功能概述\n1.3.2 注册页面设计\n1.3.3 检测用户名是否被占用\n1.3.4 注册信息处理\n1.3.5 注册用户激活\n1.3.6 免激活用户注册\n1.4 用户登录\n1.4.1 用户登录功能概述\n1.4.2 登录页面设计\n1.4.3 登录处理页\n1.4.4 生成及刷新验证码\n1.5 找回密码\n1.5.1 找回密码功能概述\n1.5.2 找回密码功能的实现过程\n1.6 技术提炼\n1.6.1 防SQL注入技术\n1.6.2 Ajax无刷新验证技术\n1.6.3 验证码技术\n1.6.4 E-mail激活技术\n1.6.5 应用键盘响应事件验证信息是否合法\n1.6.6 在PHP中操作Cookie技术\n1.6.7 在JavaScript中操作Cookie技术\n1.6.8 用户自动登录技术\n第2章 分页显示模块\n2.1 分页显示概述\n2.1.1 模块概述\n2.1.2 功能结构\n2.1.3 程序预览\n2.2 面向对象分页\n2.2.1 Smarty模板的安装和配置\n2.2.2 加载PDO数据库抽象层\n2.2.3 分页类模块的页面设计\n2.2.4 分页类模块的程序开发\n2.3 超长文本分页\n2.3.1 超长文本分页功能概述\n2.3.2 超长文本分页功能实现过程\n2.4 Ajax无刷新分页\n2.4.1 Ajax无刷新分页功能概述\n2.4.2 Ajax无刷新分页功能实现过程\n2.5 标准分页\n2.5.1 PHP标准分页功能概述\n2.5.2 PHP标准分页功能实现过程\n2.6 跳转分页\n2.6.1 PHP跳转分页功能概述\n2.6.2 PHP跳转分页功能的实现过程\n2.7 上下分页\n2.7.1 PHP上下分页功能概述\n2.7.2 PHP上下分页功能的实现过程\n2.8 技术提炼\n2.8.1 自定义函数替换超长文本中特殊字符技术\n2.8.2 自定义函数控制超长文本的输出技术\n2.8.3 连接数据库类的创建\n2.8.4 操作数据库类的创建\n2.8.5 分页类的创建\n2.8.6 类的实例化\n第3章 上传与下载模块\n3.1 上传、下载模块概述\n3.1.1 模块概述\n3.1.2 功能结构\n3.1.3 程序预览\n3.2 数据库设计\n3.2.1 数据库分析\n3.2.2 创建数据表\n3.2.3 数据库连接文件\n3.3 用户注册\n3.3.1 注册模块概述\n3.3.2 注册页面设计\n3.3.3 Ajax无刷新技术验证注册信息\n3.3.4 注册信息处理\n3.4 用户登录\n3.4.1 登录模块概述\n3.4.2 用户权限输出以及空间使用计算\n3.4.3 为用户划分个人文件目录\n3.4.4 防止用户文件目录的非法访问\n3.5 找回密码\n3.5.1 找回密码概述\n3.5.2 找回密码页面设计\n3.5.3 找回密码处理\n3.6 文件上传\n3.6.1 文件上传概述\n3.6.2 文件上传表单设计\n3.6.3 文件上传处理\n3.7 文件下载\n3.7.1 功能概述\n3.7.2 通过下载码下载文件\n3.7.3 同步删除文件以及释放用户空间\n3.8 后台管理\n3.8.1 后台管理概述\n3.8.2 用户权限管理页面设计\n3.8.3 更改用户权限表单设计\n3.8.4 执行权限更改操作\n3.9 技术提炼\n3.9.1 php.ini配置文件\n3.9.2 上传表单设置\n3.9.3 预定义变量$FILES\n3.9.4 上传文件函数\n3.9.5 多文件上传\n3.9.6 文件下载\n第4章 网页计数器模块\n4.1 网页计数器模块概述\n4.1.1 模块概述\n4.1.2 业务流程图\n4.2 简单数字计数器\n4.3 图形数字计数器\n4.4 GD2图形计数器\n4.5 数据库数字计数器\n4.6 网站访问量统计分析\n4.6.1 通过数据库记录网站访问量\n4.6.2 统计分析网站访问量\n……\n第5章 购物车模块\n第6章 在线支付模块\n第7章 假日公告管理模块\n第8章 投票系统模块\n第9章 留言本模块\n第10章 在线论坛模块\n第11章 博客模块\n第12章 在线编程词典模块\n第13章 邮件发送系统模块\n第14章 FTP管理系统模块\n第15章 创建PDF文档模块",
      pages: "398",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s8932034.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s8932034.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s8932034.jpg"
      },
      alt: "https://book.douban.com/subject/10519262/",
      id: "10519262",
      publisher: "",
      isbn10: "7302272050",
      isbn13: "9787302272052",
      title: "PHP典型模块精解",
      url: "https://api.douban.com/v2/book/10519262",
      alt_title: "",
      author_intro: "",
      summary:
        "《PHP学习线路图•PHP典型模块精解》以注册登录、分页显示、上传与下载、网页计数器、购物车、在线支付、假日公告管理、投票系统、留言本、在线论坛、博客、在线编程词典、邮件发送系统、ftp管理系统和创建pdf文档15个模块为案例，从web项目开发的角度出发，打造点、线、面一体化的学习架构，让读者既能够学习到子功能模块的实现方法、开发技巧，同时又能够合理地运用子功能模块，打造出完整的项目。\n《PHP学习线路图•PHP典型模块精解》模块涉及面广，实用性强。通过对《PHP典型模块精解》的学习，读者可以了解web开发中各个环节的特点、功能，以及如何合理地连接各个环节，打造出完整的项目。另外，《PHP典型模块精解》中所提供的模块不仅包括常用功能模块，还包含目前比较流行的热点模块，既可达到读者二次开发的目的，同时亦可满足读者对流行、热点内容的好奇心。\n《PHP学习线路图•PHP典型模块精解》提供了大量的自学视频、源程序、素材，提供了相关的模块库、案例库、素材库、题库等多种形式的辅助学习资料，还提供迅速及时的微博、QQ、论坛等技术支持。\n《PHP学习线路图•PHP典型模块精解》模块丰富，讲解细致，非常适合作为零基础学习人员的学习用书和大中专院校师生的学习教材，也适合作为相关培训机构的师生和软件开发人员的参考资料。",
      series: {
        id: "15816",
        title: "PHP学习路线图"
      },
      price: "49.80元"
    },
    {
      rating: {
        max: 10,
        numRaters: 4,
        average: "0.0",
        min: 0
      },
      subtitle: "Php Refactoring With Test Driven Design",
      author: ["Francesco Trucchia", "Jacopo Romei"],
      pubdate: "2010-07-07",
      tags: [
        {
          count: 2,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 1,
          name: "重构",
          title: "重构"
        },
        {
          count: 1,
          name: "程序猿",
          title: "程序猿"
        },
        {
          count: 1,
          name: "programming",
          title: "programming"
        },
        {
          count: 1,
          name: "php",
          title: "php"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4418155.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "335",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4418155.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4418155.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4418155.jpg"
      },
      alt: "https://book.douban.com/subject/4917353/",
      id: "4917353",
      publisher: "Apress",
      isbn10: "1430227273",
      isbn13: "9781430227274",
      title: "Pro PHP Refactoring",
      url: "https://api.douban.com/v2/book/4917353",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 49.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 4,
        average: "0.0",
        min: 0
      },
      subtitle: "PHP编程新手自学手册",
      author: ["谭贞军"],
      pubdate: "2012-10-01",
      tags: [
        {
          count: 3,
          name: "php",
          title: "php"
        },
        {
          count: 1,
          name: "编程语言",
          title: "编程语言"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s24409062.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "543",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s24409062.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s24409062.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s24409062.jpg"
      },
      alt: "https://book.douban.com/subject/19978347/",
      id: "19978347",
      publisher: "",
      isbn10: "7111392396",
      isbn13: "9787111392392",
      title: "PHP编程新手自学手册",
      url: "https://api.douban.com/v2/book/19978347",
      alt_title: "",
      author_intro: "",
      summary:
        "《PHP编程新手自学手册(附光盘)/新手学编程ABC丛书》编著者谭贞军等。\n    《PHP编程新手自学手册(附光盘)/新手学编程ABC丛书》内容提要：PHP是当今使用最广的Web编程语言之一，在项目开发领域占据重要的地位。本书循序渐进、由浅入深地讲解了PHP开发的核心技术，并通过具体实例的实现过程，演练了各个知识点的具体使用流程。全书分为4篇，共23章。其中1~7章是基础篇，讲解了PHP入门、开发必备知识、语法基础、流程控制、函数、数组、处理网页等知识；第8~16章是提高篇，讲解了操作字符串、文件操作、图像处理、PHP面向对象、会话管理、正则表达式、错误调试、操作XML Ajax技术等知识；第17~20章是数据库篇，讲解了MySQL数据库、PHP与MySQL的编程、PHP对其他数据库操作、模板技术等知识；第21~23章是实例篇，分别通过图片管理系统、在线投票系统、在线留言系统项目的实现过程，讲解了PHP在日常项目开发中的综合应用流程。全书以日记为主线，以“一问一答”引出问题，并穿插了学习技巧和职场生存法则，引领读者全面掌握PHP语言。 　　\n    本书不但适用于PHP初学者，也适用于有一定PHP编程基础的读者，还可供有一定造诣的程序员参考。",
      price: "89.90元"
    },
    {
      rating: {
        max: 10,
        numRaters: 28,
        average: "7.5",
        min: 0
      },
      subtitle: "New Features and Good Practices",
      author: ["Josh Lockhart"],
      pubdate: "2015-3-1",
      tags: [
        {
          count: 19,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 6,
          name: "php",
          title: "php"
        },
        {
          count: 5,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 2,
          name: "软件开发",
          title: "软件开发"
        },
        {
          count: 2,
          name: "英文原版",
          title: "英文原版"
        },
        {
          count: 2,
          name: "编程",
          title: "编程"
        },
        {
          count: 2,
          name: "Programming",
          title: "Programming"
        },
        {
          count: 2,
          name: "PDF",
          title: "PDF"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s28083071.jpg",
      binding: "Paperback",
      translator: [],
      catalog:
        "Part I Language Features\nChapter 1 The New PHP\nChapter 2 Features\nPart II Good Practices\nChapter 3 Standards\nChapter 4 Components\nChapter 5 Good Practices\nPart III Deployment, Testing, and Tuning\nChapter 6 Hosting\nChapter 7 Provisioning\nChapter 8 Tuning\nChapter 9 Deployment\nChapter 10 Testing\nChapter 11 Profiling\nChapter 12 HHVM and Hack\nChapter 13 Community\nAppendix: Installing PHP\nAppendix: Local Development Environments",
      pages: "268",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s28083071.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s28083071.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s28083071.jpg"
      },
      alt: "https://book.douban.com/subject/25982663/",
      id: "25982663",
      publisher: "O'Reilly Media",
      isbn10: "1491905018",
      isbn13: "9781491905012",
      title: "Modern PHP",
      url: "https://api.douban.com/v2/book/25982663",
      alt_title: "",
      author_intro:
        "Josh Lockhart is the creator of the Slim Framework for PHP. He also created and maintains PHP The Right Way, a popular initiative in the PHP community to encourage best practices and provide quality information. Josh is a senior developer at New Media Campaigns, a full service web design, development, and marketing agency in Carrboro, North Carolina.",
      summary:
        "PHP is experiencing a renaissance, though it may be difficult to tell with all of the outdated PHP tutorials online. With this practical guide, you’ll learn how PHP has become a full-featured, mature language with object-orientation, namespaces, and a growing collection of reusable component libraries.\nAuthor Josh Lockhart—creator of PHP The Right Way, a popular initiative to encourage PHP best practices—reveals these new language features in action. You’ll learn best practices for application architecture and planning, databases, security, testing, debugging, and deployment. If you have a basic understanding of PHP and want to bolster your skills, this is your book.\n- Learn modern PHP features, such as namespaces, traits, generators, and closures\n- Discover how to find, use, and create PHP components\n- Follow best practices for application security, working with databases, errors and exceptions, and more\n- Learn tools and techniques for deploying, tuning, testing, and profiling your PHP applications\n- Explore Facebook’s HVVM and Hack language implementations—and how they affect modern PHP\n- Build a local development environment that closely matches your production server",
      price: "USD 29.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 14,
        average: "7.7",
        min: 0
      },
      subtitle: "",
      author: ["Chris Shiflett"],
      pubdate: "2005-10-13",
      tags: [
        {
          count: 25,
          name: "php",
          title: "php"
        },
        {
          count: 15,
          name: "security",
          title: "security"
        },
        {
          count: 6,
          name: "安全",
          title: "安全"
        },
        {
          count: 5,
          name: "web",
          title: "web"
        },
        {
          count: 4,
          name: "programming",
          title: "programming"
        },
        {
          count: 4,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "PHP&MySQL",
          title: "PHP&MySQL"
        },
        {
          count: 2,
          name: "计算机",
          title: "计算机"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4247175.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "124",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4247175.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4247175.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4247175.jpg"
      },
      alt: "https://book.douban.com/subject/1767951/",
      id: "1767951",
      publisher: "O'Reilly Media",
      isbn10: "059600656X",
      isbn13: "9780596006563",
      title: "Essential PHP Security",
      url: "https://api.douban.com/v2/book/1767951",
      alt_title: "",
      author_intro: "",
      summary:
        "Being highly flexible in building dynamic, database-driven web applications makes the PHP programming language one of the most popular web development tools in use today. It also works beautifully with other open source tools, such as the MySQL database and the Apache web server. However, as more web sites are developed in PHP, they become targets for malicious attackers, and developers need to prepare for the attacks. Security is an issue that demands attention, given the growing frequency of attacks on web sites. Essential PHP Security explains the most common types of attacks and how to write code that isn't susceptible to them. By examining specific attacks and the techniques used to protect against them, you will have a deeper understanding and appreciation of the safeguards you are about to learn in this book. In the much-needed (and highly-requested) Essential PHP Security, each chapter covers an aspect of a web application (such as form processing, database programming, session management, and authentication).  Chapters describe potential attacks with examples and then explain techniques to help you prevent those attacks. Topics covered include:  * Preventing cross-site scripting (XSS) vulnerabilities * Protecting against SQL injection attacks * Complicating session hijacking attempts You are in good hands with author Chris Shiflett, an internationally-recognized expert in the field of PHP security. Shiflett is also the founder and President of Brain Bulb, a PHP consultancy that offers a variety of services to clients around the world.",
      price: "USD 29.95"
    },
    {
      rating: {
        max: 10,
        numRaters: 22,
        average: "7.4",
        min: 0
      },
      subtitle: "",
      author: ["马忠超"],
      pubdate: "2008-03-01",
      tags: [
        {
          count: 19,
          name: "php",
          title: "php"
        },
        {
          count: 8,
          name: "零基础学PHP",
          title: "零基础学PHP"
        },
        {
          count: 6,
          name: "web",
          title: "web"
        },
        {
          count: 5,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 3,
          name: "web开发",
          title: "web开发"
        },
        {
          count: 2,
          name: "学习php",
          title: "学习php"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "白",
          title: "白"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s9007360.jpg",
      binding: "",
      translator: [],
      catalog: "",
      pages: "469",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s9007360.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s9007360.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s9007360.jpg"
      },
      alt: "https://book.douban.com/subject/3044041/",
      id: "3044041",
      publisher: "",
      isbn10: "7111235622",
      isbn13: "9787111235620",
      title: "零基础学PHP",
      url: "https://api.douban.com/v2/book/3044041",
      alt_title: "",
      author_intro: "",
      summary:
        "《零基础学PHP》主要内容：PHP是一种运行于服务器端并完全跨平台的嵌入式脚本编程语言，是目前开发各类Web应用的主流语言之一。PHP因其功能强大、易学易用、可扩展性强、运行速度快和良好的开放性，而成为网站开发者的首选工具，其较高的开发效率，也给开发人员在编写Web应用程序时带来极大的便利。",
      price: "56.00元"
    },
    {
      rating: {
        max: 10,
        numRaters: 21,
        average: "7.5",
        min: 0
      },
      subtitle: "Objects, Design, Agility",
      author: ["Dagfinn Reiersol", "Marcus Baker", "Chris Shiflett"],
      pubdate: "2007-7-10",
      tags: [
        {
          count: 29,
          name: "php",
          title: "php"
        },
        {
          count: 5,
          name: "programming",
          title: "programming"
        },
        {
          count: 4,
          name: "互联网",
          title: "互联网"
        },
        {
          count: 3,
          name: "编程",
          title: "编程"
        },
        {
          count: 3,
          name: "PHP",
          title: "PHP"
        },
        {
          count: 2,
          name: "设计",
          title: "设计"
        },
        {
          count: 2,
          name: "webdev",
          title: "webdev"
        },
        {
          count: 1,
          name: "谢谢",
          title: "谢谢"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s4242381.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "552",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s4242381.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s4242381.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s4242381.jpg"
      },
      alt: "https://book.douban.com/subject/2003026/",
      id: "2003026",
      publisher: "Manning Publications",
      isbn10: "1932394753",
      isbn13: "9781932394757",
      title: "PHP in Action",
      url: "https://api.douban.com/v2/book/2003026",
      alt_title: "",
      author_intro: "",
      summary:
        "To keep programming productive and enjoyable, state-of-the-art practices and principles are essential. Object-oriented programming and design help manage complexity by keeping components cleanly separated. Unit testing helps prevent endless, exhausting debugging sessions. Refactoring keeps code supple and readable. PHP offers all this-and more.  This book shows you how to apply PHP techniques and principles to all the most common challenges of web programming, including:  Web presentation and templates User interaction including the Model-View-Contoller architecture Input validation and form handling Database connection and querying and abstraction Object persistence",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 0,
        average: "0.0",
        min: 0
      },
      subtitle:
        "A step-by-step tutorial for creating custom Facebook applications using the Facebook platform and PHP",
      author: ["Mark Alexander Bain", "Hasin Hayder"],
      pubdate: "2008-05-30",
      tags: [
        {
          count: 2,
          name: "facebook",
          title: "facebook"
        },
        {
          count: 1,
          name: "网络服务",
          title: "网络服务"
        },
        {
          count: 1,
          name: "程序",
          title: "程序"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s3794620.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "244",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s3794620.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s3794620.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s3794620.jpg"
      },
      alt: "https://book.douban.com/subject/3746589/",
      id: "3746589",
      publisher: "Packt Publishing",
      isbn10: "1847193692",
      isbn13: "9781847193698",
      title: "Learning Facebook Application Development",
      url: "https://api.douban.com/v2/book/3746589",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "USD 39.99"
    },
    {
      rating: {
        max: 10,
        numRaters: 1,
        average: "0.0",
        min: 0
      },
      subtitle:
        "Perl, Otwarta Tre , PHP, Tex, Tar, Ocaml, TCL, Opencola, Nasm, Zsh, Xfree86, Objective-C, Ruby on Rails, Otwarte Oprog",
      author: ["Zródlo: Wikipedia"],
      pubdate: "2012-3-3",
      tags: [
        {
          count: 2,
          name: "programming",
          title: "programming"
        },
        {
          count: 1,
          name: "计算机",
          title: "计算机"
        },
        {
          count: 1,
          name: "编程",
          title: "编程"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s11150066.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "52",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s11150066.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s11150066.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s11150066.jpg"
      },
      alt: "https://book.douban.com/subject/11534672/",
      id: "11534672",
      publisher: "Lightning Source UK Ltd",
      isbn10: "1232654442",
      isbn13: "9781232654445",
      title: "Open Source",
      url: "https://api.douban.com/v2/book/11534672",
      alt_title: "",
      author_intro: "",
      summary: "",
      price: "GBP 14.50"
    },
    {
      rating: {
        max: 10,
        numRaters: 2,
        average: "0.0",
        min: 0
      },
      subtitle:
        "Improve the performance of your PHP application to ensure the application users aren't left waiting",
      author: ["Altaf Hussain"],
      pubdate: "2016-4-25",
      tags: [
        {
          count: 1,
          name: "编程",
          title: "编程"
        },
        {
          count: 1,
          name: "★自学编程",
          title: "★自学编程"
        },
        {
          count: 1,
          name: "●2017",
          title: "●2017"
        },
        {
          count: 1,
          name: "PHP",
          title: "PHP"
        }
      ],
      origin_title: "",
      image: "https://img3.doubanio.com/view/subject/m/public/s29100366.jpg",
      binding: "Paperback",
      translator: [],
      catalog: "",
      pages: "202",
      images: {
        small: "https://img3.doubanio.com/view/subject/s/public/s29100366.jpg",
        large: "https://img3.doubanio.com/view/subject/l/public/s29100366.jpg",
        medium: "https://img3.doubanio.com/view/subject/m/public/s29100366.jpg"
      },
      alt: "https://book.douban.com/subject/26894188/",
      id: "26894188",
      publisher: "Packt Publishing",
      isbn10: "1785882260",
      isbn13: "9781785882265",
      title: "Learning PHP 7 High Performance",
      url: "https://api.douban.com/v2/book/26894188",
      alt_title: "",
      author_intro: "",
      summary:
        "About This Book\nMake the optimum use of PHP coding to improve your programming productivityLeverage the potential of PHP for server-side programming, memory management, and object-oriented programmingPacked with real-life examples to help the readers implement concepts as they learn\nWho This Book Is For\nThis book is for those who have basic experience in PHP programming. If you are developing performance-critical applications, then this book is for you.\nWhat You Will Learn\nSetup high performance development and production environment for PHP 7Discover new OOP features in PHP 7 to achieve high performanceImprove your PHP applications' performanceAttain improved database performanceBenchmark PHP applications to optimize themWrite quality code by learning to improve code reusability, simplicity, and expressivenessGet rid of the bottlenecks in your PHP 7 applications by writing PHP code optimallyTackle issues related to web applications, such as high user dependency and large datasets\nIn Detail\nPHP is a great language for building web applications. It is essentially a server-side scripting language that is also used for general-purpose programming. PHP 7 is the latest version, providing major backward-compatibility breaks and focusing on high performance and speed.\nThis fast-paced introduction to PHP 7 will improve your productivity and coding skills. The concepts covered will allow you, as a PHP programmer, to improve the performance standards of your applications. We will introduce you to the new features in PHP 7 and then will run through the concepts of object-oriented programming (OOP) in PHP 7. Next, we will shed some light on how to improve your PHP 7 applications' performance and database performance. Through this book, you will be able to improve the performance of your programs using the various benchmarking tools discussed.\nAt the end, the book discusses some best practices in PHP programming to help you improve the quality of your code.\nStyle and approach\nThe book is a step-by-step guide to improve the quality of your code in PHP through real-time examples. The book takes a practical approach to improving the quality of your code.",
      price: "USD 39.99"
    }
  ]
};
